zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
 /**
 * \file
 *
 * \brief Top header file for SAML21A (*** INTERNAL USE ONLY ***)
 *
 * Copyright (c) 2014 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef SAML21_INTERNAL_H
#define SAML21_INTERNAL_H


#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#include <stdint.h>
#ifndef __cplusplus
typedef volatile const uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile const uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile const uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#else
typedef volatile       uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile       uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile       uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#endif
typedef volatile       uint32_t WoReg;   /**< Write only 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t WoReg16; /**< Write only 16-bit register (volatile unsigned int) */
typedef volatile       uint32_t WoReg8;  /**< Write only  8-bit register (volatile unsigned int) */
typedef volatile       uint32_t RwReg;   /**< Read-Write 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t RwReg16; /**< Read-Write 16-bit register (volatile unsigned int) */
typedef volatile       uint8_t  RwReg8;  /**< Read-Write  8-bit register (volatile unsigned int) */
#define CAST(type, value) ((type *)(value))
#define REG_ACCESS(type, address) (*(type*)(address)) /**< C code: Register value */
#else
#define CAST(type, value) (value)
#define REG_ACCESS(type, address) (address) /**< Assembly code: Register address */
#endif

/* ************************************************************************** */
/**  CMSIS DEFINITIONS FOR U3005 */
/* ************************************************************************** */
/** \addtogroup U3005_cmsis CMSIS Definitions */
/*@{*/

/**< Interrupt Number Definition */
typedef enum IRQn
{
  /******  Cortex-M0+ Processor Exceptions Numbers *******************************/
  NonMaskableInt_IRQn      = -14, /**<  2 Non Maskable Interrupt                 */
  HardFault_IRQn           = -13, /**<  3 Cortex-M0+ Hard Fault Interrupt        */
  SVCall_IRQn              = -5,  /**< 11 Cortex-M0+ SV Call Interrupt           */
  PendSV_IRQn              = -2,  /**< 14 Cortex-M0+ Pend SV Interrupt           */
  SysTick_IRQn             = -1,  /**< 15 Cortex-M0+ System Tick Interrupt       */
  /******  U3005-specific Interrupt Numbers ***********************/
  MCLK_CFD_IRQn            =  0, /**<  0 U3005 Main Clock (MCLK) */
  MCLK_CKRDY_IRQn          =  0, /**<  0 U3005 Main Clock (MCLK) */
  OSCCTRL_DFLLLOCKC_IRQn   =  0, /**<  0 U3005 Oscillators Control (OSCCTRL) */
  OSCCTRL_DFLLLOCKF_IRQn   =  0, /**<  0 U3005 Oscillators Control (OSCCTRL) */
  OSCCTRL_DFLLOOB_IRQn     =  0, /**<  0 U3005 Oscillators Control (OSCCTRL) */
  OSCCTRL_DFLLRCS_IRQn     =  0, /**<  0 U3005 Oscillators Control (OSCCTRL) */
  OSCCTRL_DFLLRDY_IRQn     =  0, /**<  0 U3005 Oscillators Control (OSCCTRL) */
  OSCCTRL_DPLLLCKF_IRQn    =  0, /**<  0 U3005 Oscillators Control (OSCCTRL) */
  OSCCTRL_DPLLLCKR_IRQn    =  0, /**<  0 U3005 Oscillators Control (OSCCTRL) */
  OSCCTRL_DPLLLDRTO_IRQn   =  0, /**<  0 U3005 Oscillators Control (OSCCTRL) */
  OSCCTRL_DPLLLTO_IRQn     =  0, /**<  0 U3005 Oscillators Control (OSCCTRL) */
  OSCCTRL_OSC16MRDY_IRQn   =  0, /**<  0 U3005 Oscillators Control (OSCCTRL) */
  OSCCTRL_XOSCRDY_IRQn     =  0, /**<  0 U3005 Oscillators Control (OSCCTRL) */
  OSC32KCTRL_OSC32KRDY_IRQn =  0, /**<  0 U3005 32k Oscillators Control (OSC32KCTRL) */
  OSC32KCTRL_XOSC32RDY_IRQn =  0, /**<  0 U3005 32k Oscillators Control (OSC32KCTRL) */
  PAC_ERR_IRQn             =  0, /**<  0 U3005 Peripheral Access Controller (PAC) */
  PM_PLRDY_IRQn            =  0, /**<  0 U3005 Power Manager (PM) */
  SUPC_APWSRDY_IRQn        =  0, /**<  0 U3005 Supply Controller (SUPC) */
  SUPC_BOD12DET_IRQn       =  0, /**<  0 U3005 Supply Controller (SUPC) */
  SUPC_BOD12RDY_IRQn       =  0, /**<  0 U3005 Supply Controller (SUPC) */
  SUPC_BOD33DET_IRQn       =  0, /**<  0 U3005 Supply Controller (SUPC) */
  SUPC_BOD33RDY_IRQn       =  0, /**<  0 U3005 Supply Controller (SUPC) */
  SUPC_B12SRDY_IRQn        =  0, /**<  0 U3005 Supply Controller (SUPC) */
  SUPC_B33SRDY_IRQn        =  0, /**<  0 U3005 Supply Controller (SUPC) */
  SUPC_VCORERDY_IRQn       =  0, /**<  0 U3005 Supply Controller (SUPC) */
  SUPC_VREGRDY_IRQn        =  0, /**<  0 U3005 Supply Controller (SUPC) */
  TAL_BRK_IRQn             =  0, /**<  0 U3005 Trigger Allocator (TAL) */
  WDT_EW_IRQn              =  1, /**<  1 U3005 Watchdog Timer (WDT) */
  RTC_CMP_0_IRQn           =  2, /**<  2 U3005 Real-Time Counter (RTC) */
  RTC_CMP_1_IRQn           =  2, /**<  2 U3005 Real-Time Counter (RTC) */
  RTC_OVF_IRQn             =  2, /**<  2 U3005 Real-Time Counter (RTC) */
  RTC_PER_0_IRQn           =  2, /**<  2 U3005 Real-Time Counter (RTC) */
  RTC_PER_1_IRQn           =  2, /**<  2 U3005 Real-Time Counter (RTC) */
  RTC_PER_2_IRQn           =  2, /**<  2 U3005 Real-Time Counter (RTC) */
  RTC_PER_3_IRQn           =  2, /**<  2 U3005 Real-Time Counter (RTC) */
  RTC_PER_4_IRQn           =  2, /**<  2 U3005 Real-Time Counter (RTC) */
  RTC_PER_5_IRQn           =  2, /**<  2 U3005 Real-Time Counter (RTC) */
  RTC_PER_6_IRQn           =  2, /**<  2 U3005 Real-Time Counter (RTC) */
  RTC_PER_7_IRQn           =  2, /**<  2 U3005 Real-Time Counter (RTC) */
  EIC_EXTINT_0_IRQn        =  3, /**<  3 U3005 External Interrupt Controller (EIC) */
  EIC_EXTINT_1_IRQn        =  3, /**<  3 U3005 External Interrupt Controller (EIC) */
  EIC_EXTINT_2_IRQn        =  3, /**<  3 U3005 External Interrupt Controller (EIC) */
  EIC_EXTINT_3_IRQn        =  3, /**<  3 U3005 External Interrupt Controller (EIC) */
  EIC_EXTINT_4_IRQn        =  3, /**<  3 U3005 External Interrupt Controller (EIC) */
  EIC_EXTINT_5_IRQn        =  3, /**<  3 U3005 External Interrupt Controller (EIC) */
  EIC_EXTINT_6_IRQn        =  3, /**<  3 U3005 External Interrupt Controller (EIC) */
  EIC_EXTINT_7_IRQn        =  3, /**<  3 U3005 External Interrupt Controller (EIC) */
  EIC_EXTINT_8_IRQn        =  3, /**<  3 U3005 External Interrupt Controller (EIC) */
  EIC_EXTINT_9_IRQn        =  3, /**<  3 U3005 External Interrupt Controller (EIC) */
  EIC_EXTINT_10_IRQn       =  3, /**<  3 U3005 External Interrupt Controller (EIC) */
  EIC_EXTINT_11_IRQn       =  3, /**<  3 U3005 External Interrupt Controller (EIC) */
  EIC_EXTINT_12_IRQn       =  3, /**<  3 U3005 External Interrupt Controller (EIC) */
  EIC_EXTINT_13_IRQn       =  3, /**<  3 U3005 External Interrupt Controller (EIC) */
  EIC_EXTINT_14_IRQn       =  3, /**<  3 U3005 External Interrupt Controller (EIC) */
  EIC_EXTINT_15_IRQn       =  3, /**<  3 U3005 External Interrupt Controller (EIC) */
  NVMCTRL_0_IRQn           =  4, /**<  4 U3005 Non-Volatile Memory Controller (NVMCTRL) */
  NVMCTRL_1_IRQn           =  4, /**<  4 U3005 Non-Volatile Memory Controller (NVMCTRL) */
  DMAC_SUSP_0_IRQn         =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_SUSP_1_IRQn         =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_SUSP_2_IRQn         =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_SUSP_3_IRQn         =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_SUSP_4_IRQn         =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_SUSP_5_IRQn         =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_SUSP_6_IRQn         =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_SUSP_7_IRQn         =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_SUSP_8_IRQn         =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_SUSP_9_IRQn         =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_SUSP_10_IRQn        =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_SUSP_11_IRQn        =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_SUSP_12_IRQn        =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_SUSP_13_IRQn        =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_SUSP_14_IRQn        =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_SUSP_15_IRQn        =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TCMPL_0_IRQn        =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TCMPL_1_IRQn        =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TCMPL_2_IRQn        =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TCMPL_3_IRQn        =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TCMPL_4_IRQn        =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TCMPL_5_IRQn        =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TCMPL_6_IRQn        =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TCMPL_7_IRQn        =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TCMPL_8_IRQn        =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TCMPL_9_IRQn        =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TCMPL_10_IRQn       =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TCMPL_11_IRQn       =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TCMPL_12_IRQn       =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TCMPL_13_IRQn       =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TCMPL_14_IRQn       =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TCMPL_15_IRQn       =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TERR_0_IRQn         =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TERR_1_IRQn         =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TERR_2_IRQn         =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TERR_3_IRQn         =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TERR_4_IRQn         =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TERR_5_IRQn         =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TERR_6_IRQn         =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TERR_7_IRQn         =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TERR_8_IRQn         =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TERR_9_IRQn         =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TERR_10_IRQn        =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TERR_11_IRQn        =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TERR_12_IRQn        =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TERR_13_IRQn        =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TERR_14_IRQn        =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  DMAC_TERR_15_IRQn        =  5, /**<  5 U3005 Direct Memory Access Controller (DMAC) */
  USB_EORSM_DNRSM_IRQn     =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_EORST_RST_IRQn       =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_LPM_DCONN_IRQn       =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_LPMSUSP_DDISC_IRQn   =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_MSOF_IRQn            =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_RAMACER_IRQn         =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_RXSTP_TXSTP_0_IRQn   =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_RXSTP_TXSTP_1_IRQn   =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_RXSTP_TXSTP_2_IRQn   =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_RXSTP_TXSTP_3_IRQn   =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_RXSTP_TXSTP_4_IRQn   =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_RXSTP_TXSTP_5_IRQn   =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_RXSTP_TXSTP_6_IRQn   =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_RXSTP_TXSTP_7_IRQn   =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_SOF_HSOF_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_STALL0_STALL_0_IRQn  =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_STALL0_STALL_1_IRQn  =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_STALL0_STALL_2_IRQn  =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_STALL0_STALL_3_IRQn  =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_STALL0_STALL_4_IRQn  =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_STALL0_STALL_5_IRQn  =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_STALL0_STALL_6_IRQn  =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_STALL0_STALL_7_IRQn  =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_STALL1_0_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_STALL1_1_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_STALL1_2_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_STALL1_3_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_STALL1_4_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_STALL1_5_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_STALL1_6_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_STALL1_7_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_SUSPEND_IRQn         =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRCPT0_0_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRCPT0_1_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRCPT0_2_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRCPT0_3_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRCPT0_4_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRCPT0_5_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRCPT0_6_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRCPT0_7_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRCPT1_0_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRCPT1_1_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRCPT1_2_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRCPT1_3_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRCPT1_4_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRCPT1_5_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRCPT1_6_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRCPT1_7_IRQn        =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRFAIL0_TRFAIL_0_IRQn =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRFAIL0_TRFAIL_1_IRQn =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRFAIL0_TRFAIL_2_IRQn =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRFAIL0_TRFAIL_3_IRQn =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRFAIL0_TRFAIL_4_IRQn =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRFAIL0_TRFAIL_5_IRQn =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRFAIL0_TRFAIL_6_IRQn =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRFAIL0_TRFAIL_7_IRQn =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRFAIL1_PERR_0_IRQn  =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRFAIL1_PERR_1_IRQn  =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRFAIL1_PERR_2_IRQn  =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRFAIL1_PERR_3_IRQn  =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRFAIL1_PERR_4_IRQn  =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRFAIL1_PERR_5_IRQn  =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRFAIL1_PERR_6_IRQn  =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_TRFAIL1_PERR_7_IRQn  =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_UPRSM_IRQn           =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  USB_WAKEUP_IRQn          =  6, /**<  6 U3005 Universal Serial Bus (USB) */
  EVSYS_EVD_0_IRQn         =  7, /**<  7 U3005 Event System Interface (EVSYS) */
  EVSYS_EVD_1_IRQn         =  7, /**<  7 U3005 Event System Interface (EVSYS) */
  EVSYS_EVD_2_IRQn         =  7, /**<  7 U3005 Event System Interface (EVSYS) */
  EVSYS_EVD_3_IRQn         =  7, /**<  7 U3005 Event System Interface (EVSYS) */
  EVSYS_EVD_4_IRQn         =  7, /**<  7 U3005 Event System Interface (EVSYS) */
  EVSYS_EVD_5_IRQn         =  7, /**<  7 U3005 Event System Interface (EVSYS) */
  EVSYS_EVD_6_IRQn         =  7, /**<  7 U3005 Event System Interface (EVSYS) */
  EVSYS_EVD_7_IRQn         =  7, /**<  7 U3005 Event System Interface (EVSYS) */
  EVSYS_EVD_8_IRQn         =  7, /**<  7 U3005 Event System Interface (EVSYS) */
  EVSYS_EVD_9_IRQn         =  7, /**<  7 U3005 Event System Interface (EVSYS) */
  EVSYS_EVD_10_IRQn        =  7, /**<  7 U3005 Event System Interface (EVSYS) */
  EVSYS_EVD_11_IRQn        =  7, /**<  7 U3005 Event System Interface (EVSYS) */
  EVSYS_OVR_0_IRQn         =  7, /**<  7 U3005 Event System Interface (EVSYS) */
  EVSYS_OVR_1_IRQn         =  7, /**<  7 U3005 Event System Interface (EVSYS) */
  EVSYS_OVR_2_IRQn         =  7, /**<  7 U3005 Event System Interface (EVSYS) */
  EVSYS_OVR_3_IRQn         =  7, /**<  7 U3005 Event System Interface (EVSYS) */
  EVSYS_OVR_4_IRQn         =  7, /**<  7 U3005 Event System Interface (EVSYS) */
  EVSYS_OVR_5_IRQn         =  7, /**<  7 U3005 Event System Interface (EVSYS) */
  EVSYS_OVR_6_IRQn         =  7, /**<  7 U3005 Event System Interface (EVSYS) */
  EVSYS_OVR_7_IRQn         =  7, /**<  7 U3005 Event System Interface (EVSYS) */
  EVSYS_OVR_8_IRQn         =  7, /**<  7 U3005 Event System Interface (EVSYS) */
  EVSYS_OVR_9_IRQn         =  7, /**<  7 U3005 Event System Interface (EVSYS) */
  EVSYS_OVR_10_IRQn        =  7, /**<  7 U3005 Event System Interface (EVSYS) */
  EVSYS_OVR_11_IRQn        =  7, /**<  7 U3005 Event System Interface (EVSYS) */
  SERCOM0_0_IRQn           =  8, /**<  8 U3005 Serial Communication Interface 0 (SERCOM0) */
  SERCOM0_1_IRQn           =  8, /**<  8 U3005 Serial Communication Interface 0 (SERCOM0) */
  SERCOM0_2_IRQn           =  8, /**<  8 U3005 Serial Communication Interface 0 (SERCOM0) */
  SERCOM0_3_IRQn           =  8, /**<  8 U3005 Serial Communication Interface 0 (SERCOM0) */
  SERCOM0_4_IRQn           =  8, /**<  8 U3005 Serial Communication Interface 0 (SERCOM0) */
  SERCOM0_5_IRQn           =  8, /**<  8 U3005 Serial Communication Interface 0 (SERCOM0) */
  SERCOM0_6_IRQn           =  8, /**<  8 U3005 Serial Communication Interface 0 (SERCOM0) */
  SERCOM1_0_IRQn           =  9, /**<  9 U3005 Serial Communication Interface 1 (SERCOM1) */
  SERCOM1_1_IRQn           =  9, /**<  9 U3005 Serial Communication Interface 1 (SERCOM1) */
  SERCOM1_2_IRQn           =  9, /**<  9 U3005 Serial Communication Interface 1 (SERCOM1) */
  SERCOM1_3_IRQn           =  9, /**<  9 U3005 Serial Communication Interface 1 (SERCOM1) */
  SERCOM1_4_IRQn           =  9, /**<  9 U3005 Serial Communication Interface 1 (SERCOM1) */
  SERCOM1_5_IRQn           =  9, /**<  9 U3005 Serial Communication Interface 1 (SERCOM1) */
  SERCOM1_6_IRQn           =  9, /**<  9 U3005 Serial Communication Interface 1 (SERCOM1) */
  SERCOM2_0_IRQn           = 10, /**< 10 U3005 Serial Communication Interface 2 (SERCOM2) */
  SERCOM2_1_IRQn           = 10, /**< 10 U3005 Serial Communication Interface 2 (SERCOM2) */
  SERCOM2_2_IRQn           = 10, /**< 10 U3005 Serial Communication Interface 2 (SERCOM2) */
  SERCOM2_3_IRQn           = 10, /**< 10 U3005 Serial Communication Interface 2 (SERCOM2) */
  SERCOM2_4_IRQn           = 10, /**< 10 U3005 Serial Communication Interface 2 (SERCOM2) */
  SERCOM2_5_IRQn           = 10, /**< 10 U3005 Serial Communication Interface 2 (SERCOM2) */
  SERCOM2_6_IRQn           = 10, /**< 10 U3005 Serial Communication Interface 2 (SERCOM2) */
  SERCOM3_0_IRQn           = 11, /**< 11 U3005 Serial Communication Interface 3 (SERCOM3) */
  SERCOM3_1_IRQn           = 11, /**< 11 U3005 Serial Communication Interface 3 (SERCOM3) */
  SERCOM3_2_IRQn           = 11, /**< 11 U3005 Serial Communication Interface 3 (SERCOM3) */
  SERCOM3_3_IRQn           = 11, /**< 11 U3005 Serial Communication Interface 3 (SERCOM3) */
  SERCOM3_4_IRQn           = 11, /**< 11 U3005 Serial Communication Interface 3 (SERCOM3) */
  SERCOM3_5_IRQn           = 11, /**< 11 U3005 Serial Communication Interface 3 (SERCOM3) */
  SERCOM3_6_IRQn           = 11, /**< 11 U3005 Serial Communication Interface 3 (SERCOM3) */
  SERCOM4_0_IRQn           = 12, /**< 12 U3005 Serial Communication Interface 4 (SERCOM4) */
  SERCOM4_1_IRQn           = 12, /**< 12 U3005 Serial Communication Interface 4 (SERCOM4) */
  SERCOM4_2_IRQn           = 12, /**< 12 U3005 Serial Communication Interface 4 (SERCOM4) */
  SERCOM4_3_IRQn           = 12, /**< 12 U3005 Serial Communication Interface 4 (SERCOM4) */
  SERCOM4_4_IRQn           = 12, /**< 12 U3005 Serial Communication Interface 4 (SERCOM4) */
  SERCOM4_5_IRQn           = 12, /**< 12 U3005 Serial Communication Interface 4 (SERCOM4) */
  SERCOM4_6_IRQn           = 12, /**< 12 U3005 Serial Communication Interface 4 (SERCOM4) */
  SERCOM5_0_IRQn           = 13, /**< 13 U3005 Serial Communication Interface 5 (SERCOM5) */
  SERCOM5_1_IRQn           = 13, /**< 13 U3005 Serial Communication Interface 5 (SERCOM5) */
  SERCOM5_2_IRQn           = 13, /**< 13 U3005 Serial Communication Interface 5 (SERCOM5) */
  SERCOM5_3_IRQn           = 13, /**< 13 U3005 Serial Communication Interface 5 (SERCOM5) */
  TCC0_CNT_IRQn            = 14, /**< 14 U3005 Timer Counter Control 0 (TCC0) */
  TCC0_DFS_IRQn            = 14, /**< 14 U3005 Timer Counter Control 0 (TCC0) */
