zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
  TCC0_ERR_IRQn            = 14, /**< 14 U3005 Timer Counter Control 0 (TCC0) */
  TCC0_FAULTA_IRQn         = 14, /**< 14 U3005 Timer Counter Control 0 (TCC0) */
  TCC0_FAULTB_IRQn         = 14, /**< 14 U3005 Timer Counter Control 0 (TCC0) */
  TCC0_FAULT0_IRQn         = 14, /**< 14 U3005 Timer Counter Control 0 (TCC0) */
  TCC0_FAULT1_IRQn         = 14, /**< 14 U3005 Timer Counter Control 0 (TCC0) */
  TCC0_MC_0_IRQn           = 14, /**< 14 U3005 Timer Counter Control 0 (TCC0) */
  TCC0_MC_1_IRQn           = 14, /**< 14 U3005 Timer Counter Control 0 (TCC0) */
  TCC0_MC_2_IRQn           = 14, /**< 14 U3005 Timer Counter Control 0 (TCC0) */
  TCC0_MC_3_IRQn           = 14, /**< 14 U3005 Timer Counter Control 0 (TCC0) */
  TCC0_OVF_IRQn            = 14, /**< 14 U3005 Timer Counter Control 0 (TCC0) */
  TCC0_TRG_IRQn            = 14, /**< 14 U3005 Timer Counter Control 0 (TCC0) */
  TCC0_UFS_IRQn            = 14, /**< 14 U3005 Timer Counter Control 0 (TCC0) */
  TCC1_CNT_IRQn            = 15, /**< 15 U3005 Timer Counter Control 1 (TCC1) */
  TCC1_DFS_IRQn            = 15, /**< 15 U3005 Timer Counter Control 1 (TCC1) */
  TCC1_ERR_IRQn            = 15, /**< 15 U3005 Timer Counter Control 1 (TCC1) */
  TCC1_FAULTA_IRQn         = 15, /**< 15 U3005 Timer Counter Control 1 (TCC1) */
  TCC1_FAULTB_IRQn         = 15, /**< 15 U3005 Timer Counter Control 1 (TCC1) */
  TCC1_FAULT0_IRQn         = 15, /**< 15 U3005 Timer Counter Control 1 (TCC1) */
  TCC1_FAULT1_IRQn         = 15, /**< 15 U3005 Timer Counter Control 1 (TCC1) */
  TCC1_MC_0_IRQn           = 15, /**< 15 U3005 Timer Counter Control 1 (TCC1) */
  TCC1_MC_1_IRQn           = 15, /**< 15 U3005 Timer Counter Control 1 (TCC1) */
  TCC1_OVF_IRQn            = 15, /**< 15 U3005 Timer Counter Control 1 (TCC1) */
  TCC1_TRG_IRQn            = 15, /**< 15 U3005 Timer Counter Control 1 (TCC1) */
  TCC1_UFS_IRQn            = 15, /**< 15 U3005 Timer Counter Control 1 (TCC1) */
  TCC2_CNT_IRQn            = 16, /**< 16 U3005 Timer Counter Control 2 (TCC2) */
  TCC2_DFS_IRQn            = 16, /**< 16 U3005 Timer Counter Control 2 (TCC2) */
  TCC2_ERR_IRQn            = 16, /**< 16 U3005 Timer Counter Control 2 (TCC2) */
  TCC2_FAULTA_IRQn         = 16, /**< 16 U3005 Timer Counter Control 2 (TCC2) */
  TCC2_FAULTB_IRQn         = 16, /**< 16 U3005 Timer Counter Control 2 (TCC2) */
  TCC2_FAULT0_IRQn         = 16, /**< 16 U3005 Timer Counter Control 2 (TCC2) */
  TCC2_FAULT1_IRQn         = 16, /**< 16 U3005 Timer Counter Control 2 (TCC2) */
  TCC2_MC_0_IRQn           = 16, /**< 16 U3005 Timer Counter Control 2 (TCC2) */
  TCC2_MC_1_IRQn           = 16, /**< 16 U3005 Timer Counter Control 2 (TCC2) */
  TCC2_OVF_IRQn            = 16, /**< 16 U3005 Timer Counter Control 2 (TCC2) */
  TCC2_TRG_IRQn            = 16, /**< 16 U3005 Timer Counter Control 2 (TCC2) */
  TCC2_UFS_IRQn            = 16, /**< 16 U3005 Timer Counter Control 2 (TCC2) */
  TC0_ERR_IRQn             = 17, /**< 17 U3005 Basic Timer Counter 0 (TC0) */
  TC0_MC_0_IRQn            = 17, /**< 17 U3005 Basic Timer Counter 0 (TC0) */
  TC0_MC_1_IRQn            = 17, /**< 17 U3005 Basic Timer Counter 0 (TC0) */
  TC0_OVF_IRQn             = 17, /**< 17 U3005 Basic Timer Counter 0 (TC0) */
  TC1_ERR_IRQn             = 18, /**< 18 U3005 Basic Timer Counter 1 (TC1) */
  TC1_MC_0_IRQn            = 18, /**< 18 U3005 Basic Timer Counter 1 (TC1) */
  TC1_MC_1_IRQn            = 18, /**< 18 U3005 Basic Timer Counter 1 (TC1) */
  TC1_OVF_IRQn             = 18, /**< 18 U3005 Basic Timer Counter 1 (TC1) */
  TC2_ERR_IRQn             = 19, /**< 19 U3005 Basic Timer Counter 2 (TC2) */
  TC2_MC_0_IRQn            = 19, /**< 19 U3005 Basic Timer Counter 2 (TC2) */
  TC2_MC_1_IRQn            = 19, /**< 19 U3005 Basic Timer Counter 2 (TC2) */
  TC2_OVF_IRQn             = 19, /**< 19 U3005 Basic Timer Counter 2 (TC2) */
  TC3_ERR_IRQn             = 20, /**< 20 U3005 Basic Timer Counter 3 (TC3) */
  TC3_MC_0_IRQn            = 20, /**< 20 U3005 Basic Timer Counter 3 (TC3) */
  TC3_MC_1_IRQn            = 20, /**< 20 U3005 Basic Timer Counter 3 (TC3) */
  TC3_OVF_IRQn             = 20, /**< 20 U3005 Basic Timer Counter 3 (TC3) */
  TC4_ERR_IRQn             = 21, /**< 21 U3005 Basic Timer Counter 4 (TC4) */
  TC4_MC_0_IRQn            = 21, /**< 21 U3005 Basic Timer Counter 4 (TC4) */
  TC4_MC_1_IRQn            = 21, /**< 21 U3005 Basic Timer Counter 4 (TC4) */
  TC4_OVF_IRQn             = 21, /**< 21 U3005 Basic Timer Counter 4 (TC4) */
  ADC_OVERRUN_IRQn         = 22, /**< 22 U3005 Analog Digital Converter (ADC) */
  ADC_RESRDY_IRQn          = 22, /**< 22 U3005 Analog Digital Converter (ADC) */
  ADC_WINMON_IRQn          = 22, /**< 22 U3005 Analog Digital Converter (ADC) */
  AC_COMP_0_IRQn           = 23, /**< 23 U3005 Analog Comparators (AC) */
  AC_COMP_1_IRQn           = 23, /**< 23 U3005 Analog Comparators (AC) */
  AC_WIN_0_IRQn            = 23, /**< 23 U3005 Analog Comparators (AC) */
  DAC_EMPTY_0_IRQn         = 24, /**< 24 U3005 Digital-to-Analog Converter (DAC) */
  DAC_EMPTY_1_IRQn         = 24, /**< 24 U3005 Digital-to-Analog Converter (DAC) */
  DAC_UNDERRUN_0_IRQn      = 24, /**< 24 U3005 Digital-to-Analog Converter (DAC) */
  DAC_UNDERRUN_1_IRQn      = 24, /**< 24 U3005 Digital-to-Analog Converter (DAC) */
  PTC_EOC_IRQn             = 25, /**< 25 U3005 Peripheral Touch Controller (PTC) */
  PTC_WCOMP_IRQn           = 25, /**< 25 U3005 Peripheral Touch Controller (PTC) */
  AES_ENCCMP_IRQn          = 26, /**< 26 U3005 Advanced Encryption Standard (AES) */
  AES_GFMCMP_IRQn          = 26, /**< 26 U3005 Advanced Encryption Standard (AES) */
  TRNG_IS0_IRQn            = 27, /**< 27 U3005 True Random Generator (TRNG) */
  PICOP_IRQn               = 28, /**< 28 U3005 PicoProcessor (PICOP) */

  PERIPH_COUNT_IRQn        = 29  /**< Number of peripheral IDs */
} IRQn_Type;

///
typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;

  /* Cortex-M handlers */
  void* pfnReset_Handler;
  void* pfnNMI_Handler;
  void* pfnHardFault_Handler;
  void* pfnReservedM12;
  void* pfnReservedM11;
  void* pfnReservedM10;
  void* pfnReservedM9;
  void* pfnReservedM8;
  void* pfnReservedM7;
  void* pfnReservedM6;
  void* pfnSVC_Handler;
  void* pfnReservedM4;
  void* pfnReservedM3;
  void* pfnPendSV_Handler;
  void* pfnSysTick_Handler;

  /* Peripheral handlers */
  void* pfnSYSTEM_Handler;                /*  0 Main Clock, Oscillators Control, 32k Oscillators Control, Peripheral Access Controller, Power Manager, Supply Controller, Trigger Allocator */
  void* pfnWDT_Handler;                   /*  1 Watchdog Timer */
  void* pfnRTC_Handler;                   /*  2 Real-Time Counter */
  void* pfnEIC_Handler;                   /*  3 External Interrupt Controller */
  void* pfnNVMCTRL_Handler;               /*  4 Non-Volatile Memory Controller */
  void* pfnDMAC_Handler;                  /*  5 Direct Memory Access Controller */
  void* pfnUSB_Handler;                   /*  6 Universal Serial Bus */
  void* pfnEVSYS_Handler;                 /*  7 Event System Interface */
  void* pfnSERCOM0_Handler;               /*  8 Serial Communication Interface 0 */
  void* pfnSERCOM1_Handler;               /*  9 Serial Communication Interface 1 */
  void* pfnSERCOM2_Handler;               /* 10 Serial Communication Interface 2 */
  void* pfnSERCOM3_Handler;               /* 11 Serial Communication Interface 3 */
  void* pfnSERCOM4_Handler;               /* 12 Serial Communication Interface 4 */
  void* pfnSERCOM5_Handler;               /* 13 Serial Communication Interface 5 */
  void* pfnTCC0_Handler;                  /* 14 Timer Counter Control 0 */
  void* pfnTCC1_Handler;                  /* 15 Timer Counter Control 1 */
  void* pfnTCC2_Handler;                  /* 16 Timer Counter Control 2 */
  void* pfnTC0_Handler;                   /* 17 Basic Timer Counter 0 */
  void* pfnTC1_Handler;                   /* 18 Basic Timer Counter 1 */
  void* pfnTC2_Handler;                   /* 19 Basic Timer Counter 2 */
  void* pfnTC3_Handler;                   /* 20 Basic Timer Counter 3 */
  void* pfnTC4_Handler;                   /* 21 Basic Timer Counter 4 */
  void* pfnADC_Handler;                   /* 22 Analog Digital Converter */
  void* pfnAC_Handler;                    /* 23 Analog Comparators */
  void* pfnDAC_Handler;                   /* 24 Digital-to-Analog Converter */
  void* pfnPTC_Handler;                   /* 25 Peripheral Touch Controller */
  void* pfnAES_Handler;                   /* 26 Advanced Encryption Standard */
  void* pfnTRNG_Handler;                  /* 27 True Random Generator */
  void* pfnPICOP_Handler;                 /* 28 PicoProcessor */
} DeviceVectors;

/* Cortex-M0+ processor handlers */
void Reset_Handler               ( void );
void NMI_Handler                 ( void );
void HardFault_Handler           ( void );
void SVC_Handler                 ( void );
void PendSV_Handler              ( void );
void SysTick_Handler             ( void );

/* Peripherals handlers */
void SYSTEM_Handler              ( void );
void WDT_Handler                 ( void );
void RTC_Handler                 ( void );
void EIC_Handler                 ( void );
void NVMCTRL_Handler             ( void );
void DMAC_Handler                ( void );
void USB_Handler                 ( void );
void EVSYS_Handler               ( void );
void SERCOM0_Handler             ( void );
void SERCOM1_Handler             ( void );
void SERCOM2_Handler             ( void );
void SERCOM3_Handler             ( void );
void SERCOM4_Handler             ( void );
void SERCOM5_Handler             ( void );
void TCC0_Handler                ( void );
void TCC1_Handler                ( void );
void TCC2_Handler                ( void );
void TC0_Handler                 ( void );
void TC1_Handler                 ( void );
void TC2_Handler                 ( void );
void TC3_Handler                 ( void );
void TC4_Handler                 ( void );
void ADC_Handler                 ( void );
void AC_Handler                  ( void );
void DAC_Handler                 ( void );
void PTC_Handler                 ( void );
void AES_Handler                 ( void );
void TRNG_Handler                ( void );
void PICOP_Handler               ( void );
///

