zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
/* -------- AC_SYNCBUSY : (AC Offset: 0x20) (R/  32) Synchronization Busy -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t SWRST:1;          /*!< bit:      0  Software Reset Synchronization Busy */
    uint32_t ENABLE:1;         /*!< bit:      1  Enable Synchronization Busy        */
    uint32_t WINCTRL:1;        /*!< bit:      2  WINCTRL Synchronization Busy       */
    uint32_t COMPCTRL0:1;      /*!< bit:      3  COMPCTRL 0 Synchronization Busy    */
    uint32_t COMPCTRL1:1;      /*!< bit:      4  COMPCTRL 1 Synchronization Busy    */
    uint32_t :27;              /*!< bit:  5..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  struct {
    uint32_t :3;               /*!< bit:  0.. 2  Reserved                           */
    uint32_t COMPCTRL:2;       /*!< bit:  3.. 4  COMPCTRL x Synchronization Busy    */
    uint32_t :27;              /*!< bit:  5..31  Reserved                           */
  } vec;                       /*!< Structure used for vec  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} AC_SYNCBUSY_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AC_SYNCBUSY_OFFSET          0x20         /**< \brief (AC_SYNCBUSY offset) Synchronization Busy */
#define AC_SYNCBUSY_RESETVALUE      0x00000000   /**< \brief (AC_SYNCBUSY reset_value) Synchronization Busy */

#define AC_SYNCBUSY_SWRST_Pos       0            /**< \brief (AC_SYNCBUSY) Software Reset Synchronization Busy */
#define AC_SYNCBUSY_SWRST           (0x1u << AC_SYNCBUSY_SWRST_Pos)
#define AC_SYNCBUSY_ENABLE_Pos      1            /**< \brief (AC_SYNCBUSY) Enable Synchronization Busy */
#define AC_SYNCBUSY_ENABLE          (0x1u << AC_SYNCBUSY_ENABLE_Pos)
#define AC_SYNCBUSY_WINCTRL_Pos     2            /**< \brief (AC_SYNCBUSY) WINCTRL Synchronization Busy */
#define AC_SYNCBUSY_WINCTRL         (0x1u << AC_SYNCBUSY_WINCTRL_Pos)
#define AC_SYNCBUSY_COMPCTRL0_Pos   3            /**< \brief (AC_SYNCBUSY) COMPCTRL 0 Synchronization Busy */
#define AC_SYNCBUSY_COMPCTRL0       (1 << AC_SYNCBUSY_COMPCTRL0_Pos)
#define AC_SYNCBUSY_COMPCTRL1_Pos   4            /**< \brief (AC_SYNCBUSY) COMPCTRL 1 Synchronization Busy */
#define AC_SYNCBUSY_COMPCTRL1       (1 << AC_SYNCBUSY_COMPCTRL1_Pos)
#define AC_SYNCBUSY_COMPCTRL_Pos    3            /**< \brief (AC_SYNCBUSY) COMPCTRL x Synchronization Busy */
#define AC_SYNCBUSY_COMPCTRL_Msk    (0x3u << AC_SYNCBUSY_COMPCTRL_Pos)
#define AC_SYNCBUSY_COMPCTRL(value) ((AC_SYNCBUSY_COMPCTRL_Msk & ((value) << AC_SYNCBUSY_COMPCTRL_Pos)))
#define AC_SYNCBUSY_MASK            0x0000001Fu  /**< \brief (AC_SYNCBUSY) Register Bits Mask */

/* -------- AC_TEST : (AC Offset: 0x24) (R/W 16) Test -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t TBUS:3;           /*!< bit:  0.. 2  Test Bus Selection                 */
    uint16_t TMUX:3;           /*!< bit:  3.. 5  Test Mux Selection                 */
    uint16_t TEN:1;            /*!< bit:      6  Test Input Enable                  */
    uint16_t TPAIR:1;          /*!< bit:      7  Test Pair Selection                */
    uint16_t TSEL:2;           /*!< bit:  8.. 9  Test Selection                     */
    uint16_t TOUT:1;           /*!< bit:     10  Test Output Enable                 */
    uint16_t :5;               /*!< bit: 11..15  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} AC_TEST_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AC_TEST_OFFSET              0x24         /**< \brief (AC_TEST offset) Test */
#define AC_TEST_RESETVALUE          0x0000       /**< \brief (AC_TEST reset_value) Test */

#define AC_TEST_TBUS_Pos            0            /**< \brief (AC_TEST) Test Bus Selection */
#define AC_TEST_TBUS_Msk            (0x7u << AC_TEST_TBUS_Pos)
#define AC_TEST_TBUS(value)         ((AC_TEST_TBUS_Msk & ((value) << AC_TEST_TBUS_Pos)))
#define   AC_TEST_TBUS_NOTEST_Val         0x0u   /**< \brief (AC_TEST)  */
#define   AC_TEST_TBUS_COMP0P_Val         0x4u   /**< \brief (AC_TEST)  */
#define   AC_TEST_TBUS_COMP0N_Val         0x5u   /**< \brief (AC_TEST)  */
#define   AC_TEST_TBUS_COMP1P_Val         0x6u   /**< \brief (AC_TEST)  */
#define   AC_TEST_TBUS_COMP1N_Val         0x7u   /**< \brief (AC_TEST)  */
#define AC_TEST_TBUS_NOTEST         (AC_TEST_TBUS_NOTEST_Val       << AC_TEST_TBUS_Pos)
#define AC_TEST_TBUS_COMP0P         (AC_TEST_TBUS_COMP0P_Val       << AC_TEST_TBUS_Pos)
#define AC_TEST_TBUS_COMP0N         (AC_TEST_TBUS_COMP0N_Val       << AC_TEST_TBUS_Pos)
#define AC_TEST_TBUS_COMP1P         (AC_TEST_TBUS_COMP1P_Val       << AC_TEST_TBUS_Pos)
#define AC_TEST_TBUS_COMP1N         (AC_TEST_TBUS_COMP1N_Val       << AC_TEST_TBUS_Pos)
#define AC_TEST_TMUX_Pos            3            /**< \brief (AC_TEST) Test Mux Selection */
#define AC_TEST_TMUX_Msk            (0x7u << AC_TEST_TMUX_Pos)
#define AC_TEST_TMUX(value)         ((AC_TEST_TMUX_Msk & ((value) << AC_TEST_TMUX_Pos)))
#define   AC_TEST_TMUX_NOTEST_Val         0x0u   /**< \brief (AC_TEST)  */
#define   AC_TEST_TMUX_COMP0N_Val         0x4u   /**< \brief (AC_TEST)  */
#define   AC_TEST_TMUX_COMP0P_Val         0x5u   /**< \brief (AC_TEST)  */
#define   AC_TEST_TMUX_COMP1N_Val         0x6u   /**< \brief (AC_TEST)  */
#define   AC_TEST_TMUX_COMP1P_Val         0x7u   /**< \brief (AC_TEST)  */
#define AC_TEST_TMUX_NOTEST         (AC_TEST_TMUX_NOTEST_Val       << AC_TEST_TMUX_Pos)
#define AC_TEST_TMUX_COMP0N         (AC_TEST_TMUX_COMP0N_Val       << AC_TEST_TMUX_Pos)
#define AC_TEST_TMUX_COMP0P         (AC_TEST_TMUX_COMP0P_Val       << AC_TEST_TMUX_Pos)
#define AC_TEST_TMUX_COMP1N         (AC_TEST_TMUX_COMP1N_Val       << AC_TEST_TMUX_Pos)
#define AC_TEST_TMUX_COMP1P         (AC_TEST_TMUX_COMP1P_Val       << AC_TEST_TMUX_Pos)
#define AC_TEST_TEN_Pos             6            /**< \brief (AC_TEST) Test Input Enable */
#define AC_TEST_TEN                 (0x1u << AC_TEST_TEN_Pos)
#define AC_TEST_TPAIR_Pos           7            /**< \brief (AC_TEST) Test Pair Selection */
#define AC_TEST_TPAIR               (0x1u << AC_TEST_TPAIR_Pos)
#define AC_TEST_TSEL_Pos            8            /**< \brief (AC_TEST) Test Selection */
#define AC_TEST_TSEL_Msk            (0x3u << AC_TEST_TSEL_Pos)
#define AC_TEST_TSEL(value)         ((AC_TEST_TSEL_Msk & ((value) << AC_TEST_TSEL_Pos)))
#define   AC_TEST_TSEL_COMP0_Val          0x0u   /**< \brief (AC_TEST)  */
#define   AC_TEST_TSEL_COMP1_Val          0x1u   /**< \brief (AC_TEST)  */
#define   AC_TEST_TSEL_COMP2_Val          0x2u   /**< \brief (AC_TEST)  */
#define   AC_TEST_TSEL_COMP3_Val          0x3u   /**< \brief (AC_TEST)  */
#define AC_TEST_TSEL_COMP0          (AC_TEST_TSEL_COMP0_Val        << AC_TEST_TSEL_Pos)
#define AC_TEST_TSEL_COMP1          (AC_TEST_TSEL_COMP1_Val        << AC_TEST_TSEL_Pos)
#define AC_TEST_TSEL_COMP2          (AC_TEST_TSEL_COMP2_Val        << AC_TEST_TSEL_Pos)
#define AC_TEST_TSEL_COMP3          (AC_TEST_TSEL_COMP3_Val        << AC_TEST_TSEL_Pos)
#define AC_TEST_TOUT_Pos            10           /**< \brief (AC_TEST) Test Output Enable */
#define AC_TEST_TOUT                (0x1u << AC_TEST_TOUT_Pos)
#define AC_TEST_MASK                0x07FFu      /**< \brief (AC_TEST) Register Bits Mask */

/** \brief AC hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  __IO AC_CTRLA_Type             CTRLA;       /**< \brief Offset: 0x00 (R/W  8) Control A */
  __O  AC_CTRLB_Type             CTRLB;       /**< \brief Offset: 0x01 ( /W  8) Control B */
  __IO AC_EVCTRL_Type            EVCTRL;      /**< \brief Offset: 0x02 (R/W 16) Event Control */
  __IO AC_INTENCLR_Type          INTENCLR;    /**< \brief Offset: 0x04 (R/W  8) Interrupt Enable Clear */
  __IO AC_INTENSET_Type          INTENSET;    /**< \brief Offset: 0x05 (R/W  8) Interrupt Enable Set */
  __IO AC_INTFLAG_Type           INTFLAG;     /**< \brief Offset: 0x06 (R/W  8) Interrupt Flag Status and Clear */
  __I  AC_STATUSA_Type           STATUSA;     /**< \brief Offset: 0x07 (R/   8) Status A */
  __I  AC_STATUSB_Type           STATUSB;     /**< \brief Offset: 0x08 (R/   8) Status B */
  __IO AC_DBGCTRL_Type           DBGCTRL;     /**< \brief Offset: 0x09 (R/W  8) Debug Control */
  __IO AC_WINCTRL_Type           WINCTRL;     /**< \brief Offset: 0x0A (R/W  8) Window Control */
       RoReg8                    Reserved1[0x1];
  __IO AC_SCALER_Type            SCALER[2];   /**< \brief Offset: 0x0C (R/W  8) Scaler n */
       RoReg8                    Reserved2[0x2];
  __IO AC_COMPCTRL_Type          COMPCTRL[2]; /**< \brief Offset: 0x10 (R/W 32) Comparator Control n */
       RoReg8                    Reserved3[0x8];
  __I  AC_SYNCBUSY_Type          SYNCBUSY;    /**< \brief Offset: 0x20 (R/  32) Synchronization Busy */
  __IO AC_TEST_Type              TEST;        /**< \brief Offset: 0x24 (R/W 16) Test */
} Ac;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR ADC */
/* ========================================================================== */
/** \addtogroup U3005_ADC Analog Digital Converter */
/*@{*/

