zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define AES_DATABUFPTR_OFFSET       0x08         /**< \brief (AES_DATABUFPTR offset) Data buffer pointer */
#define AES_DATABUFPTR_RESETVALUE   0x00         /**< \brief (AES_DATABUFPTR reset_value) Data buffer pointer */

#define AES_DATABUFPTR_INDATAPTR_Pos 0            /**< \brief (AES_DATABUFPTR) Input Data Pointer */
#define AES_DATABUFPTR_INDATAPTR_Msk (0x3u << AES_DATABUFPTR_INDATAPTR_Pos)
#define AES_DATABUFPTR_INDATAPTR(value) ((AES_DATABUFPTR_INDATAPTR_Msk & ((value) << AES_DATABUFPTR_INDATAPTR_Pos)))
#define AES_DATABUFPTR_MASK         0x03u        /**< \brief (AES_DATABUFPTR) Register Bits Mask */

/* -------- AES_DBGCTRL : (AES Offset: 0x09) ( /W  8) Debug control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  DBGRUN:1;         /*!< bit:      0  Debug Run                          */
    uint8_t  :7;               /*!< bit:  1.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} AES_DBGCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AES_DBGCTRL_OFFSET          0x09         /**< \brief (AES_DBGCTRL offset) Debug control */
#define AES_DBGCTRL_RESETVALUE      0x00         /**< \brief (AES_DBGCTRL reset_value) Debug control */

#define AES_DBGCTRL_DBGRUN_Pos      0            /**< \brief (AES_DBGCTRL) Debug Run */
#define AES_DBGCTRL_DBGRUN          (0x1u << AES_DBGCTRL_DBGRUN_Pos)
#define AES_DBGCTRL_MASK            0x01u        /**< \brief (AES_DBGCTRL) Register Bits Mask */

/* -------- AES_KEYWORD0 : (AES Offset: 0x0C) ( /W 32) Keyword 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} AES_KEYWORD0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AES_KEYWORD0_OFFSET         0x0C         /**< \brief (AES_KEYWORD0 offset) Keyword 0 */
#define AES_KEYWORD0_RESETVALUE     0x00000000   /**< \brief (AES_KEYWORD0 reset_value) Keyword 0 */
#define AES_KEYWORD0_MASK           0xFFFFFFFFu  /**< \brief (AES_KEYWORD0) Register Bits Mask */

/* -------- AES_KEYWORD1 : (AES Offset: 0x10) ( /W 32) Keyword 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} AES_KEYWORD1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AES_KEYWORD1_OFFSET         0x10         /**< \brief (AES_KEYWORD1 offset) Keyword 1 */
#define AES_KEYWORD1_RESETVALUE     0x00000000   /**< \brief (AES_KEYWORD1 reset_value) Keyword 1 */
#define AES_KEYWORD1_MASK           0xFFFFFFFFu  /**< \brief (AES_KEYWORD1) Register Bits Mask */

/* -------- AES_KEYWORD2 : (AES Offset: 0x14) ( /W 32) Keyword 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} AES_KEYWORD2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AES_KEYWORD2_OFFSET         0x14         /**< \brief (AES_KEYWORD2 offset) Keyword 2 */
#define AES_KEYWORD2_RESETVALUE     0x00000000   /**< \brief (AES_KEYWORD2 reset_value) Keyword 2 */
#define AES_KEYWORD2_MASK           0xFFFFFFFFu  /**< \brief (AES_KEYWORD2) Register Bits Mask */

/* -------- AES_KEYWORD3 : (AES Offset: 0x18) ( /W 32) Keyword 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} AES_KEYWORD3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AES_KEYWORD3_OFFSET         0x18         /**< \brief (AES_KEYWORD3 offset) Keyword 3 */
#define AES_KEYWORD3_RESETVALUE     0x00000000   /**< \brief (AES_KEYWORD3 reset_value) Keyword 3 */
#define AES_KEYWORD3_MASK           0xFFFFFFFFu  /**< \brief (AES_KEYWORD3) Register Bits Mask */

/* -------- AES_KEYWORD4 : (AES Offset: 0x1C) ( /W 32) Keyword 4 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} AES_KEYWORD4_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AES_KEYWORD4_OFFSET         0x1C         /**< \brief (AES_KEYWORD4 offset) Keyword 4 */
#define AES_KEYWORD4_RESETVALUE     0x00000000   /**< \brief (AES_KEYWORD4 reset_value) Keyword 4 */
#define AES_KEYWORD4_MASK           0xFFFFFFFFu  /**< \brief (AES_KEYWORD4) Register Bits Mask */

/* -------- AES_KEYWORD5 : (AES Offset: 0x20) ( /W 32) Keyword 5 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} AES_KEYWORD5_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AES_KEYWORD5_OFFSET         0x20         /**< \brief (AES_KEYWORD5 offset) Keyword 5 */
#define AES_KEYWORD5_RESETVALUE     0x00000000   /**< \brief (AES_KEYWORD5 reset_value) Keyword 5 */
#define AES_KEYWORD5_MASK           0xFFFFFFFFu  /**< \brief (AES_KEYWORD5) Register Bits Mask */

/* -------- AES_KEYWORD6 : (AES Offset: 0x24) ( /W 32) Keyword 6 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} AES_KEYWORD6_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AES_KEYWORD6_OFFSET         0x24         /**< \brief (AES_KEYWORD6 offset) Keyword 6 */
#define AES_KEYWORD6_RESETVALUE     0x00000000   /**< \brief (AES_KEYWORD6 reset_value) Keyword 6 */
#define AES_KEYWORD6_MASK           0xFFFFFFFFu  /**< \brief (AES_KEYWORD6) Register Bits Mask */

/* -------- AES_KEYWORD7 : (AES Offset: 0x28) ( /W 32) Keyword 7 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} AES_KEYWORD7_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AES_KEYWORD7_OFFSET         0x28         /**< \brief (AES_KEYWORD7 offset) Keyword 7 */
#define AES_KEYWORD7_RESETVALUE     0x00000000   /**< \brief (AES_KEYWORD7 reset_value) Keyword 7 */
#define AES_KEYWORD7_MASK           0xFFFFFFFFu  /**< \brief (AES_KEYWORD7) Register Bits Mask */

/* -------- AES_INDATA : (AES Offset: 0x38) (R/W 32) Indata -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} AES_INDATA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AES_INDATA_OFFSET           0x38         /**< \brief (AES_INDATA offset) Indata */
#define AES_INDATA_RESETVALUE       0x00000000   /**< \brief (AES_INDATA reset_value) Indata */
#define AES_INDATA_MASK             0xFFFFFFFFu  /**< \brief (AES_INDATA) Register Bits Mask */

/* -------- AES_INTVECTV0 : (AES Offset: 0x3C) ( /W 32) Initialisation Vector 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} AES_INTVECTV0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

