zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define AES_INTVECTV0_OFFSET        0x3C         /**< \brief (AES_INTVECTV0 offset) Initialisation Vector 0 */
#define AES_INTVECTV0_RESETVALUE    0x00000000   /**< \brief (AES_INTVECTV0 reset_value) Initialisation Vector 0 */
#define AES_INTVECTV0_MASK          0xFFFFFFFFu  /**< \brief (AES_INTVECTV0) Register Bits Mask */

/* -------- AES_INTVECTV1 : (AES Offset: 0x40) ( /W 32) Initialisation Vector 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} AES_INTVECTV1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AES_INTVECTV1_OFFSET        0x40         /**< \brief (AES_INTVECTV1 offset) Initialisation Vector 1 */
#define AES_INTVECTV1_RESETVALUE    0x00000000   /**< \brief (AES_INTVECTV1 reset_value) Initialisation Vector 1 */
#define AES_INTVECTV1_MASK          0xFFFFFFFFu  /**< \brief (AES_INTVECTV1) Register Bits Mask */

/* -------- AES_INTVECTV2 : (AES Offset: 0x44) ( /W 32) Initialisation Vector 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} AES_INTVECTV2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AES_INTVECTV2_OFFSET        0x44         /**< \brief (AES_INTVECTV2 offset) Initialisation Vector 2 */
#define AES_INTVECTV2_RESETVALUE    0x00000000   /**< \brief (AES_INTVECTV2 reset_value) Initialisation Vector 2 */
#define AES_INTVECTV2_MASK          0xFFFFFFFFu  /**< \brief (AES_INTVECTV2) Register Bits Mask */

/* -------- AES_INTVECTV3 : (AES Offset: 0x48) ( /W 32) Initialisation Vector 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} AES_INTVECTV3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AES_INTVECTV3_OFFSET        0x48         /**< \brief (AES_INTVECTV3 offset) Initialisation Vector 3 */
#define AES_INTVECTV3_RESETVALUE    0x00000000   /**< \brief (AES_INTVECTV3 reset_value) Initialisation Vector 3 */
#define AES_INTVECTV3_MASK          0xFFFFFFFFu  /**< \brief (AES_INTVECTV3) Register Bits Mask */

/* -------- AES_HASHKEY0 : (AES Offset: 0x5C) (R/W 32) Hash key 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} AES_HASHKEY0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AES_HASHKEY0_OFFSET         0x5C         /**< \brief (AES_HASHKEY0 offset) Hash key 0 */
#define AES_HASHKEY0_RESETVALUE     0x00000000   /**< \brief (AES_HASHKEY0 reset_value) Hash key 0 */
#define AES_HASHKEY0_MASK           0xFFFFFFFFu  /**< \brief (AES_HASHKEY0) Register Bits Mask */

/* -------- AES_HASHKEY1 : (AES Offset: 0x60) (R/W 32) Hash key 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} AES_HASHKEY1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AES_HASHKEY1_OFFSET         0x60         /**< \brief (AES_HASHKEY1 offset) Hash key 1 */
#define AES_HASHKEY1_RESETVALUE     0x00000000   /**< \brief (AES_HASHKEY1 reset_value) Hash key 1 */
#define AES_HASHKEY1_MASK           0xFFFFFFFFu  /**< \brief (AES_HASHKEY1) Register Bits Mask */

/* -------- AES_HASHKEY2 : (AES Offset: 0x64) (R/W 32) Hash key 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} AES_HASHKEY2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AES_HASHKEY2_OFFSET         0x64         /**< \brief (AES_HASHKEY2 offset) Hash key 2 */
#define AES_HASHKEY2_RESETVALUE     0x00000000   /**< \brief (AES_HASHKEY2 reset_value) Hash key 2 */
#define AES_HASHKEY2_MASK           0xFFFFFFFFu  /**< \brief (AES_HASHKEY2) Register Bits Mask */

/* -------- AES_HASHKEY3 : (AES Offset: 0x68) (R/W 32) Hash key 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} AES_HASHKEY3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AES_HASHKEY3_OFFSET         0x68         /**< \brief (AES_HASHKEY3 offset) Hash key 3 */
#define AES_HASHKEY3_RESETVALUE     0x00000000   /**< \brief (AES_HASHKEY3 reset_value) Hash key 3 */
#define AES_HASHKEY3_MASK           0xFFFFFFFFu  /**< \brief (AES_HASHKEY3) Register Bits Mask */

/* -------- AES_GHASH0 : (AES Offset: 0x6C) (R/W 32) Galois Hash 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} AES_GHASH0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AES_GHASH0_OFFSET           0x6C         /**< \brief (AES_GHASH0 offset) Galois Hash 0 */
#define AES_GHASH0_RESETVALUE       0x00000000   /**< \brief (AES_GHASH0 reset_value) Galois Hash 0 */
#define AES_GHASH0_MASK             0xFFFFFFFFu  /**< \brief (AES_GHASH0) Register Bits Mask */

/* -------- AES_GHASH1 : (AES Offset: 0x70) (R/W 32) Galois Hash 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} AES_GHASH1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AES_GHASH1_OFFSET           0x70         /**< \brief (AES_GHASH1 offset) Galois Hash 1 */
#define AES_GHASH1_RESETVALUE       0x00000000   /**< \brief (AES_GHASH1 reset_value) Galois Hash 1 */
#define AES_GHASH1_MASK             0xFFFFFFFFu  /**< \brief (AES_GHASH1) Register Bits Mask */

/* -------- AES_GHASH2 : (AES Offset: 0x74) (R/W 32) Galois Hash 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} AES_GHASH2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AES_GHASH2_OFFSET           0x74         /**< \brief (AES_GHASH2 offset) Galois Hash 2 */
#define AES_GHASH2_RESETVALUE       0x00000000   /**< \brief (AES_GHASH2 reset_value) Galois Hash 2 */
#define AES_GHASH2_MASK             0xFFFFFFFFu  /**< \brief (AES_GHASH2) Register Bits Mask */

/* -------- AES_GHASH3 : (AES Offset: 0x78) (R/W 32) Galois Hash 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} AES_GHASH3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AES_GHASH3_OFFSET           0x78         /**< \brief (AES_GHASH3 offset) Galois Hash 3 */
#define AES_GHASH3_RESETVALUE       0x00000000   /**< \brief (AES_GHASH3 reset_value) Galois Hash 3 */
#define AES_GHASH3_MASK             0xFFFFFFFFu  /**< \brief (AES_GHASH3) Register Bits Mask */

/* -------- AES_CIPLEN : (AES Offset: 0x80) (R/W 32) Cipher Length -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} AES_CIPLEN_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AES_CIPLEN_OFFSET           0x80         /**< \brief (AES_CIPLEN offset) Cipher Length */
#define AES_CIPLEN_RESETVALUE       0x00000000   /**< \brief (AES_CIPLEN reset_value) Cipher Length */
#define AES_CIPLEN_MASK             0xFFFFFFFFu  /**< \brief (AES_CIPLEN) Register Bits Mask */

/* -------- AES_RANDSEED : (AES Offset: 0x84) (R/W 32) Random Seed -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} AES_RANDSEED_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AES_RANDSEED_OFFSET         0x84         /**< \brief (AES_RANDSEED offset) Random Seed */
#define AES_RANDSEED_RESETVALUE     0x00000000   /**< \brief (AES_RANDSEED reset_value) Random Seed */
#define AES_RANDSEED_MASK           0xFFFFFFFFu  /**< \brief (AES_RANDSEED) Register Bits Mask */

/** \brief AES hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  __IO AES_CTRLA_Type            CTRLA;       /**< \brief Offset: 0x00 (R/W 32) Control A */
  __IO AES_CTRLB_Type            CTRLB;       /**< \brief Offset: 0x04 (R/W  8) Control B */
  __IO AES_INTENCLR_Type         INTENCLR;    /**< \brief Offset: 0x05 (R/W  8) Interrupt Enable Clear */
  __IO AES_INTENSET_Type         INTENSET;    /**< \brief Offset: 0x06 (R/W  8) Interrupt Enable Set */
  __IO AES_INTFLAG_Type          INTFLAG;     /**< \brief Offset: 0x07 (R/W  8) Interrupt Flag Status */
  __IO AES_DATABUFPTR_Type       DATABUFPTR;  /**< \brief Offset: 0x08 (R/W  8) Data buffer pointer */
  __O  AES_DBGCTRL_Type          DBGCTRL;     /**< \brief Offset: 0x09 ( /W  8) Debug control */
       RoReg8                    Reserved1[0x2];
  __O  AES_KEYWORD0_Type         KEYWORD0;    /**< \brief Offset: 0x0C ( /W 32) Keyword 0 */
  __O  AES_KEYWORD1_Type         KEYWORD1;    /**< \brief Offset: 0x10 ( /W 32) Keyword 1 */
  __O  AES_KEYWORD2_Type         KEYWORD2;    /**< \brief Offset: 0x14 ( /W 32) Keyword 2 */
  __O  AES_KEYWORD3_Type         KEYWORD3;    /**< \brief Offset: 0x18 ( /W 32) Keyword 3 */
  __O  AES_KEYWORD4_Type         KEYWORD4;    /**< \brief Offset: 0x1C ( /W 32) Keyword 4 */
  __O  AES_KEYWORD5_Type         KEYWORD5;    /**< \brief Offset: 0x20 ( /W 32) Keyword 5 */
  __O  AES_KEYWORD6_Type         KEYWORD6;    /**< \brief Offset: 0x24 ( /W 32) Keyword 6 */
  __O  AES_KEYWORD7_Type         KEYWORD7;    /**< \brief Offset: 0x28 ( /W 32) Keyword 7 */
       RoReg8                    Reserved2[0xC];
  __IO AES_INDATA_Type           INDATA;      /**< \brief Offset: 0x38 (R/W 32) Indata */
  __O  AES_INTVECTV0_Type        INTVECTV0;   /**< \brief Offset: 0x3C ( /W 32) Initialisation Vector 0 */
  __O  AES_INTVECTV1_Type        INTVECTV1;   /**< \brief Offset: 0x40 ( /W 32) Initialisation Vector 1 */
  __O  AES_INTVECTV2_Type        INTVECTV2;   /**< \brief Offset: 0x44 ( /W 32) Initialisation Vector 2 */
  __O  AES_INTVECTV3_Type        INTVECTV3;   /**< \brief Offset: 0x48 ( /W 32) Initialisation Vector 3 */
       RoReg8                    Reserved3[0x10];
  __IO AES_HASHKEY0_Type         HASHKEY0;    /**< \brief Offset: 0x5C (R/W 32) Hash key 0 */
  __IO AES_HASHKEY1_Type         HASHKEY1;    /**< \brief Offset: 0x60 (R/W 32) Hash key 1 */
  __IO AES_HASHKEY2_Type         HASHKEY2;    /**< \brief Offset: 0x64 (R/W 32) Hash key 2 */
  __IO AES_HASHKEY3_Type         HASHKEY3;    /**< \brief Offset: 0x68 (R/W 32) Hash key 3 */
  __IO AES_GHASH0_Type           GHASH0;      /**< \brief Offset: 0x6C (R/W 32) Galois Hash 0 */
  __IO AES_GHASH1_Type           GHASH1;      /**< \brief Offset: 0x70 (R/W 32) Galois Hash 1 */
  __IO AES_GHASH2_Type           GHASH2;      /**< \brief Offset: 0x74 (R/W 32) Galois Hash 2 */
  __IO AES_GHASH3_Type           GHASH3;      /**< \brief Offset: 0x78 (R/W 32) Galois Hash 3 */
       RoReg8                    Reserved4[0x4];
  __IO AES_CIPLEN_Type           CIPLEN;      /**< \brief Offset: 0x80 (R/W 32) Cipher Length */
  __IO AES_RANDSEED_Type         RANDSEED;    /**< \brief Offset: 0x84 (R/W 32) Random Seed */
} Aes;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR ATW */
/* ========================================================================== */
/** \addtogroup U3005_ATW Analog Test Wire Controller */
/*@{*/

