zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define ATW_U2219
#define REV_ATW                     0x101

/* -------- ATW_TESTCTRL : (ATW Offset: 0x00) (R/W  8) Test Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  ENABLE:1;         /*!< bit:      0  Analog Wire Control Enable         */
    uint8_t  DRSTEN:1;         /*!< bit:      1  Pad Drive Strength Test Enable     */
    uint8_t  :6;               /*!< bit:  2.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} ATW_TESTCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ATW_TESTCTRL_OFFSET         0x00         /**< \brief (ATW_TESTCTRL offset) Test Control */
#define ATW_TESTCTRL_RESETVALUE     0x00         /**< \brief (ATW_TESTCTRL reset_value) Test Control */

#define ATW_TESTCTRL_ENABLE_Pos     0            /**< \brief (ATW_TESTCTRL) Analog Wire Control Enable */
#define ATW_TESTCTRL_ENABLE         (0x1u << ATW_TESTCTRL_ENABLE_Pos)
#define ATW_TESTCTRL_DRSTEN_Pos     1            /**< \brief (ATW_TESTCTRL) Pad Drive Strength Test Enable */
#define ATW_TESTCTRL_DRSTEN         (0x1u << ATW_TESTCTRL_DRSTEN_Pos)
#define ATW_TESTCTRL_MASK           0x03u        /**< \brief (ATW_TESTCTRL) Register Bits Mask */

/* -------- ATW_SPCTRL : (ATW Offset: 0x08) (R/W  8) Spacer Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  NLEFTN:1;         /*!< bit:      0  N-Wire Left Switch Disable         */
    uint8_t  NGROUNDN:1;       /*!< bit:      1  N-Wire Ground Switch Disable       */
    uint8_t  NRIGHTN:1;        /*!< bit:      2  N-Wire Right Switch Disable        */
    uint8_t  PLEFTN:1;         /*!< bit:      3  N-Wire Left Switch Disable         */
    uint8_t  PGROUNDN:1;       /*!< bit:      4  N-Wire Ground Switch Disable       */
    uint8_t  PRIGHTN:1;        /*!< bit:      5  N-Wire Right Switch Disable        */
    uint8_t  SHORT:1;          /*!< bit:      6  Wires Short Enable                 */
    uint8_t  :1;               /*!< bit:      7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} ATW_SPCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ATW_SPCTRL_OFFSET           0x08         /**< \brief (ATW_SPCTRL offset) Spacer Control */
#define ATW_SPCTRL_RESETVALUE       0x24         /**< \brief (ATW_SPCTRL reset_value) Spacer Control */

#define ATW_SPCTRL_NLEFTN_Pos       0            /**< \brief (ATW_SPCTRL) N-Wire Left Switch Disable */
#define ATW_SPCTRL_NLEFTN           (0x1u << ATW_SPCTRL_NLEFTN_Pos)
#define ATW_SPCTRL_NGROUNDN_Pos     1            /**< \brief (ATW_SPCTRL) N-Wire Ground Switch Disable */
#define ATW_SPCTRL_NGROUNDN         (0x1u << ATW_SPCTRL_NGROUNDN_Pos)
#define ATW_SPCTRL_NRIGHTN_Pos      2            /**< \brief (ATW_SPCTRL) N-Wire Right Switch Disable */
#define ATW_SPCTRL_NRIGHTN          (0x1u << ATW_SPCTRL_NRIGHTN_Pos)
#define ATW_SPCTRL_PLEFTN_Pos       3            /**< \brief (ATW_SPCTRL) N-Wire Left Switch Disable */
#define ATW_SPCTRL_PLEFTN           (0x1u << ATW_SPCTRL_PLEFTN_Pos)
#define ATW_SPCTRL_PGROUNDN_Pos     4            /**< \brief (ATW_SPCTRL) N-Wire Ground Switch Disable */
#define ATW_SPCTRL_PGROUNDN         (0x1u << ATW_SPCTRL_PGROUNDN_Pos)
#define ATW_SPCTRL_PRIGHTN_Pos      5            /**< \brief (ATW_SPCTRL) N-Wire Right Switch Disable */
#define ATW_SPCTRL_PRIGHTN          (0x1u << ATW_SPCTRL_PRIGHTN_Pos)
#define ATW_SPCTRL_SHORT_Pos        6            /**< \brief (ATW_SPCTRL) Wires Short Enable */
#define ATW_SPCTRL_SHORT            (0x1u << ATW_SPCTRL_SHORT_Pos)
#define ATW_SPCTRL_MASK             0x7Fu        /**< \brief (ATW_SPCTRL) Register Bits Mask */

/* -------- ATW_NWIREEN : (ATW Offset: 0x40) (R/W 32) N-Wire Enable -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} ATW_NWIREEN_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ATW_NWIREEN_OFFSET          0x40         /**< \brief (ATW_NWIREEN offset) N-Wire Enable */
#define ATW_NWIREEN_RESETVALUE      0x00000000   /**< \brief (ATW_NWIREEN reset_value) N-Wire Enable */
#define ATW_NWIREEN_MASK            0xFFFFFFFFu  /**< \brief (ATW_NWIREEN) Register Bits Mask */

/* -------- ATW_PWIREEN : (ATW Offset: 0x44) (R/W 32) P-Wire Enable -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} ATW_PWIREEN_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ATW_PWIREEN_OFFSET          0x44         /**< \brief (ATW_PWIREEN offset) P-Wire Enable */
#define ATW_PWIREEN_RESETVALUE      0x00000000   /**< \brief (ATW_PWIREEN reset_value) P-Wire Enable */
#define ATW_PWIREEN_MASK            0xFFFFFFFFu  /**< \brief (ATW_PWIREEN) Register Bits Mask */

/** \brief AtwGroup hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  __IO ATW_NWIREEN_Type          NWIREEN;     /**< \brief Offset: 0x00 (R/W 32) N-Wire Enable */
  __IO ATW_PWIREEN_Type          PWIREEN;     /**< \brief Offset: 0x04 (R/W 32) P-Wire Enable */
} AtwGroup;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief ATW hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  __IO ATW_TESTCTRL_Type         TESTCTRL;    /**< \brief Offset: 0x00 (R/W  8) Test Control */
       RoReg8                    Reserved1[0x7];
  __IO ATW_SPCTRL_Type           SPCTRL[2];   /**< \brief Offset: 0x08 (R/W  8) Spacer Control */
       RoReg8                    Reserved2[0x36];
       AtwGroup                  Group[2];    /**< \brief Offset: 0x40 AtwGroup groups */
} Atw;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR CCL */
/* ========================================================================== */
/** \addtogroup U3005_CCL Configurable Custom Logic */
/*@{*/

