zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define DSU_CID3_OFFSET             0x1FFC       /**< \brief (DSU_CID3 offset) Component Identification 3 */
#define DSU_CID3_RESETVALUE         0x00000000   /**< \brief (DSU_CID3 reset_value) Component Identification 3 */

#define DSU_CID3_PREAMBLEB3_Pos     0            /**< \brief (DSU_CID3) Preamble Byte 3 */
#define DSU_CID3_PREAMBLEB3_Msk     (0xFFu << DSU_CID3_PREAMBLEB3_Pos)
#define DSU_CID3_PREAMBLEB3(value)  ((DSU_CID3_PREAMBLEB3_Msk & ((value) << DSU_CID3_PREAMBLEB3_Pos)))
#define DSU_CID3_MASK               0x000000FFu  /**< \brief (DSU_CID3) Register Bits Mask */

/** \brief DSU hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  __O  DSU_CTRL_Type             CTRL;        /**< \brief Offset: 0x0000 ( /W  8) Control */
  __IO DSU_STATUSA_Type          STATUSA;     /**< \brief Offset: 0x0001 (R/W  8) Status A */
  __I  DSU_STATUSB_Type          STATUSB;     /**< \brief Offset: 0x0002 (R/   8) Status B */
  __I  DSU_STATUSC_Type          STATUSC;     /**< \brief Offset: 0x0003 (R/   8) Status C */
  __IO DSU_ADDR_Type             ADDR;        /**< \brief Offset: 0x0004 (R/W 32) Address */
  __IO DSU_LENGTH_Type           LENGTH;      /**< \brief Offset: 0x0008 (R/W 32) Length */
  __IO DSU_DATA_Type             DATA;        /**< \brief Offset: 0x000C (R/W 32) Data */
  __IO DSU_DCC_Type              DCC[2];      /**< \brief Offset: 0x0010 (R/W 32) Debug Communication Channel n */
  __I  DSU_DID_Type              DID;         /**< \brief Offset: 0x0018 (R/  32) Device Identification */
  __IO DSU_CFG_Type              CFG;         /**< \brief Offset: 0x001C (R/W 32) Configuration */
       RoReg8                    Reserved1[0xD0];
  __IO DSU_DCFG_Type             DCFG[2];     /**< \brief Offset: 0x00F0 (R/W 32) Device Configuration */
  __IO DSU_UPTM_Type             UPTM;        /**< \brief Offset: 0x00F8 (R/W 32) UnProtected Test Mode */
  __IO DSU_TESTMODE_Type         TESTMODE;    /**< \brief Offset: 0x00FC (R/W 32) Test Mode */
       RoReg8                    Reserved2[0xF00];
  __I  DSU_ENTRY_Type            ENTRY[2];    /**< \brief Offset: 0x1000 (R/  32) Coresight ROM Table Entry n */
  __I  DSU_END_Type              END;         /**< \brief Offset: 0x1008 (R/  32) Coresight ROM Table End */
       RoReg8                    Reserved3[0xFC0];
  __I  DSU_MEMTYPE_Type          MEMTYPE;     /**< \brief Offset: 0x1FCC (R/  32) Coresight ROM Table Memory Type */
  __I  DSU_PID4_Type             PID4;        /**< \brief Offset: 0x1FD0 (R/  32) Peripheral Identification 4 */
  __I  DSU_PID5_Type             PID5;        /**< \brief Offset: 0x1FD4 (R/  32) Peripheral Identification 5 */
  __I  DSU_PID6_Type             PID6;        /**< \brief Offset: 0x1FD8 (R/  32) Peripheral Identification 6 */
  __I  DSU_PID7_Type             PID7;        /**< \brief Offset: 0x1FDC (R/  32) Peripheral Identification 7 */
  __I  DSU_PID0_Type             PID0;        /**< \brief Offset: 0x1FE0 (R/  32) Peripheral Identification 0 */
  __I  DSU_PID1_Type             PID1;        /**< \brief Offset: 0x1FE4 (R/  32) Peripheral Identification 1 */
  __I  DSU_PID2_Type             PID2;        /**< \brief Offset: 0x1FE8 (R/  32) Peripheral Identification 2 */
  __I  DSU_PID3_Type             PID3;        /**< \brief Offset: 0x1FEC (R/  32) Peripheral Identification 3 */
  __I  DSU_CID0_Type             CID0;        /**< \brief Offset: 0x1FF0 (R/  32) Component Identification 0 */
  __I  DSU_CID1_Type             CID1;        /**< \brief Offset: 0x1FF4 (R/  32) Component Identification 1 */
  __I  DSU_CID2_Type             CID2;        /**< \brief Offset: 0x1FF8 (R/  32) Component Identification 2 */
  __I  DSU_CID3_Type             CID3;        /**< \brief Offset: 0x1FFC (R/  32) Component Identification 3 */
} Dsu;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR DSUSTANDBY */
/* ========================================================================== */
/** \addtogroup U3005_DSUSTANDBY Device Service Unit */
/*@{*/

#define DSUSTANDBY_U2209
#define REV_DSUSTANDBY              0x100

/* -------- DSUSTANDBY_DCFG : (DSUSTANDBY Offset: 0xF0) (R/W 32) Device Configuration -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DCFG:32;          /*!< bit:  0..31  Device Configuration               */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} DSUSTANDBY_DCFG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSUSTANDBY_DCFG_OFFSET      0xF0         /**< \brief (DSUSTANDBY_DCFG offset) Device Configuration */
#define DSUSTANDBY_DCFG_RESETVALUE  0x00000000   /**< \brief (DSUSTANDBY_DCFG reset_value) Device Configuration */

#define DSUSTANDBY_DCFG_DCFG_Pos    0            /**< \brief (DSUSTANDBY_DCFG) Device Configuration */
#define DSUSTANDBY_DCFG_DCFG_Msk    (0xFFFFFFFFu << DSUSTANDBY_DCFG_DCFG_Pos)
#define DSUSTANDBY_DCFG_DCFG(value) ((DSUSTANDBY_DCFG_DCFG_Msk & ((value) << DSUSTANDBY_DCFG_DCFG_Pos)))
#define DSUSTANDBY_DCFG_MASK        0xFFFFFFFFu  /**< \brief (DSUSTANDBY_DCFG) Register Bits Mask */

/* -------- DSUSTANDBY_TESTMODE : (DSUSTANDBY Offset: 0xFC) (R/W 32) Test Mode -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TESTMODE:32;      /*!< bit:  0..31  Test Mode                          */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} DSUSTANDBY_TESTMODE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSUSTANDBY_TESTMODE_OFFSET  0xFC         /**< \brief (DSUSTANDBY_TESTMODE offset) Test Mode */
#define DSUSTANDBY_TESTMODE_RESETVALUE 0x00000000   /**< \brief (DSUSTANDBY_TESTMODE reset_value) Test Mode */

#define DSUSTANDBY_TESTMODE_TESTMODE_Pos 0            /**< \brief (DSUSTANDBY_TESTMODE) Test Mode */
#define DSUSTANDBY_TESTMODE_TESTMODE_Msk (0xFFFFFFFFu << DSUSTANDBY_TESTMODE_TESTMODE_Pos)
#define DSUSTANDBY_TESTMODE_TESTMODE(value) ((DSUSTANDBY_TESTMODE_TESTMODE_Msk & ((value) << DSUSTANDBY_TESTMODE_TESTMODE_Pos)))
#define DSUSTANDBY_TESTMODE_MASK    0xFFFFFFFFu  /**< \brief (DSUSTANDBY_TESTMODE) Register Bits Mask */

/** \brief DSUSTANDBY hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
       RoReg8                    Reserved1[0xF0];
  __IO DSUSTANDBY_DCFG_Type      DCFG[2];     /**< \brief Offset: 0xF0 (R/W 32) Device Configuration */
       RoReg8                    Reserved2[0x4];
  __IO DSUSTANDBY_TESTMODE_Type  TESTMODE;    /**< \brief Offset: 0xFC (R/W 32) Test Mode */
} Dsustandby;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR EIC */
/* ========================================================================== */
/** \addtogroup U3005_EIC External Interrupt Controller */
/*@{*/

#define EIC_U2254
#define REV_EIC                     0x100

