zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
/* -------- MCLK_APBEMASK : (MCLK Offset: 0x24) (R/W 32) APBE Mask -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t PAC_:1;           /*!< bit:      0  PAC APB Clock Enable               */
    uint32_t :1;               /*!< bit:      1  Reserved                           */
    uint32_t HMATRIXLP_:1;     /*!< bit:      2  HMATRIXLP APB Clock Enable         */
    uint32_t PICOP_:1;         /*!< bit:      3  PICOP APB Clock Enable             */
    uint32_t :28;              /*!< bit:  4..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} MCLK_APBEMASK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MCLK_APBEMASK_OFFSET        0x24         /**< \brief (MCLK_APBEMASK offset) APBE Mask */
#define MCLK_APBEMASK_RESETVALUE    0x00000009   /**< \brief (MCLK_APBEMASK reset_value) APBE Mask */

#define MCLK_APBEMASK_PAC_Pos       0            /**< \brief (MCLK_APBEMASK) PAC APB Clock Enable */
#define MCLK_APBEMASK_PAC           (0x1u << MCLK_APBEMASK_PAC_Pos)
#define MCLK_APBEMASK_HMATRIXLP_Pos 2            /**< \brief (MCLK_APBEMASK) HMATRIXLP APB Clock Enable */
#define MCLK_APBEMASK_HMATRIXLP     (0x1u << MCLK_APBEMASK_HMATRIXLP_Pos)
#define MCLK_APBEMASK_PICOP_Pos     3            /**< \brief (MCLK_APBEMASK) PICOP APB Clock Enable */
#define MCLK_APBEMASK_PICOP         (0x1u << MCLK_APBEMASK_PICOP_Pos)
#define MCLK_APBEMASK_MASK          0x0000000Du  /**< \brief (MCLK_APBEMASK) Register Bits Mask */

/* -------- MCLK_ODOFF : (MCLK Offset: 0x40) (R/W 16) On Demand Clock OFF -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t APB:5;            /*!< bit:  0.. 4  APBn On Demand Clock OFF           */
    uint16_t :10;              /*!< bit:  5..14  Reserved                           */
    uint16_t AHB:1;            /*!< bit:     15  AHB On Demand Clock OFF            */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} MCLK_ODOFF_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MCLK_ODOFF_OFFSET           0x40         /**< \brief (MCLK_ODOFF offset) On Demand Clock OFF */
#define MCLK_ODOFF_RESETVALUE       0x0000       /**< \brief (MCLK_ODOFF reset_value) On Demand Clock OFF */

#define MCLK_ODOFF_APB_Pos          0            /**< \brief (MCLK_ODOFF) APBn On Demand Clock OFF */
#define MCLK_ODOFF_APB_Msk          (0x1Fu << MCLK_ODOFF_APB_Pos)
#define MCLK_ODOFF_APB(value)       ((MCLK_ODOFF_APB_Msk & ((value) << MCLK_ODOFF_APB_Pos)))
#define MCLK_ODOFF_AHB_Pos          15           /**< \brief (MCLK_ODOFF) AHB On Demand Clock OFF */
#define MCLK_ODOFF_AHB              (0x1u << MCLK_ODOFF_AHB_Pos)
#define MCLK_ODOFF_MASK             0x801Fu      /**< \brief (MCLK_ODOFF) Register Bits Mask */

/** \brief MCLK hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  __IO MCLK_CTRLA_Type           CTRLA;       /**< \brief Offset: 0x00 (R/W  8) Control A */
  __IO MCLK_INTENCLR_Type        INTENCLR;    /**< \brief Offset: 0x01 (R/W  8) Interrupt Enable Clear */
  __IO MCLK_INTENSET_Type        INTENSET;    /**< \brief Offset: 0x02 (R/W  8) Interrupt Enable Set */
  __IO MCLK_INTFLAG_Type         INTFLAG;     /**< \brief Offset: 0x03 (R/W  8) Interrupt Flag Status and Clear */
  __IO MCLK_CPUDIV_Type          CPUDIV;      /**< \brief Offset: 0x04 (R/W  8) CPU Clock Division */
  __IO MCLK_LPDIV_Type           LPDIV;       /**< \brief Offset: 0x05 (R/W  8) Low-Power Clock Division */
  __IO MCLK_BUPDIV_Type          BUPDIV;      /**< \brief Offset: 0x06 (R/W  8) Backup Clock Division */
       RoReg8                    Reserved1[0x9];
  __IO MCLK_AHBMASK_Type         AHBMASK;     /**< \brief Offset: 0x10 (R/W 32) AHB Mask */
  __IO MCLK_APBAMASK_Type        APBAMASK;    /**< \brief Offset: 0x14 (R/W 32) APBA Mask */
  __IO MCLK_APBBMASK_Type        APBBMASK;    /**< \brief Offset: 0x18 (R/W 32) APBB Mask */
  __IO MCLK_APBCMASK_Type        APBCMASK;    /**< \brief Offset: 0x1C (R/W 32) APBC Mask */
  __IO MCLK_APBDMASK_Type        APBDMASK;    /**< \brief Offset: 0x20 (R/W 32) APBD Mask */
  __IO MCLK_APBEMASK_Type        APBEMASK;    /**< \brief Offset: 0x24 (R/W 32) APBE Mask */
       RoReg8                    Reserved2[0x18];
  __IO MCLK_ODOFF_Type           ODOFF;       /**< \brief Offset: 0x40 (R/W 16) On Demand Clock OFF */
} Mclk;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR MTB */
/* ========================================================================== */
/** \addtogroup U3005_MTB Cortex-M0+ Micro-Trace Buffer */
/*@{*/

#define MTB_U2002
#define REV_MTB                     0x100

/* -------- MTB_POSITION : (MTB Offset: 0x000) (R/W 32) MTB Position -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :2;               /*!< bit:  0.. 1  Reserved                           */
    uint32_t WRAP:1;           /*!< bit:      2  Pointer Value Wraps                */
    uint32_t POINTER:29;       /*!< bit:  3..31  Trace Packet Location Pointer      */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} MTB_POSITION_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MTB_POSITION_OFFSET         0x000        /**< \brief (MTB_POSITION offset) MTB Position */

#define MTB_POSITION_WRAP_Pos       2            /**< \brief (MTB_POSITION) Pointer Value Wraps */
#define MTB_POSITION_WRAP           (0x1u << MTB_POSITION_WRAP_Pos)
#define MTB_POSITION_POINTER_Pos    3            /**< \brief (MTB_POSITION) Trace Packet Location Pointer */
#define MTB_POSITION_POINTER_Msk    (0x1FFFFFFFu << MTB_POSITION_POINTER_Pos)
#define MTB_POSITION_POINTER(value) ((MTB_POSITION_POINTER_Msk & ((value) << MTB_POSITION_POINTER_Pos)))
#define MTB_POSITION_MASK           0xFFFFFFFCu  /**< \brief (MTB_POSITION) Register Bits Mask */

