zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define NVMCTRL_INTFLAG_READY_Pos   0            /**< \brief (NVMCTRL_INTFLAG) NVM Ready */
#define NVMCTRL_INTFLAG_READY       (0x1u << NVMCTRL_INTFLAG_READY_Pos)
#define NVMCTRL_INTFLAG_ERROR_Pos   1            /**< \brief (NVMCTRL_INTFLAG) Error */
#define NVMCTRL_INTFLAG_ERROR       (0x1u << NVMCTRL_INTFLAG_ERROR_Pos)
#define NVMCTRL_INTFLAG_MASK        0x03u        /**< \brief (NVMCTRL_INTFLAG) Register Bits Mask */

/* -------- NVMCTRL_STATUS : (NVMCTRL Offset: 0x18) (R/W 16) Status -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t PRM:1;            /*!< bit:      0  Power Reduction Mode               */
    uint16_t LOAD:1;           /*!< bit:      1  NVM Page Buffer Active Loading     */
    uint16_t PROGE:1;          /*!< bit:      2  Programming Error Status           */
    uint16_t LOCKE:1;          /*!< bit:      3  Lock Error Status                  */
    uint16_t NVME:1;           /*!< bit:      4  NVM Error                          */
    uint16_t :3;               /*!< bit:  5.. 7  Reserved                           */
    uint16_t SB:1;             /*!< bit:      8  Security Bit Status                */
    uint16_t :7;               /*!< bit:  9..15  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} NVMCTRL_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define NVMCTRL_STATUS_OFFSET       0x18         /**< \brief (NVMCTRL_STATUS offset) Status */
#define NVMCTRL_STATUS_RESETVALUE   0x0000       /**< \brief (NVMCTRL_STATUS reset_value) Status */

#define NVMCTRL_STATUS_PRM_Pos      0            /**< \brief (NVMCTRL_STATUS) Power Reduction Mode */
#define NVMCTRL_STATUS_PRM          (0x1u << NVMCTRL_STATUS_PRM_Pos)
#define NVMCTRL_STATUS_LOAD_Pos     1            /**< \brief (NVMCTRL_STATUS) NVM Page Buffer Active Loading */
#define NVMCTRL_STATUS_LOAD         (0x1u << NVMCTRL_STATUS_LOAD_Pos)
#define NVMCTRL_STATUS_PROGE_Pos    2            /**< \brief (NVMCTRL_STATUS) Programming Error Status */
#define NVMCTRL_STATUS_PROGE        (0x1u << NVMCTRL_STATUS_PROGE_Pos)
#define NVMCTRL_STATUS_LOCKE_Pos    3            /**< \brief (NVMCTRL_STATUS) Lock Error Status */
#define NVMCTRL_STATUS_LOCKE        (0x1u << NVMCTRL_STATUS_LOCKE_Pos)
#define NVMCTRL_STATUS_NVME_Pos     4            /**< \brief (NVMCTRL_STATUS) NVM Error */
#define NVMCTRL_STATUS_NVME         (0x1u << NVMCTRL_STATUS_NVME_Pos)
#define NVMCTRL_STATUS_SB_Pos       8            /**< \brief (NVMCTRL_STATUS) Security Bit Status */
#define NVMCTRL_STATUS_SB           (0x1u << NVMCTRL_STATUS_SB_Pos)
#define NVMCTRL_STATUS_MASK         0x011Fu      /**< \brief (NVMCTRL_STATUS) Register Bits Mask */

/* -------- NVMCTRL_ADDR : (NVMCTRL Offset: 0x1C) (R/W 32) Address -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ADDR:22;          /*!< bit:  0..21  NVM Address                        */
    uint32_t :10;              /*!< bit: 22..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} NVMCTRL_ADDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define NVMCTRL_ADDR_OFFSET         0x1C         /**< \brief (NVMCTRL_ADDR offset) Address */
#define NVMCTRL_ADDR_RESETVALUE     0x00000000   /**< \brief (NVMCTRL_ADDR reset_value) Address */

#define NVMCTRL_ADDR_ADDR_Pos       0            /**< \brief (NVMCTRL_ADDR) NVM Address */
#define NVMCTRL_ADDR_ADDR_Msk       (0x3FFFFFu << NVMCTRL_ADDR_ADDR_Pos)
#define NVMCTRL_ADDR_ADDR(value)    ((NVMCTRL_ADDR_ADDR_Msk & ((value) << NVMCTRL_ADDR_ADDR_Pos)))
#define NVMCTRL_ADDR_MASK           0x003FFFFFu  /**< \brief (NVMCTRL_ADDR) Register Bits Mask */

/* -------- NVMCTRL_LOCK : (NVMCTRL Offset: 0x20) (R/W 16) Lock Section -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t LOCK:16;          /*!< bit:  0..15  Region Lock Bits                   */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} NVMCTRL_LOCK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define NVMCTRL_LOCK_OFFSET         0x20         /**< \brief (NVMCTRL_LOCK offset) Lock Section */
#define NVMCTRL_LOCK_RESETVALUE     0x0000       /**< \brief (NVMCTRL_LOCK reset_value) Lock Section */

#define NVMCTRL_LOCK_LOCK_Pos       0            /**< \brief (NVMCTRL_LOCK) Region Lock Bits */
#define NVMCTRL_LOCK_LOCK_Msk       (0xFFFFu << NVMCTRL_LOCK_LOCK_Pos)
#define NVMCTRL_LOCK_LOCK(value)    ((NVMCTRL_LOCK_LOCK_Msk & ((value) << NVMCTRL_LOCK_LOCK_Pos)))
#define NVMCTRL_LOCK_MASK           0xFFFFu      /**< \brief (NVMCTRL_LOCK) Register Bits Mask */

/* -------- NVMCTRL_TMCTRL : (NVMCTRL Offset: 0x30) (R/W 32) Test Mode Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TKEY:8;           /*!< bit:  0.. 7  Test Key                           */
    uint32_t TIEN:1;           /*!< bit:      8  Test Interface Enable              */
    uint32_t TMEN:1;           /*!< bit:      9  Test Mode Enable                   */
    uint32_t SAOUTOVR:1;       /*!< bit:     10  saout_latch Override from Pin      */
    uint32_t STIDSBL:1;        /*!< bit:     11  Serial Test Interface Disable      */
    uint32_t FRSP:1;           /*!< bit:     12  Force Flash Response               */
    uint32_t SAENTH:1;         /*!< bit:     13  Force Sense Amplifier Enables High */
    uint32_t ANATM:1;          /*!< bit:     14  Analog Pins Test Mode Enable       */
    uint32_t MENCNTS:1;        /*!< bit:     15  MEN Counter Clock Source           */
    uint32_t MENCNT:10;        /*!< bit: 16..25  MEN High Cycle Count               */
    uint32_t FBGRQ:1;          /*!< bit:     26  Force the bandgap request          */
    uint32_t :5;               /*!< bit: 27..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} NVMCTRL_TMCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define NVMCTRL_TMCTRL_OFFSET       0x30         /**< \brief (NVMCTRL_TMCTRL offset) Test Mode Control */
#define NVMCTRL_TMCTRL_RESETVALUE   0x00000000   /**< \brief (NVMCTRL_TMCTRL reset_value) Test Mode Control */

#define NVMCTRL_TMCTRL_TKEY_Pos     0            /**< \brief (NVMCTRL_TMCTRL) Test Key */
#define NVMCTRL_TMCTRL_TKEY_Msk     (0xFFu << NVMCTRL_TMCTRL_TKEY_Pos)
#define NVMCTRL_TMCTRL_TKEY(value)  ((NVMCTRL_TMCTRL_TKEY_Msk & ((value) << NVMCTRL_TMCTRL_TKEY_Pos)))
#define   NVMCTRL_TMCTRL_TKEY_KEY_Val     0xD5u   /**< \brief (NVMCTRL_TMCTRL) Test Key */
#define NVMCTRL_TMCTRL_TKEY_KEY     (NVMCTRL_TMCTRL_TKEY_KEY_Val   << NVMCTRL_TMCTRL_TKEY_Pos)
#define NVMCTRL_TMCTRL_TIEN_Pos     8            /**< \brief (NVMCTRL_TMCTRL) Test Interface Enable */
#define NVMCTRL_TMCTRL_TIEN         (0x1u << NVMCTRL_TMCTRL_TIEN_Pos)
#define NVMCTRL_TMCTRL_TMEN_Pos     9            /**< \brief (NVMCTRL_TMCTRL) Test Mode Enable */
#define NVMCTRL_TMCTRL_TMEN         (0x1u << NVMCTRL_TMCTRL_TMEN_Pos)
#define NVMCTRL_TMCTRL_SAOUTOVR_Pos 10           /**< \brief (NVMCTRL_TMCTRL) saout_latch Override from Pin */
#define NVMCTRL_TMCTRL_SAOUTOVR     (0x1u << NVMCTRL_TMCTRL_SAOUTOVR_Pos)
#define NVMCTRL_TMCTRL_STIDSBL_Pos  11           /**< \brief (NVMCTRL_TMCTRL) Serial Test Interface Disable */
#define NVMCTRL_TMCTRL_STIDSBL      (0x1u << NVMCTRL_TMCTRL_STIDSBL_Pos)
#define NVMCTRL_TMCTRL_FRSP_Pos     12           /**< \brief (NVMCTRL_TMCTRL) Force Flash Response */
#define NVMCTRL_TMCTRL_FRSP         (0x1u << NVMCTRL_TMCTRL_FRSP_Pos)
#define NVMCTRL_TMCTRL_SAENTH_Pos   13           /**< \brief (NVMCTRL_TMCTRL) Force Sense Amplifier Enables High */
#define NVMCTRL_TMCTRL_SAENTH       (0x1u << NVMCTRL_TMCTRL_SAENTH_Pos)
#define NVMCTRL_TMCTRL_ANATM_Pos    14           /**< \brief (NVMCTRL_TMCTRL) Analog Pins Test Mode Enable */
#define NVMCTRL_TMCTRL_ANATM        (0x1u << NVMCTRL_TMCTRL_ANATM_Pos)
#define NVMCTRL_TMCTRL_MENCNTS_Pos  15           /**< \brief (NVMCTRL_TMCTRL) MEN Counter Clock Source */
#define NVMCTRL_TMCTRL_MENCNTS      (0x1u << NVMCTRL_TMCTRL_MENCNTS_Pos)
#define NVMCTRL_TMCTRL_MENCNT_Pos   16           /**< \brief (NVMCTRL_TMCTRL) MEN High Cycle Count */
#define NVMCTRL_TMCTRL_MENCNT_Msk   (0x3FFu << NVMCTRL_TMCTRL_MENCNT_Pos)
#define NVMCTRL_TMCTRL_MENCNT(value) ((NVMCTRL_TMCTRL_MENCNT_Msk & ((value) << NVMCTRL_TMCTRL_MENCNT_Pos)))
#define NVMCTRL_TMCTRL_FBGRQ_Pos    26           /**< \brief (NVMCTRL_TMCTRL) Force the bandgap request */
#define NVMCTRL_TMCTRL_FBGRQ        (0x1u << NVMCTRL_TMCTRL_FBGRQ_Pos)
#define NVMCTRL_TMCTRL_MASK         0x07FFFFFFu  /**< \brief (NVMCTRL_TMCTRL) Register Bits Mask */

/* -------- NVMCTRL_TCTRLA : (NVMCTRL Offset: 0x34) (R/W 32) Test Control A -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OM:5;             /*!< bit:  0.. 4  OM Command                         */
    uint32_t :3;               /*!< bit:  5.. 7  Reserved                           */
    uint32_t CTRLRST:2;        /*!< bit:  8.. 9  NVM Controller Reset               */
    uint32_t CHOLD:1;          /*!< bit:     10  Command Hold                       */
    uint32_t RDE:1;            /*!< bit:     11  Rdn_e Override                     */
    uint32_t CLRLTCH:1;        /*!< bit:     12  Clrltchn Override                  */
    uint32_t RDF:1;            /*!< bit:     13  Rdn_f Override                     */
    uint32_t WT:1;             /*!< bit:     14  Wtn Override                       */
    uint32_t LD:1;             /*!< bit:     15  Page Buffer Load                   */
    uint32_t SA_EN:4;          /*!< bit: 16..19  Sense Amplifier Enable             */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} NVMCTRL_TCTRLA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define NVMCTRL_TCTRLA_OFFSET       0x34         /**< \brief (NVMCTRL_TCTRLA offset) Test Control A */
#define NVMCTRL_TCTRLA_RESETVALUE   0x00000000   /**< \brief (NVMCTRL_TCTRLA reset_value) Test Control A */

#define NVMCTRL_TCTRLA_OM_Pos       0            /**< \brief (NVMCTRL_TCTRLA) OM Command */
#define NVMCTRL_TCTRLA_OM_Msk       (0x1Fu << NVMCTRL_TCTRLA_OM_Pos)
#define NVMCTRL_TCTRLA_OM(value)    ((NVMCTRL_TCTRLA_OM_Msk & ((value) << NVMCTRL_TCTRLA_OM_Pos)))
#define NVMCTRL_TCTRLA_CTRLRST_Pos  8            /**< \brief (NVMCTRL_TCTRLA) NVM Controller Reset */
#define NVMCTRL_TCTRLA_CTRLRST_Msk  (0x3u << NVMCTRL_TCTRLA_CTRLRST_Pos)
#define NVMCTRL_TCTRLA_CTRLRST(value) ((NVMCTRL_TCTRLA_CTRLRST_Msk & ((value) << NVMCTRL_TCTRLA_CTRLRST_Pos)))
#define NVMCTRL_TCTRLA_CHOLD_Pos    10           /**< \brief (NVMCTRL_TCTRLA) Command Hold */
#define NVMCTRL_TCTRLA_CHOLD        (0x1u << NVMCTRL_TCTRLA_CHOLD_Pos)
#define NVMCTRL_TCTRLA_RDE_Pos      11           /**< \brief (NVMCTRL_TCTRLA) Rdn_e Override */
#define NVMCTRL_TCTRLA_RDE          (0x1u << NVMCTRL_TCTRLA_RDE_Pos)
#define NVMCTRL_TCTRLA_CLRLTCH_Pos  12           /**< \brief (NVMCTRL_TCTRLA) Clrltchn Override */
#define NVMCTRL_TCTRLA_CLRLTCH      (0x1u << NVMCTRL_TCTRLA_CLRLTCH_Pos)
#define NVMCTRL_TCTRLA_RDF_Pos      13           /**< \brief (NVMCTRL_TCTRLA) Rdn_f Override */
#define NVMCTRL_TCTRLA_RDF          (0x1u << NVMCTRL_TCTRLA_RDF_Pos)
#define NVMCTRL_TCTRLA_WT_Pos       14           /**< \brief (NVMCTRL_TCTRLA) Wtn Override */
#define NVMCTRL_TCTRLA_WT           (0x1u << NVMCTRL_TCTRLA_WT_Pos)
#define NVMCTRL_TCTRLA_LD_Pos       15           /**< \brief (NVMCTRL_TCTRLA) Page Buffer Load */
#define NVMCTRL_TCTRLA_LD           (0x1u << NVMCTRL_TCTRLA_LD_Pos)
#define NVMCTRL_TCTRLA_SA_EN_Pos    16           /**< \brief (NVMCTRL_TCTRLA) Sense Amplifier Enable */
#define NVMCTRL_TCTRLA_SA_EN_Msk    (0xFu << NVMCTRL_TCTRLA_SA_EN_Pos)
#define NVMCTRL_TCTRLA_SA_EN(value) ((NVMCTRL_TCTRLA_SA_EN_Msk & ((value) << NVMCTRL_TCTRLA_SA_EN_Pos)))
#define NVMCTRL_TCTRLA_MASK         0x000FFF1Fu  /**< \brief (NVMCTRL_TCTRLA) Register Bits Mask */

/* -------- NVMCTRL_TCTRLB : (NVMCTRL Offset: 0x38) (R/W 32) Test Control B -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RESETSET:1;       /*!< bit:      0  Reset Input Set                    */
    uint32_t MENSET:1;         /*!< bit:      1  Memory Enable Input Set            */
    uint32_t PU2SET:1;         /*!< bit:      2  Second Power-Up Input Set          */
    uint32_t POOVRSET:1;       /*!< bit:      3  Power-On Override Set              */
    uint32_t POH08SET:1;       /*!< bit:      4  Power-On Above 0.8V Input Set      */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t PU1SET:1;         /*!< bit:      6  First Power-Up Input Set           */
    uint32_t PROBESET:1;       /*!< bit:      7  Probe Input Set                    */
    uint32_t RESETCLR:1;       /*!< bit:      8  Reset Input Clear                  */
    uint32_t MENCLR:1;         /*!< bit:      9  Memory Enable Input Clear          */
    uint32_t PU2CLR:1;         /*!< bit:     10  Second Power-Up Input Clear        */
    uint32_t POOVRCLR:1;       /*!< bit:     11  Power-On Override Clear            */
    uint32_t POH08CLR:1;       /*!< bit:     12  Power-On Above 0.8V Input Clear    */
    uint32_t :1;               /*!< bit:     13  Reserved                           */
    uint32_t PU1CLR:1;         /*!< bit:     14  First Power-Up Input Clear         */
    uint32_t PROBECLR:1;       /*!< bit:     15  Probe Input Clear                  */
    uint32_t RESETTGL:1;       /*!< bit:     16  Reset Input Toggle                 */
    uint32_t MENTGL:1;         /*!< bit:     17  Memory Enable Input Toggle         */
    uint32_t PU2TGL:1;         /*!< bit:     18  Second Power-Up Input Toggle       */
    uint32_t POOVRTGL:1;       /*!< bit:     19  Power-On Override Toggle           */
    uint32_t POH08TGL:1;       /*!< bit:     20  Power-On Above 0.8V Input Toggle   */
    uint32_t :1;               /*!< bit:     21  Reserved                           */
    uint32_t PU1TGL:1;         /*!< bit:     22  First Power-Up Input Toggle        */
    uint32_t PROBETGL:1;       /*!< bit:     23  Probe Input Toggle                 */
    uint32_t :8;               /*!< bit: 24..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} NVMCTRL_TCTRLB_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

