zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define NVMCTRL_TCTRLB_OFFSET       0x38         /**< \brief (NVMCTRL_TCTRLB offset) Test Control B */
#define NVMCTRL_TCTRLB_RESETVALUE   0x00000000   /**< \brief (NVMCTRL_TCTRLB reset_value) Test Control B */

#define NVMCTRL_TCTRLB_RESETSET_Pos 0            /**< \brief (NVMCTRL_TCTRLB) Reset Input Set */
#define NVMCTRL_TCTRLB_RESETSET     (0x1u << NVMCTRL_TCTRLB_RESETSET_Pos)
#define NVMCTRL_TCTRLB_MENSET_Pos   1            /**< \brief (NVMCTRL_TCTRLB) Memory Enable Input Set */
#define NVMCTRL_TCTRLB_MENSET       (0x1u << NVMCTRL_TCTRLB_MENSET_Pos)
#define NVMCTRL_TCTRLB_PU2SET_Pos   2            /**< \brief (NVMCTRL_TCTRLB) Second Power-Up Input Set */
#define NVMCTRL_TCTRLB_PU2SET       (0x1u << NVMCTRL_TCTRLB_PU2SET_Pos)
#define NVMCTRL_TCTRLB_POOVRSET_Pos 3            /**< \brief (NVMCTRL_TCTRLB) Power-On Override Set */
#define NVMCTRL_TCTRLB_POOVRSET     (0x1u << NVMCTRL_TCTRLB_POOVRSET_Pos)
#define NVMCTRL_TCTRLB_POH08SET_Pos 4            /**< \brief (NVMCTRL_TCTRLB) Power-On Above 0.8V Input Set */
#define NVMCTRL_TCTRLB_POH08SET     (0x1u << NVMCTRL_TCTRLB_POH08SET_Pos)
#define NVMCTRL_TCTRLB_PU1SET_Pos   6            /**< \brief (NVMCTRL_TCTRLB) First Power-Up Input Set */
#define NVMCTRL_TCTRLB_PU1SET       (0x1u << NVMCTRL_TCTRLB_PU1SET_Pos)
#define NVMCTRL_TCTRLB_PROBESET_Pos 7            /**< \brief (NVMCTRL_TCTRLB) Probe Input Set */
#define NVMCTRL_TCTRLB_PROBESET     (0x1u << NVMCTRL_TCTRLB_PROBESET_Pos)
#define NVMCTRL_TCTRLB_RESETCLR_Pos 8            /**< \brief (NVMCTRL_TCTRLB) Reset Input Clear */
#define NVMCTRL_TCTRLB_RESETCLR     (0x1u << NVMCTRL_TCTRLB_RESETCLR_Pos)
#define NVMCTRL_TCTRLB_MENCLR_Pos   9            /**< \brief (NVMCTRL_TCTRLB) Memory Enable Input Clear */
#define NVMCTRL_TCTRLB_MENCLR       (0x1u << NVMCTRL_TCTRLB_MENCLR_Pos)
#define NVMCTRL_TCTRLB_PU2CLR_Pos   10           /**< \brief (NVMCTRL_TCTRLB) Second Power-Up Input Clear */
#define NVMCTRL_TCTRLB_PU2CLR       (0x1u << NVMCTRL_TCTRLB_PU2CLR_Pos)
#define NVMCTRL_TCTRLB_POOVRCLR_Pos 11           /**< \brief (NVMCTRL_TCTRLB) Power-On Override Clear */
#define NVMCTRL_TCTRLB_POOVRCLR     (0x1u << NVMCTRL_TCTRLB_POOVRCLR_Pos)
#define NVMCTRL_TCTRLB_POH08CLR_Pos 12           /**< \brief (NVMCTRL_TCTRLB) Power-On Above 0.8V Input Clear */
#define NVMCTRL_TCTRLB_POH08CLR     (0x1u << NVMCTRL_TCTRLB_POH08CLR_Pos)
#define NVMCTRL_TCTRLB_PU1CLR_Pos   14           /**< \brief (NVMCTRL_TCTRLB) First Power-Up Input Clear */
#define NVMCTRL_TCTRLB_PU1CLR       (0x1u << NVMCTRL_TCTRLB_PU1CLR_Pos)
#define NVMCTRL_TCTRLB_PROBECLR_Pos 15           /**< \brief (NVMCTRL_TCTRLB) Probe Input Clear */
#define NVMCTRL_TCTRLB_PROBECLR     (0x1u << NVMCTRL_TCTRLB_PROBECLR_Pos)
#define NVMCTRL_TCTRLB_RESETTGL_Pos 16           /**< \brief (NVMCTRL_TCTRLB) Reset Input Toggle */
#define NVMCTRL_TCTRLB_RESETTGL     (0x1u << NVMCTRL_TCTRLB_RESETTGL_Pos)
#define NVMCTRL_TCTRLB_MENTGL_Pos   17           /**< \brief (NVMCTRL_TCTRLB) Memory Enable Input Toggle */
#define NVMCTRL_TCTRLB_MENTGL       (0x1u << NVMCTRL_TCTRLB_MENTGL_Pos)
#define NVMCTRL_TCTRLB_PU2TGL_Pos   18           /**< \brief (NVMCTRL_TCTRLB) Second Power-Up Input Toggle */
#define NVMCTRL_TCTRLB_PU2TGL       (0x1u << NVMCTRL_TCTRLB_PU2TGL_Pos)
#define NVMCTRL_TCTRLB_POOVRTGL_Pos 19           /**< \brief (NVMCTRL_TCTRLB) Power-On Override Toggle */
#define NVMCTRL_TCTRLB_POOVRTGL     (0x1u << NVMCTRL_TCTRLB_POOVRTGL_Pos)
#define NVMCTRL_TCTRLB_POH08TGL_Pos 20           /**< \brief (NVMCTRL_TCTRLB) Power-On Above 0.8V Input Toggle */
#define NVMCTRL_TCTRLB_POH08TGL     (0x1u << NVMCTRL_TCTRLB_POH08TGL_Pos)
#define NVMCTRL_TCTRLB_PU1TGL_Pos   22           /**< \brief (NVMCTRL_TCTRLB) First Power-Up Input Toggle */
#define NVMCTRL_TCTRLB_PU1TGL       (0x1u << NVMCTRL_TCTRLB_PU1TGL_Pos)
#define NVMCTRL_TCTRLB_PROBETGL_Pos 23           /**< \brief (NVMCTRL_TCTRLB) Probe Input Toggle */
#define NVMCTRL_TCTRLB_PROBETGL     (0x1u << NVMCTRL_TCTRLB_PROBETGL_Pos)
#define NVMCTRL_TCTRLB_MASK         0x00DFDFDFu  /**< \brief (NVMCTRL_TCTRLB) Register Bits Mask */

/* -------- NVMCTRL_TSTATUS : (NVMCTRL Offset: 0x3C) (R/W 32) Test Status -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RDYBSYN_F:1;      /*!< bit:      0  Current NVM rdybsyn Output         */
    uint32_t ERROR:1;          /*!< bit:      1  Current NVM error Output           */
    uint32_t PUC:1;            /*!< bit:      2  Current NVM puc Output             */
    uint32_t :1;               /*!< bit:      3  Reserved                           */
    uint32_t RDDLY:1;          /*!< bit:      4  Read Delay                         */
    uint32_t BIT_ERR:3;        /*!< bit:  5.. 7  Bit Error                          */
    uint32_t STATE:6;          /*!< bit:  8..13  Internal State Machine State       */
    uint32_t FUSETOUT:1;       /*!< bit:     14  Fuse Update Done TimeOut           */
    uint32_t SYNCMETA:1;       /*!< bit:     15  Synchronizer Metastability Check   */
    uint32_t RDYBSYN_E:1;      /*!< bit:     16  Current WWREE rdybsyn Output       */
    uint32_t FLASH_VDDCORE_OK:1; /*!< bit:     17  Current NVM flash_vddcore_ok Output */
    uint32_t BGRDY:1;          /*!< bit:     18  Output of internal NVMCTRL bandgap MUX */
    uint32_t PL:2;             /*!< bit: 19..20  Performance level                  */
    uint32_t :11;              /*!< bit: 21..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} NVMCTRL_TSTATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define NVMCTRL_TSTATUS_OFFSET      0x3C         /**< \brief (NVMCTRL_TSTATUS offset) Test Status */
#define NVMCTRL_TSTATUS_RESETVALUE  0x00000000   /**< \brief (NVMCTRL_TSTATUS reset_value) Test Status */

#define NVMCTRL_TSTATUS_RDYBSYN_F_Pos 0            /**< \brief (NVMCTRL_TSTATUS) Current NVM rdybsyn Output */
#define NVMCTRL_TSTATUS_RDYBSYN_F   (0x1u << NVMCTRL_TSTATUS_RDYBSYN_F_Pos)
#define NVMCTRL_TSTATUS_ERROR_Pos   1            /**< \brief (NVMCTRL_TSTATUS) Current NVM error Output */
#define NVMCTRL_TSTATUS_ERROR       (0x1u << NVMCTRL_TSTATUS_ERROR_Pos)
#define NVMCTRL_TSTATUS_PUC_Pos     2            /**< \brief (NVMCTRL_TSTATUS) Current NVM puc Output */
#define NVMCTRL_TSTATUS_PUC         (0x1u << NVMCTRL_TSTATUS_PUC_Pos)
#define NVMCTRL_TSTATUS_RDDLY_Pos   4            /**< \brief (NVMCTRL_TSTATUS) Read Delay */
#define NVMCTRL_TSTATUS_RDDLY       (0x1u << NVMCTRL_TSTATUS_RDDLY_Pos)
#define NVMCTRL_TSTATUS_BIT_ERR_Pos 5            /**< \brief (NVMCTRL_TSTATUS) Bit Error */
#define NVMCTRL_TSTATUS_BIT_ERR_Msk (0x7u << NVMCTRL_TSTATUS_BIT_ERR_Pos)
#define NVMCTRL_TSTATUS_BIT_ERR(value) ((NVMCTRL_TSTATUS_BIT_ERR_Msk & ((value) << NVMCTRL_TSTATUS_BIT_ERR_Pos)))
#define NVMCTRL_TSTATUS_STATE_Pos   8            /**< \brief (NVMCTRL_TSTATUS) Internal State Machine State */
#define NVMCTRL_TSTATUS_STATE_Msk   (0x3Fu << NVMCTRL_TSTATUS_STATE_Pos)
#define NVMCTRL_TSTATUS_STATE(value) ((NVMCTRL_TSTATUS_STATE_Msk & ((value) << NVMCTRL_TSTATUS_STATE_Pos)))
#define NVMCTRL_TSTATUS_FUSETOUT_Pos 14           /**< \brief (NVMCTRL_TSTATUS) Fuse Update Done TimeOut */
#define NVMCTRL_TSTATUS_FUSETOUT    (0x1u << NVMCTRL_TSTATUS_FUSETOUT_Pos)
#define NVMCTRL_TSTATUS_SYNCMETA_Pos 15           /**< \brief (NVMCTRL_TSTATUS) Synchronizer Metastability Check */
#define NVMCTRL_TSTATUS_SYNCMETA    (0x1u << NVMCTRL_TSTATUS_SYNCMETA_Pos)
#define NVMCTRL_TSTATUS_RDYBSYN_E_Pos 16           /**< \brief (NVMCTRL_TSTATUS) Current WWREE rdybsyn Output */
#define NVMCTRL_TSTATUS_RDYBSYN_E   (0x1u << NVMCTRL_TSTATUS_RDYBSYN_E_Pos)
#define NVMCTRL_TSTATUS_FLASH_VDDCORE_OK_Pos 17           /**< \brief (NVMCTRL_TSTATUS) Current NVM flash_vddcore_ok Output */
#define NVMCTRL_TSTATUS_FLASH_VDDCORE_OK (0x1u << NVMCTRL_TSTATUS_FLASH_VDDCORE_OK_Pos)
#define NVMCTRL_TSTATUS_BGRDY_Pos   18           /**< \brief (NVMCTRL_TSTATUS) Output of internal NVMCTRL bandgap MUX */
#define NVMCTRL_TSTATUS_BGRDY       (0x1u << NVMCTRL_TSTATUS_BGRDY_Pos)
#define NVMCTRL_TSTATUS_PL_Pos      19           /**< \brief (NVMCTRL_TSTATUS) Performance level */
#define NVMCTRL_TSTATUS_PL_Msk      (0x3u << NVMCTRL_TSTATUS_PL_Pos)
#define NVMCTRL_TSTATUS_PL(value)   ((NVMCTRL_TSTATUS_PL_Msk & ((value) << NVMCTRL_TSTATUS_PL_Pos)))
#define NVMCTRL_TSTATUS_MASK        0x001FFFF7u  /**< \brief (NVMCTRL_TSTATUS) Register Bits Mask */

/* -------- NVMCTRL_TUSER : (NVMCTRL Offset: 0x40) (R/W 32) Test User -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t BOOTPROT:3;       /*!< bit:  0.. 2  BOOTPROT Size Override             */
    uint32_t :1;               /*!< bit:      3  Reserved                           */
    uint32_t EEPROM:3;         /*!< bit:  4.. 6  EEPROM Size Override               */
    uint32_t :25;              /*!< bit:  7..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} NVMCTRL_TUSER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

