zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define NVMCTRL_TUSER_OFFSET        0x40         /**< \brief (NVMCTRL_TUSER offset) Test User */
#define NVMCTRL_TUSER_RESETVALUE    0x00000000   /**< \brief (NVMCTRL_TUSER reset_value) Test User */

#define NVMCTRL_TUSER_BOOTPROT_Pos  0            /**< \brief (NVMCTRL_TUSER) BOOTPROT Size Override */
#define NVMCTRL_TUSER_BOOTPROT_Msk  (0x7u << NVMCTRL_TUSER_BOOTPROT_Pos)
#define NVMCTRL_TUSER_BOOTPROT(value) ((NVMCTRL_TUSER_BOOTPROT_Msk & ((value) << NVMCTRL_TUSER_BOOTPROT_Pos)))
#define NVMCTRL_TUSER_EEPROM_Pos    4            /**< \brief (NVMCTRL_TUSER) EEPROM Size Override */
#define NVMCTRL_TUSER_EEPROM_Msk    (0x7u << NVMCTRL_TUSER_EEPROM_Pos)
#define NVMCTRL_TUSER_EEPROM(value) ((NVMCTRL_TUSER_EEPROM_Msk & ((value) << NVMCTRL_TUSER_EEPROM_Pos)))
#define NVMCTRL_TUSER_MASK          0x00000077u  /**< \brief (NVMCTRL_TUSER) Register Bits Mask */

/* -------- NVMCTRL_TADDR : (NVMCTRL Offset: 0x44) (R/W 32) Test Address -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TADDR:22;         /*!< bit:  0..21  NVM Test Address                   */
    uint32_t :10;              /*!< bit: 22..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} NVMCTRL_TADDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define NVMCTRL_TADDR_OFFSET        0x44         /**< \brief (NVMCTRL_TADDR offset) Test Address */
#define NVMCTRL_TADDR_RESETVALUE    0x00000000   /**< \brief (NVMCTRL_TADDR reset_value) Test Address */

#define NVMCTRL_TADDR_TADDR_Pos     0            /**< \brief (NVMCTRL_TADDR) NVM Test Address */
#define NVMCTRL_TADDR_TADDR_Msk     (0x3FFFFFu << NVMCTRL_TADDR_TADDR_Pos)
#define NVMCTRL_TADDR_TADDR(value)  ((NVMCTRL_TADDR_TADDR_Msk & ((value) << NVMCTRL_TADDR_TADDR_Pos)))
#define NVMCTRL_TADDR_MASK          0x003FFFFFu  /**< \brief (NVMCTRL_TADDR) Register Bits Mask */

/* -------- NVMCTRL_TDATA0 : (NVMCTRL Offset: 0x48) (R/W 32) Test Data 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TDATA:32;         /*!< bit:  0..31  NVM Test Data[31:0]                */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} NVMCTRL_TDATA0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define NVMCTRL_TDATA0_OFFSET       0x48         /**< \brief (NVMCTRL_TDATA0 offset) Test Data 0 */
#define NVMCTRL_TDATA0_RESETVALUE   0x00000000   /**< \brief (NVMCTRL_TDATA0 reset_value) Test Data 0 */

#define NVMCTRL_TDATA0_TDATA_Pos    0            /**< \brief (NVMCTRL_TDATA0) NVM Test Data[31:0] */
#define NVMCTRL_TDATA0_TDATA_Msk    (0xFFFFFFFFu << NVMCTRL_TDATA0_TDATA_Pos)
#define NVMCTRL_TDATA0_TDATA(value) ((NVMCTRL_TDATA0_TDATA_Msk & ((value) << NVMCTRL_TDATA0_TDATA_Pos)))
#define NVMCTRL_TDATA0_MASK         0xFFFFFFFFu  /**< \brief (NVMCTRL_TDATA0) Register Bits Mask */

/* -------- NVMCTRL_TDATA1 : (NVMCTRL Offset: 0x4C) (R/W 32) Test Data 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TDATA:32;         /*!< bit:  0..31  NVM Test Data[63:32]               */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} NVMCTRL_TDATA1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define NVMCTRL_TDATA1_OFFSET       0x4C         /**< \brief (NVMCTRL_TDATA1 offset) Test Data 1 */
#define NVMCTRL_TDATA1_RESETVALUE   0x00000000   /**< \brief (NVMCTRL_TDATA1 reset_value) Test Data 1 */

#define NVMCTRL_TDATA1_TDATA_Pos    0            /**< \brief (NVMCTRL_TDATA1) NVM Test Data[63:32] */
#define NVMCTRL_TDATA1_TDATA_Msk    (0xFFFFFFFFu << NVMCTRL_TDATA1_TDATA_Pos)
#define NVMCTRL_TDATA1_TDATA(value) ((NVMCTRL_TDATA1_TDATA_Msk & ((value) << NVMCTRL_TDATA1_TDATA_Pos)))
#define NVMCTRL_TDATA1_MASK         0xFFFFFFFFu  /**< \brief (NVMCTRL_TDATA1) Register Bits Mask */

/* -------- NVMCTRL_TDATA2 : (NVMCTRL Offset: 0x50) (R/W 32) Test Data 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} NVMCTRL_TDATA2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define NVMCTRL_TDATA2_OFFSET       0x50         /**< \brief (NVMCTRL_TDATA2 offset) Test Data 2 */
#define NVMCTRL_TDATA2_RESETVALUE   0x00000000   /**< \brief (NVMCTRL_TDATA2 reset_value) Test Data 2 */
#define NVMCTRL_TDATA2_MASK         0xFFFFFFFFu  /**< \brief (NVMCTRL_TDATA2) Register Bits Mask */

/** \brief NVMCTRL APB hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  __IO NVMCTRL_CTRLA_Type        CTRLA;       /**< \brief Offset: 0x00 (R/W 16) Control A */
       RoReg8                    Reserved1[0x2];
  __IO NVMCTRL_CTRLB_Type        CTRLB;       /**< \brief Offset: 0x04 (R/W 32) Control B */
  __IO NVMCTRL_PARAM_Type        PARAM;       /**< \brief Offset: 0x08 (R/W 32) NVM Parameter */
  __IO NVMCTRL_INTENCLR_Type     INTENCLR;    /**< \brief Offset: 0x0C (R/W  8) Interrupt Enable Clear */
       RoReg8                    Reserved2[0x3];
  __IO NVMCTRL_INTENSET_Type     INTENSET;    /**< \brief Offset: 0x10 (R/W  8) Interrupt Enable Set */
       RoReg8                    Reserved3[0x3];
  __IO NVMCTRL_INTFLAG_Type      INTFLAG;     /**< \brief Offset: 0x14 (R/W  8) Interrupt Flag Status and Clear */
       RoReg8                    Reserved4[0x3];
  __IO NVMCTRL_STATUS_Type       STATUS;      /**< \brief Offset: 0x18 (R/W 16) Status */
       RoReg8                    Reserved5[0x2];
  __IO NVMCTRL_ADDR_Type         ADDR;        /**< \brief Offset: 0x1C (R/W 32) Address */
  __IO NVMCTRL_LOCK_Type         LOCK;        /**< \brief Offset: 0x20 (R/W 16) Lock Section */
       RoReg8                    Reserved6[0xE];
  __IO NVMCTRL_TMCTRL_Type       TMCTRL;      /**< \brief Offset: 0x30 (R/W 32) Test Mode Control */
  __IO NVMCTRL_TCTRLA_Type       TCTRLA;      /**< \brief Offset: 0x34 (R/W 32) Test Control A */
  __IO NVMCTRL_TCTRLB_Type       TCTRLB;      /**< \brief Offset: 0x38 (R/W 32) Test Control B */
  __IO NVMCTRL_TSTATUS_Type      TSTATUS;     /**< \brief Offset: 0x3C (R/W 32) Test Status */
  __IO NVMCTRL_TUSER_Type        TUSER;       /**< \brief Offset: 0x40 (R/W 32) Test User */
  __IO NVMCTRL_TADDR_Type        TADDR;       /**< \brief Offset: 0x44 (R/W 32) Test Address */
  __IO NVMCTRL_TDATA0_Type       TDATA0;      /**< \brief Offset: 0x48 (R/W 32) Test Data 0 */
  __IO NVMCTRL_TDATA1_Type       TDATA1;      /**< \brief Offset: 0x4C (R/W 32) Test Data 1 */
  __IO NVMCTRL_TDATA2_Type       TDATA2;      /**< \brief Offset: 0x50 (R/W 32) Test Data 2 */
} Nvmctrl;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

