zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#ifdef __GNUC__
 #define SECTION_NVMCTRL_CAL          __attribute__ ((section(".flash")))
 #define SECTION_NVMCTRL_LOCKBIT      __attribute__ ((section(".flash")))
 #define SECTION_NVMCTRL_OTP1         __attribute__ ((section(".flash")))
 #define SECTION_NVMCTRL_OTP2         __attribute__ ((section(".flash")))
 #define SECTION_NVMCTRL_OTP3         __attribute__ ((section(".flash")))
 #define SECTION_NVMCTRL_OTP4         __attribute__ ((section(".flash")))
 #define SECTION_NVMCTRL_OTP5         __attribute__ ((section(".flash")))
 #define SECTION_NVMCTRL_TEMP_LOG     __attribute__ ((section(".flash")))
 #define SECTION_NVMCTRL_USER         __attribute__ ((section(".flash")))
#endif

/*@}*/

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR OPAMP */
/* ========================================================================== */
/** \addtogroup U3005_OPAMP Operational Amplifier */
/*@{*/

#define OPAMP_U2237
#define REV_OPAMP                   0x100

/* -------- OPAMP_CTRLA : (OPAMP Offset: 0x00) (R/W  8) Control A -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  SWRST:1;          /*!< bit:      0  Software Reset                     */
    uint8_t  ENABLE:1;         /*!< bit:      1  Enable                             */
    uint8_t  :5;               /*!< bit:  2.. 6  Reserved                           */
    uint8_t  LPMUX:1;          /*!< bit:      7  Low-Power Mux                      */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} OPAMP_CTRLA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define OPAMP_CTRLA_OFFSET          0x00         /**< \brief (OPAMP_CTRLA offset) Control A */
#define OPAMP_CTRLA_RESETVALUE      0x00         /**< \brief (OPAMP_CTRLA reset_value) Control A */

#define OPAMP_CTRLA_SWRST_Pos       0            /**< \brief (OPAMP_CTRLA) Software Reset */
#define OPAMP_CTRLA_SWRST           (0x1u << OPAMP_CTRLA_SWRST_Pos)
#define OPAMP_CTRLA_ENABLE_Pos      1            /**< \brief (OPAMP_CTRLA) Enable */
#define OPAMP_CTRLA_ENABLE          (0x1u << OPAMP_CTRLA_ENABLE_Pos)
#define OPAMP_CTRLA_LPMUX_Pos       7            /**< \brief (OPAMP_CTRLA) Low-Power Mux */
#define OPAMP_CTRLA_LPMUX           (0x1u << OPAMP_CTRLA_LPMUX_Pos)
#define OPAMP_CTRLA_MASK            0x83u        /**< \brief (OPAMP_CTRLA) Register Bits Mask */

/* -------- OPAMP_STATUS : (OPAMP Offset: 0x02) (R/   8) Status -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  READY0:1;         /*!< bit:      0  OPAMP 0 Ready                      */
    uint8_t  READY1:1;         /*!< bit:      1  OPAMP 1 Ready                      */
    uint8_t  READY2:1;         /*!< bit:      2  OPAMP 2 Ready                      */
    uint8_t  :5;               /*!< bit:  3.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} OPAMP_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define OPAMP_STATUS_OFFSET         0x02         /**< \brief (OPAMP_STATUS offset) Status */
#define OPAMP_STATUS_RESETVALUE     0x00         /**< \brief (OPAMP_STATUS reset_value) Status */

#define OPAMP_STATUS_READY0_Pos     0            /**< \brief (OPAMP_STATUS) OPAMP 0 Ready */
#define OPAMP_STATUS_READY0         (0x1u << OPAMP_STATUS_READY0_Pos)
#define OPAMP_STATUS_READY1_Pos     1            /**< \brief (OPAMP_STATUS) OPAMP 1 Ready */
#define OPAMP_STATUS_READY1         (0x1u << OPAMP_STATUS_READY1_Pos)
#define OPAMP_STATUS_READY2_Pos     2            /**< \brief (OPAMP_STATUS) OPAMP 2 Ready */
#define OPAMP_STATUS_READY2         (0x1u << OPAMP_STATUS_READY2_Pos)
#define OPAMP_STATUS_MASK           0x07u        /**< \brief (OPAMP_STATUS) Register Bits Mask */

/* -------- OPAMP_OPAMPCTRL0 : (OPAMP Offset: 0x04) (R/W 32) OPAMP Control 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :1;               /*!< bit:      0  Reserved                           */
    uint32_t ENABLE:1;         /*!< bit:      1  Operational Amplifier Enable       */
    uint32_t ANAOUT:1;         /*!< bit:      2  Analog Output                      */
    uint32_t BIAS:2;           /*!< bit:  3.. 4  Bias Selection                     */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t RUNSTDBY:1;       /*!< bit:      6  Run in Standby                     */
    uint32_t ONDEMAND:1;       /*!< bit:      7  On Demand Control                  */
    uint32_t RES2OUT:1;        /*!< bit:      8  Resistor ladder To Output          */
    uint32_t RES2VCC:1;        /*!< bit:      9  Resistor ladder To VCC             */
    uint32_t RES1EN:1;         /*!< bit:     10  Resistor 1 Enable                  */
    uint32_t RES1MUX:2;        /*!< bit: 11..12  Resistor 1 Mux                     */
    uint32_t POTMUX:3;         /*!< bit: 13..15  Potentiometer Selection            */
    uint32_t MUXPOS:3;         /*!< bit: 16..18  Positive Input Mux Selection       */
    uint32_t :1;               /*!< bit:     19  Reserved                           */
    uint32_t MUXNEG:3;         /*!< bit: 20..22  Negative Input Mux Selection       */
    uint32_t :9;               /*!< bit: 23..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} OPAMP_OPAMPCTRL0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define OPAMP_OPAMPCTRL0_OFFSET     0x04         /**< \brief (OPAMP_OPAMPCTRL0 offset) OPAMP Control 0 */
#define OPAMP_OPAMPCTRL0_RESETVALUE 0x00000000   /**< \brief (OPAMP_OPAMPCTRL0 reset_value) OPAMP Control 0 */

#define OPAMP_OPAMPCTRL0_ENABLE_Pos 1            /**< \brief (OPAMP_OPAMPCTRL0) Operational Amplifier Enable */
#define OPAMP_OPAMPCTRL0_ENABLE     (0x1u << OPAMP_OPAMPCTRL0_ENABLE_Pos)
#define OPAMP_OPAMPCTRL0_ANAOUT_Pos 2            /**< \brief (OPAMP_OPAMPCTRL0) Analog Output */
#define OPAMP_OPAMPCTRL0_ANAOUT     (0x1u << OPAMP_OPAMPCTRL0_ANAOUT_Pos)
#define OPAMP_OPAMPCTRL0_BIAS_Pos   3            /**< \brief (OPAMP_OPAMPCTRL0) Bias Selection */
#define OPAMP_OPAMPCTRL0_BIAS_Msk   (0x3u << OPAMP_OPAMPCTRL0_BIAS_Pos)
#define OPAMP_OPAMPCTRL0_BIAS(value) ((OPAMP_OPAMPCTRL0_BIAS_Msk & ((value) << OPAMP_OPAMPCTRL0_BIAS_Pos)))
#define OPAMP_OPAMPCTRL0_RUNSTDBY_Pos 6            /**< \brief (OPAMP_OPAMPCTRL0) Run in Standby */
#define OPAMP_OPAMPCTRL0_RUNSTDBY   (0x1u << OPAMP_OPAMPCTRL0_RUNSTDBY_Pos)
#define OPAMP_OPAMPCTRL0_ONDEMAND_Pos 7            /**< \brief (OPAMP_OPAMPCTRL0) On Demand Control */
#define OPAMP_OPAMPCTRL0_ONDEMAND   (0x1u << OPAMP_OPAMPCTRL0_ONDEMAND_Pos)
#define OPAMP_OPAMPCTRL0_RES2OUT_Pos 8            /**< \brief (OPAMP_OPAMPCTRL0) Resistor ladder To Output */
#define OPAMP_OPAMPCTRL0_RES2OUT    (0x1u << OPAMP_OPAMPCTRL0_RES2OUT_Pos)
#define OPAMP_OPAMPCTRL0_RES2VCC_Pos 9            /**< \brief (OPAMP_OPAMPCTRL0) Resistor ladder To VCC */
#define OPAMP_OPAMPCTRL0_RES2VCC    (0x1u << OPAMP_OPAMPCTRL0_RES2VCC_Pos)
#define OPAMP_OPAMPCTRL0_RES1EN_Pos 10           /**< \brief (OPAMP_OPAMPCTRL0) Resistor 1 Enable */
#define OPAMP_OPAMPCTRL0_RES1EN     (0x1u << OPAMP_OPAMPCTRL0_RES1EN_Pos)
#define OPAMP_OPAMPCTRL0_RES1MUX_Pos 11           /**< \brief (OPAMP_OPAMPCTRL0) Resistor 1 Mux */
#define OPAMP_OPAMPCTRL0_RES1MUX_Msk (0x3u << OPAMP_OPAMPCTRL0_RES1MUX_Pos)
#define OPAMP_OPAMPCTRL0_RES1MUX(value) ((OPAMP_OPAMPCTRL0_RES1MUX_Msk & ((value) << OPAMP_OPAMPCTRL0_RES1MUX_Pos)))
#define OPAMP_OPAMPCTRL0_POTMUX_Pos 13           /**< \brief (OPAMP_OPAMPCTRL0) Potentiometer Selection */
#define OPAMP_OPAMPCTRL0_POTMUX_Msk (0x7u << OPAMP_OPAMPCTRL0_POTMUX_Pos)
#define OPAMP_OPAMPCTRL0_POTMUX(value) ((OPAMP_OPAMPCTRL0_POTMUX_Msk & ((value) << OPAMP_OPAMPCTRL0_POTMUX_Pos)))
#define OPAMP_OPAMPCTRL0_MUXPOS_Pos 16           /**< \brief (OPAMP_OPAMPCTRL0) Positive Input Mux Selection */
#define OPAMP_OPAMPCTRL0_MUXPOS_Msk (0x7u << OPAMP_OPAMPCTRL0_MUXPOS_Pos)
#define OPAMP_OPAMPCTRL0_MUXPOS(value) ((OPAMP_OPAMPCTRL0_MUXPOS_Msk & ((value) << OPAMP_OPAMPCTRL0_MUXPOS_Pos)))
#define OPAMP_OPAMPCTRL0_MUXNEG_Pos 20           /**< \brief (OPAMP_OPAMPCTRL0) Negative Input Mux Selection */
#define OPAMP_OPAMPCTRL0_MUXNEG_Msk (0x7u << OPAMP_OPAMPCTRL0_MUXNEG_Pos)
#define OPAMP_OPAMPCTRL0_MUXNEG(value) ((OPAMP_OPAMPCTRL0_MUXNEG_Msk & ((value) << OPAMP_OPAMPCTRL0_MUXNEG_Pos)))
#define OPAMP_OPAMPCTRL0_MASK       0x0077FFDEu  /**< \brief (OPAMP_OPAMPCTRL0) Register Bits Mask */

