zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
/* -------- OPAMP_OPAMPCTRL1 : (OPAMP Offset: 0x08) (R/W 32) OPAMP Control 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :1;               /*!< bit:      0  Reserved                           */
    uint32_t ENABLE:1;         /*!< bit:      1  Operational Amplifier Enable       */
    uint32_t ANAOUT:1;         /*!< bit:      2  Analog Output                      */
    uint32_t BIAS:2;           /*!< bit:  3.. 4  Bias Selection                     */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t RUNSTDBY:1;       /*!< bit:      6  Run in Standby                     */
    uint32_t ONDEMAND:1;       /*!< bit:      7  On Demand Control                  */
    uint32_t RES2OUT:1;        /*!< bit:      8  Resistor ladder To Output          */
    uint32_t RES2VCC:1;        /*!< bit:      9  Resistor ladder To VCC             */
    uint32_t RES1EN:1;         /*!< bit:     10  Resistor 1 Enable                  */
    uint32_t RES1MUX:2;        /*!< bit: 11..12  Resistor 1 Mux                     */
    uint32_t POTMUX:3;         /*!< bit: 13..15  Potentiometer Selection            */
    uint32_t MUXPOS:3;         /*!< bit: 16..18  Positive Input Mux Selection       */
    uint32_t :1;               /*!< bit:     19  Reserved                           */
    uint32_t MUXNEG:3;         /*!< bit: 20..22  Negative Input Mux Selection       */
    uint32_t :9;               /*!< bit: 23..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} OPAMP_OPAMPCTRL1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define OPAMP_OPAMPCTRL1_OFFSET     0x08         /**< \brief (OPAMP_OPAMPCTRL1 offset) OPAMP Control 1 */
#define OPAMP_OPAMPCTRL1_RESETVALUE 0x00000000   /**< \brief (OPAMP_OPAMPCTRL1 reset_value) OPAMP Control 1 */

#define OPAMP_OPAMPCTRL1_ENABLE_Pos 1            /**< \brief (OPAMP_OPAMPCTRL1) Operational Amplifier Enable */
#define OPAMP_OPAMPCTRL1_ENABLE     (0x1u << OPAMP_OPAMPCTRL1_ENABLE_Pos)
#define OPAMP_OPAMPCTRL1_ANAOUT_Pos 2            /**< \brief (OPAMP_OPAMPCTRL1) Analog Output */
#define OPAMP_OPAMPCTRL1_ANAOUT     (0x1u << OPAMP_OPAMPCTRL1_ANAOUT_Pos)
#define OPAMP_OPAMPCTRL1_BIAS_Pos   3            /**< \brief (OPAMP_OPAMPCTRL1) Bias Selection */
#define OPAMP_OPAMPCTRL1_BIAS_Msk   (0x3u << OPAMP_OPAMPCTRL1_BIAS_Pos)
#define OPAMP_OPAMPCTRL1_BIAS(value) ((OPAMP_OPAMPCTRL1_BIAS_Msk & ((value) << OPAMP_OPAMPCTRL1_BIAS_Pos)))
#define OPAMP_OPAMPCTRL1_RUNSTDBY_Pos 6            /**< \brief (OPAMP_OPAMPCTRL1) Run in Standby */
#define OPAMP_OPAMPCTRL1_RUNSTDBY   (0x1u << OPAMP_OPAMPCTRL1_RUNSTDBY_Pos)
#define OPAMP_OPAMPCTRL1_ONDEMAND_Pos 7            /**< \brief (OPAMP_OPAMPCTRL1) On Demand Control */
#define OPAMP_OPAMPCTRL1_ONDEMAND   (0x1u << OPAMP_OPAMPCTRL1_ONDEMAND_Pos)
#define OPAMP_OPAMPCTRL1_RES2OUT_Pos 8            /**< \brief (OPAMP_OPAMPCTRL1) Resistor ladder To Output */
#define OPAMP_OPAMPCTRL1_RES2OUT    (0x1u << OPAMP_OPAMPCTRL1_RES2OUT_Pos)
#define OPAMP_OPAMPCTRL1_RES2VCC_Pos 9            /**< \brief (OPAMP_OPAMPCTRL1) Resistor ladder To VCC */
#define OPAMP_OPAMPCTRL1_RES2VCC    (0x1u << OPAMP_OPAMPCTRL1_RES2VCC_Pos)
#define OPAMP_OPAMPCTRL1_RES1EN_Pos 10           /**< \brief (OPAMP_OPAMPCTRL1) Resistor 1 Enable */
#define OPAMP_OPAMPCTRL1_RES1EN     (0x1u << OPAMP_OPAMPCTRL1_RES1EN_Pos)
#define OPAMP_OPAMPCTRL1_RES1MUX_Pos 11           /**< \brief (OPAMP_OPAMPCTRL1) Resistor 1 Mux */
#define OPAMP_OPAMPCTRL1_RES1MUX_Msk (0x3u << OPAMP_OPAMPCTRL1_RES1MUX_Pos)
#define OPAMP_OPAMPCTRL1_RES1MUX(value) ((OPAMP_OPAMPCTRL1_RES1MUX_Msk & ((value) << OPAMP_OPAMPCTRL1_RES1MUX_Pos)))
#define OPAMP_OPAMPCTRL1_POTMUX_Pos 13           /**< \brief (OPAMP_OPAMPCTRL1) Potentiometer Selection */
#define OPAMP_OPAMPCTRL1_POTMUX_Msk (0x7u << OPAMP_OPAMPCTRL1_POTMUX_Pos)
#define OPAMP_OPAMPCTRL1_POTMUX(value) ((OPAMP_OPAMPCTRL1_POTMUX_Msk & ((value) << OPAMP_OPAMPCTRL1_POTMUX_Pos)))
#define OPAMP_OPAMPCTRL1_MUXPOS_Pos 16           /**< \brief (OPAMP_OPAMPCTRL1) Positive Input Mux Selection */
#define OPAMP_OPAMPCTRL1_MUXPOS_Msk (0x7u << OPAMP_OPAMPCTRL1_MUXPOS_Pos)
#define OPAMP_OPAMPCTRL1_MUXPOS(value) ((OPAMP_OPAMPCTRL1_MUXPOS_Msk & ((value) << OPAMP_OPAMPCTRL1_MUXPOS_Pos)))
#define OPAMP_OPAMPCTRL1_MUXNEG_Pos 20           /**< \brief (OPAMP_OPAMPCTRL1) Negative Input Mux Selection */
#define OPAMP_OPAMPCTRL1_MUXNEG_Msk (0x7u << OPAMP_OPAMPCTRL1_MUXNEG_Pos)
#define OPAMP_OPAMPCTRL1_MUXNEG(value) ((OPAMP_OPAMPCTRL1_MUXNEG_Msk & ((value) << OPAMP_OPAMPCTRL1_MUXNEG_Pos)))
#define OPAMP_OPAMPCTRL1_MASK       0x0077FFDEu  /**< \brief (OPAMP_OPAMPCTRL1) Register Bits Mask */

/* -------- OPAMP_OPAMPCTRL2 : (OPAMP Offset: 0x0C) (R/W 32) OPAMP Control 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :1;               /*!< bit:      0  Reserved                           */
    uint32_t ENABLE:1;         /*!< bit:      1  Operational Amplifier Enable       */
    uint32_t ANAOUT:1;         /*!< bit:      2  Analog Output                      */
    uint32_t BIAS:2;           /*!< bit:  3.. 4  Bias Selection                     */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t RUNSTDBY:1;       /*!< bit:      6  Run in Standby                     */
    uint32_t ONDEMAND:1;       /*!< bit:      7  On Demand Control                  */
    uint32_t RES2OUT:1;        /*!< bit:      8  Resistor ladder To Output          */
    uint32_t RES2VCC:1;        /*!< bit:      9  Resistor ladder To VCC             */
    uint32_t RES1EN:1;         /*!< bit:     10  Resistor 1 Enable                  */
    uint32_t RES1MUX:2;        /*!< bit: 11..12  Resistor 1 Mux                     */
    uint32_t POTMUX:3;         /*!< bit: 13..15  Potentiometer Selection            */
    uint32_t MUXPOS:3;         /*!< bit: 16..18  Positive Input Mux Selection       */
    uint32_t :1;               /*!< bit:     19  Reserved                           */
    uint32_t MUXNEG:3;         /*!< bit: 20..22  Negative Input Mux Selection       */
    uint32_t :9;               /*!< bit: 23..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} OPAMP_OPAMPCTRL2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define OPAMP_OPAMPCTRL2_OFFSET     0x0C         /**< \brief (OPAMP_OPAMPCTRL2 offset) OPAMP Control 2 */
#define OPAMP_OPAMPCTRL2_RESETVALUE 0x00000000   /**< \brief (OPAMP_OPAMPCTRL2 reset_value) OPAMP Control 2 */

