zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define OPAMP_OPAMPCTRL2_ENABLE_Pos 1            /**< \brief (OPAMP_OPAMPCTRL2) Operational Amplifier Enable */
#define OPAMP_OPAMPCTRL2_ENABLE     (0x1u << OPAMP_OPAMPCTRL2_ENABLE_Pos)
#define OPAMP_OPAMPCTRL2_ANAOUT_Pos 2            /**< \brief (OPAMP_OPAMPCTRL2) Analog Output */
#define OPAMP_OPAMPCTRL2_ANAOUT     (0x1u << OPAMP_OPAMPCTRL2_ANAOUT_Pos)
#define OPAMP_OPAMPCTRL2_BIAS_Pos   3            /**< \brief (OPAMP_OPAMPCTRL2) Bias Selection */
#define OPAMP_OPAMPCTRL2_BIAS_Msk   (0x3u << OPAMP_OPAMPCTRL2_BIAS_Pos)
#define OPAMP_OPAMPCTRL2_BIAS(value) ((OPAMP_OPAMPCTRL2_BIAS_Msk & ((value) << OPAMP_OPAMPCTRL2_BIAS_Pos)))
#define OPAMP_OPAMPCTRL2_RUNSTDBY_Pos 6            /**< \brief (OPAMP_OPAMPCTRL2) Run in Standby */
#define OPAMP_OPAMPCTRL2_RUNSTDBY   (0x1u << OPAMP_OPAMPCTRL2_RUNSTDBY_Pos)
#define OPAMP_OPAMPCTRL2_ONDEMAND_Pos 7            /**< \brief (OPAMP_OPAMPCTRL2) On Demand Control */
#define OPAMP_OPAMPCTRL2_ONDEMAND   (0x1u << OPAMP_OPAMPCTRL2_ONDEMAND_Pos)
#define OPAMP_OPAMPCTRL2_RES2OUT_Pos 8            /**< \brief (OPAMP_OPAMPCTRL2) Resistor ladder To Output */
#define OPAMP_OPAMPCTRL2_RES2OUT    (0x1u << OPAMP_OPAMPCTRL2_RES2OUT_Pos)
#define OPAMP_OPAMPCTRL2_RES2VCC_Pos 9            /**< \brief (OPAMP_OPAMPCTRL2) Resistor ladder To VCC */
#define OPAMP_OPAMPCTRL2_RES2VCC    (0x1u << OPAMP_OPAMPCTRL2_RES2VCC_Pos)
#define OPAMP_OPAMPCTRL2_RES1EN_Pos 10           /**< \brief (OPAMP_OPAMPCTRL2) Resistor 1 Enable */
#define OPAMP_OPAMPCTRL2_RES1EN     (0x1u << OPAMP_OPAMPCTRL2_RES1EN_Pos)
#define OPAMP_OPAMPCTRL2_RES1MUX_Pos 11           /**< \brief (OPAMP_OPAMPCTRL2) Resistor 1 Mux */
#define OPAMP_OPAMPCTRL2_RES1MUX_Msk (0x3u << OPAMP_OPAMPCTRL2_RES1MUX_Pos)
#define OPAMP_OPAMPCTRL2_RES1MUX(value) ((OPAMP_OPAMPCTRL2_RES1MUX_Msk & ((value) << OPAMP_OPAMPCTRL2_RES1MUX_Pos)))
#define OPAMP_OPAMPCTRL2_POTMUX_Pos 13           /**< \brief (OPAMP_OPAMPCTRL2) Potentiometer Selection */
#define OPAMP_OPAMPCTRL2_POTMUX_Msk (0x7u << OPAMP_OPAMPCTRL2_POTMUX_Pos)
#define OPAMP_OPAMPCTRL2_POTMUX(value) ((OPAMP_OPAMPCTRL2_POTMUX_Msk & ((value) << OPAMP_OPAMPCTRL2_POTMUX_Pos)))
#define OPAMP_OPAMPCTRL2_MUXPOS_Pos 16           /**< \brief (OPAMP_OPAMPCTRL2) Positive Input Mux Selection */
#define OPAMP_OPAMPCTRL2_MUXPOS_Msk (0x7u << OPAMP_OPAMPCTRL2_MUXPOS_Pos)
#define OPAMP_OPAMPCTRL2_MUXPOS(value) ((OPAMP_OPAMPCTRL2_MUXPOS_Msk & ((value) << OPAMP_OPAMPCTRL2_MUXPOS_Pos)))
#define OPAMP_OPAMPCTRL2_MUXNEG_Pos 20           /**< \brief (OPAMP_OPAMPCTRL2) Negative Input Mux Selection */
#define OPAMP_OPAMPCTRL2_MUXNEG_Msk (0x7u << OPAMP_OPAMPCTRL2_MUXNEG_Pos)
#define OPAMP_OPAMPCTRL2_MUXNEG(value) ((OPAMP_OPAMPCTRL2_MUXNEG_Msk & ((value) << OPAMP_OPAMPCTRL2_MUXNEG_Pos)))
#define OPAMP_OPAMPCTRL2_MASK       0x0077FFDEu  /**< \brief (OPAMP_OPAMPCTRL2) Register Bits Mask */

/* -------- OPAMP_TEST : (OPAMP Offset: 0x10) (R/W  8) Test Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  TPOT0:1;          /*!< bit:      0  Test Potentiometer Selection Output (OA0POT) for OPAMP0 */
    uint8_t  TPOT1:1;          /*!< bit:      1  Test Potentiometer Selection Output (OA1POT) for OPAMP1 */
    uint8_t  TPOT2:1;          /*!< bit:      2  Test Potentiometer Selection Output (OA2POT) for OPAMP2 */
    uint8_t  TVDOUT:1;         /*!< bit:      3  Test Voltage Doubler Output Enable */
    uint8_t  TRDYOUT:1;        /*!< bit:      4  Enables OPAMP Ready output for all OPAMPs */
    uint8_t  TENOUT:1;         /*!< bit:      5  Enables OPAMP Enable output for all OPAMPs */
    uint8_t  :2;               /*!< bit:  6.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} OPAMP_TEST_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define OPAMP_TEST_OFFSET           0x10         /**< \brief (OPAMP_TEST offset) Test Control */
#define OPAMP_TEST_RESETVALUE       0x00         /**< \brief (OPAMP_TEST reset_value) Test Control */

#define OPAMP_TEST_TPOT0_Pos        0            /**< \brief (OPAMP_TEST) Test Potentiometer Selection Output (OA0POT) for OPAMP0 */
#define OPAMP_TEST_TPOT0            (0x1u << OPAMP_TEST_TPOT0_Pos)
#define OPAMP_TEST_TPOT1_Pos        1            /**< \brief (OPAMP_TEST) Test Potentiometer Selection Output (OA1POT) for OPAMP1 */
#define OPAMP_TEST_TPOT1            (0x1u << OPAMP_TEST_TPOT1_Pos)
#define OPAMP_TEST_TPOT2_Pos        2            /**< \brief (OPAMP_TEST) Test Potentiometer Selection Output (OA2POT) for OPAMP2 */
#define OPAMP_TEST_TPOT2            (0x1u << OPAMP_TEST_TPOT2_Pos)
#define OPAMP_TEST_TVDOUT_Pos       3            /**< \brief (OPAMP_TEST) Test Voltage Doubler Output Enable */
#define OPAMP_TEST_TVDOUT           (0x1u << OPAMP_TEST_TVDOUT_Pos)
#define OPAMP_TEST_TRDYOUT_Pos      4            /**< \brief (OPAMP_TEST) Enables OPAMP Ready output for all OPAMPs */
#define OPAMP_TEST_TRDYOUT          (0x1u << OPAMP_TEST_TRDYOUT_Pos)
#define OPAMP_TEST_TENOUT_Pos       5            /**< \brief (OPAMP_TEST) Enables OPAMP Enable output for all OPAMPs */
#define OPAMP_TEST_TENOUT           (0x1u << OPAMP_TEST_TENOUT_Pos)
#define OPAMP_TEST_MASK             0x3Fu        /**< \brief (OPAMP_TEST) Register Bits Mask */

/** \brief OPAMP hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  __IO OPAMP_CTRLA_Type          CTRLA;       /**< \brief Offset: 0x00 (R/W  8) Control A */
       RoReg8                    Reserved1[0x1];
  __I  OPAMP_STATUS_Type         STATUS;      /**< \brief Offset: 0x02 (R/   8) Status */
       RoReg8                    Reserved2[0x1];
  __IO OPAMP_OPAMPCTRL0_Type     OPAMPCTRL0;  /**< \brief Offset: 0x04 (R/W 32) OPAMP Control 0 */
  __IO OPAMP_OPAMPCTRL1_Type     OPAMPCTRL1;  /**< \brief Offset: 0x08 (R/W 32) OPAMP Control 1 */
  __IO OPAMP_OPAMPCTRL2_Type     OPAMPCTRL2;  /**< \brief Offset: 0x0C (R/W 32) OPAMP Control 2 */
  __IO OPAMP_TEST_Type           TEST;        /**< \brief Offset: 0x10 (R/W  8) Test Control */
} Opamp;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR OSCCTRL */
/* ========================================================================== */
/** \addtogroup U3005_OSCCTRL Oscillators Control */
/*@{*/

#define OSCCTRL_U2119
#define REV_OSCCTRL                 0x100

/* -------- OSCCTRL_INTENCLR : (OSCCTRL Offset: 0x00) (R/W 32) Interrupt Enable Clear -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t XOSCRDY:1;        /*!< bit:      0  XOSC Ready Interrupt Enable        */
    uint32_t :3;               /*!< bit:  1.. 3  Reserved                           */
    uint32_t OSC16MRDY:1;      /*!< bit:      4  OSC16M Ready Interrupt Enable      */
    uint32_t :3;               /*!< bit:  5.. 7  Reserved                           */
    uint32_t DFLLRDY:1;        /*!< bit:      8  DFLL Ready Interrupt Enable        */
    uint32_t DFLLOOB:1;        /*!< bit:      9  DFLL Out Of Bounds Interrupt Enable */
    uint32_t DFLLLCKF:1;       /*!< bit:     10  DFLL Lock Fine Interrupt Enable    */
    uint32_t DFLLLCKC:1;       /*!< bit:     11  DFLL Lock Coarse Interrupt Enable  */
    uint32_t DFLLRCS:1;        /*!< bit:     12  DFLL Reference Clock Stopped Interrupt Enable */
    uint32_t :3;               /*!< bit: 13..15  Reserved                           */
    uint32_t DPLLLCKR:1;       /*!< bit:     16  DPLL Lock Rise Interrupt Enable    */
    uint32_t DPLLLCKF:1;       /*!< bit:     17  DPLL Lock Fall Interrupt Enable    */
    uint32_t DPLLLTO:1;        /*!< bit:     18  DPLL Time Out Interrupt Enable     */
    uint32_t DPLLLDRTO:1;      /*!< bit:     19  DPLL Ratio Ready Interrupt Enable  */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} OSCCTRL_INTENCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define OSCCTRL_INTENCLR_OFFSET     0x00         /**< \brief (OSCCTRL_INTENCLR offset) Interrupt Enable Clear */
#define OSCCTRL_INTENCLR_RESETVALUE 0x00000000   /**< \brief (OSCCTRL_INTENCLR reset_value) Interrupt Enable Clear */

