zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
/* -------- OSCCTRL_DPLLSYNCBUSY : (OSCCTRL Offset: 0x38) (R/   8) DPLL Synchronization Busy -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  :1;               /*!< bit:      0  Reserved                           */
    uint8_t  ENABLE:1;         /*!< bit:      1  DPLL Enable Synchronization Status */
    uint8_t  DPLLRATIO:1;      /*!< bit:      2  DPLL Ratio Synchronization Status  */
    uint8_t  DPLLPRESC:1;      /*!< bit:      3  DPLL Prescaler Synchronization Status */
    uint8_t  :4;               /*!< bit:  4.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} OSCCTRL_DPLLSYNCBUSY_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define OSCCTRL_DPLLSYNCBUSY_OFFSET 0x38         /**< \brief (OSCCTRL_DPLLSYNCBUSY offset) DPLL Synchronization Busy */
#define OSCCTRL_DPLLSYNCBUSY_RESETVALUE 0x00         /**< \brief (OSCCTRL_DPLLSYNCBUSY reset_value) DPLL Synchronization Busy */

#define OSCCTRL_DPLLSYNCBUSY_ENABLE_Pos 1            /**< \brief (OSCCTRL_DPLLSYNCBUSY) DPLL Enable Synchronization Status */
#define OSCCTRL_DPLLSYNCBUSY_ENABLE (0x1u << OSCCTRL_DPLLSYNCBUSY_ENABLE_Pos)
#define OSCCTRL_DPLLSYNCBUSY_DPLLRATIO_Pos 2            /**< \brief (OSCCTRL_DPLLSYNCBUSY) DPLL Ratio Synchronization Status */
#define OSCCTRL_DPLLSYNCBUSY_DPLLRATIO (0x1u << OSCCTRL_DPLLSYNCBUSY_DPLLRATIO_Pos)
#define OSCCTRL_DPLLSYNCBUSY_DPLLPRESC_Pos 3            /**< \brief (OSCCTRL_DPLLSYNCBUSY) DPLL Prescaler Synchronization Status */
#define OSCCTRL_DPLLSYNCBUSY_DPLLPRESC (0x1u << OSCCTRL_DPLLSYNCBUSY_DPLLPRESC_Pos)
#define OSCCTRL_DPLLSYNCBUSY_MASK   0x0Eu        /**< \brief (OSCCTRL_DPLLSYNCBUSY) Register Bits Mask */

/* -------- OSCCTRL_DPLLSTATUS : (OSCCTRL Offset: 0x3C) (R/   8) DPLL Status -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  LOCK:1;           /*!< bit:      0  DPLL Lock Status                   */
    uint8_t  CLKRDY:1;         /*!< bit:      1  DPLL Clock Ready                   */
    uint8_t  :6;               /*!< bit:  2.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} OSCCTRL_DPLLSTATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define OSCCTRL_DPLLSTATUS_OFFSET   0x3C         /**< \brief (OSCCTRL_DPLLSTATUS offset) DPLL Status */
#define OSCCTRL_DPLLSTATUS_RESETVALUE 0x00         /**< \brief (OSCCTRL_DPLLSTATUS reset_value) DPLL Status */

#define OSCCTRL_DPLLSTATUS_LOCK_Pos 0            /**< \brief (OSCCTRL_DPLLSTATUS) DPLL Lock Status */
#define OSCCTRL_DPLLSTATUS_LOCK     (0x1u << OSCCTRL_DPLLSTATUS_LOCK_Pos)
#define OSCCTRL_DPLLSTATUS_CLKRDY_Pos 1            /**< \brief (OSCCTRL_DPLLSTATUS) DPLL Clock Ready */
#define OSCCTRL_DPLLSTATUS_CLKRDY   (0x1u << OSCCTRL_DPLLSTATUS_CLKRDY_Pos)
#define OSCCTRL_DPLLSTATUS_MASK     0x03u        /**< \brief (OSCCTRL_DPLLSTATUS) Register Bits Mask */

/* -------- OSCCTRL_DPLLTEST : (OSCCTRL Offset: 0x40) (R/W 32) DPLL Test -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t MODE:2;           /*!< bit:  0.. 1  DPLL Test Mode                     */
    uint32_t CKDIV:2;          /*!< bit:  2.. 3  Clock Output Divider               */
    uint32_t ITEST:3;          /*!< bit:  4.. 6  Test Mode Selection                */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t OTEST:10;         /*!< bit:  8..17  TDC Outputs                        */
    uint32_t :14;              /*!< bit: 18..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} OSCCTRL_DPLLTEST_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define OSCCTRL_DPLLTEST_OFFSET     0x40         /**< \brief (OSCCTRL_DPLLTEST offset) DPLL Test */
#define OSCCTRL_DPLLTEST_RESETVALUE 0x00000000   /**< \brief (OSCCTRL_DPLLTEST reset_value) DPLL Test */

#define OSCCTRL_DPLLTEST_MODE_Pos   0            /**< \brief (OSCCTRL_DPLLTEST) DPLL Test Mode */
#define OSCCTRL_DPLLTEST_MODE_Msk   (0x3u << OSCCTRL_DPLLTEST_MODE_Pos)
#define OSCCTRL_DPLLTEST_MODE(value) ((OSCCTRL_DPLLTEST_MODE_Msk & ((value) << OSCCTRL_DPLLTEST_MODE_Pos)))
#define   OSCCTRL_DPLLTEST_MODE_DEFAULT_Val 0x0u   /**< \brief (OSCCTRL_DPLLTEST) Functional mode */
#define   OSCCTRL_DPLLTEST_MODE_OBS_Val   0x1u   /**< \brief (OSCCTRL_DPLLTEST) Observability test mode */
#define   OSCCTRL_DPLLTEST_MODE_FULL_Val  0x2u   /**< \brief (OSCCTRL_DPLLTEST) Full test mode */
#define OSCCTRL_DPLLTEST_MODE_DEFAULT (OSCCTRL_DPLLTEST_MODE_DEFAULT_Val << OSCCTRL_DPLLTEST_MODE_Pos)
#define OSCCTRL_DPLLTEST_MODE_OBS   (OSCCTRL_DPLLTEST_MODE_OBS_Val << OSCCTRL_DPLLTEST_MODE_Pos)
#define OSCCTRL_DPLLTEST_MODE_FULL  (OSCCTRL_DPLLTEST_MODE_FULL_Val << OSCCTRL_DPLLTEST_MODE_Pos)
#define OSCCTRL_DPLLTEST_CKDIV_Pos  2            /**< \brief (OSCCTRL_DPLLTEST) Clock Output Divider */
#define OSCCTRL_DPLLTEST_CKDIV_Msk  (0x3u << OSCCTRL_DPLLTEST_CKDIV_Pos)
#define OSCCTRL_DPLLTEST_CKDIV(value) ((OSCCTRL_DPLLTEST_CKDIV_Msk & ((value) << OSCCTRL_DPLLTEST_CKDIV_Pos)))
#define   OSCCTRL_DPLLTEST_CKDIV_DIV8_Val 0x0u   /**< \brief (OSCCTRL_DPLLTEST) Output clock divided by 8 */
#define   OSCCTRL_DPLLTEST_CKDIV_DIV4_Val 0x1u   /**< \brief (OSCCTRL_DPLLTEST) Output clock divided by 4 */
#define   OSCCTRL_DPLLTEST_CKDIV_DIV2_Val 0x2u   /**< \brief (OSCCTRL_DPLLTEST) Output clock divided by 2 */
#define   OSCCTRL_DPLLTEST_CKDIV_DIV1_Val 0x3u   /**< \brief (OSCCTRL_DPLLTEST) Output clock divided by 1 */
#define OSCCTRL_DPLLTEST_CKDIV_DIV8 (OSCCTRL_DPLLTEST_CKDIV_DIV8_Val << OSCCTRL_DPLLTEST_CKDIV_Pos)
#define OSCCTRL_DPLLTEST_CKDIV_DIV4 (OSCCTRL_DPLLTEST_CKDIV_DIV4_Val << OSCCTRL_DPLLTEST_CKDIV_Pos)
#define OSCCTRL_DPLLTEST_CKDIV_DIV2 (OSCCTRL_DPLLTEST_CKDIV_DIV2_Val << OSCCTRL_DPLLTEST_CKDIV_Pos)
#define OSCCTRL_DPLLTEST_CKDIV_DIV1 (OSCCTRL_DPLLTEST_CKDIV_DIV1_Val << OSCCTRL_DPLLTEST_CKDIV_Pos)
#define OSCCTRL_DPLLTEST_ITEST_Pos  4            /**< \brief (OSCCTRL_DPLLTEST) Test Mode Selection */
#define OSCCTRL_DPLLTEST_ITEST_Msk  (0x7u << OSCCTRL_DPLLTEST_ITEST_Pos)
#define OSCCTRL_DPLLTEST_ITEST(value) ((OSCCTRL_DPLLTEST_ITEST_Msk & ((value) << OSCCTRL_DPLLTEST_ITEST_Pos)))
#define OSCCTRL_DPLLTEST_OTEST_Pos  8            /**< \brief (OSCCTRL_DPLLTEST) TDC Outputs */
#define OSCCTRL_DPLLTEST_OTEST_Msk  (0x3FFu << OSCCTRL_DPLLTEST_OTEST_Pos)
#define OSCCTRL_DPLLTEST_OTEST(value) ((OSCCTRL_DPLLTEST_OTEST_Msk & ((value) << OSCCTRL_DPLLTEST_OTEST_Pos)))
#define OSCCTRL_DPLLTEST_MASK       0x0003FF7Fu  /**< \brief (OSCCTRL_DPLLTEST) Register Bits Mask */

/* -------- OSCCTRL_CAL4M : (OSCCTRL Offset: 0x44) (R/W 16) 4MHz Oscillator Calibration -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t TCAL:6;           /*!< bit:  0.. 5  Temperature Calibration (4MHz)     */
    uint16_t :2;               /*!< bit:  6.. 7  Reserved                           */
    uint16_t FCAL:6;           /*!< bit:  8..13  Frequency Calibration (4MHz)       */
    uint16_t :2;               /*!< bit: 14..15  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} OSCCTRL_CAL4M_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define OSCCTRL_CAL4M_OFFSET        0x44         /**< \brief (OSCCTRL_CAL4M offset) 4MHz Oscillator Calibration */

#define OSCCTRL_CAL4M_TCAL_Pos      0            /**< \brief (OSCCTRL_CAL4M) Temperature Calibration (4MHz) */
#define OSCCTRL_CAL4M_TCAL_Msk      (0x3Fu << OSCCTRL_CAL4M_TCAL_Pos)
#define OSCCTRL_CAL4M_TCAL(value)   ((OSCCTRL_CAL4M_TCAL_Msk & ((value) << OSCCTRL_CAL4M_TCAL_Pos)))
#define OSCCTRL_CAL4M_FCAL_Pos      8            /**< \brief (OSCCTRL_CAL4M) Frequency Calibration (4MHz) */
#define OSCCTRL_CAL4M_FCAL_Msk      (0x3Fu << OSCCTRL_CAL4M_FCAL_Pos)
#define OSCCTRL_CAL4M_FCAL(value)   ((OSCCTRL_CAL4M_FCAL_Msk & ((value) << OSCCTRL_CAL4M_FCAL_Pos)))
#define OSCCTRL_CAL4M_MASK          0x3F3Fu      /**< \brief (OSCCTRL_CAL4M) Register Bits Mask */

/* -------- OSCCTRL_CAL8M : (OSCCTRL Offset: 0x48) (R/W 16) 8MHz Oscillator Calibration -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t TCAL:6;           /*!< bit:  0.. 5  Temperature Calibration (8MHz)     */
    uint16_t :2;               /*!< bit:  6.. 7  Reserved                           */
    uint16_t FCAL:6;           /*!< bit:  8..13  Frequency Calibration (8MHz)       */
    uint16_t :2;               /*!< bit: 14..15  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} OSCCTRL_CAL8M_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

