zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define OSCCTRL_CAL8M_OFFSET        0x48         /**< \brief (OSCCTRL_CAL8M offset) 8MHz Oscillator Calibration */

#define OSCCTRL_CAL8M_TCAL_Pos      0            /**< \brief (OSCCTRL_CAL8M) Temperature Calibration (8MHz) */
#define OSCCTRL_CAL8M_TCAL_Msk      (0x3Fu << OSCCTRL_CAL8M_TCAL_Pos)
#define OSCCTRL_CAL8M_TCAL(value)   ((OSCCTRL_CAL8M_TCAL_Msk & ((value) << OSCCTRL_CAL8M_TCAL_Pos)))
#define OSCCTRL_CAL8M_FCAL_Pos      8            /**< \brief (OSCCTRL_CAL8M) Frequency Calibration (8MHz) */
#define OSCCTRL_CAL8M_FCAL_Msk      (0x3Fu << OSCCTRL_CAL8M_FCAL_Pos)
#define OSCCTRL_CAL8M_FCAL(value)   ((OSCCTRL_CAL8M_FCAL_Msk & ((value) << OSCCTRL_CAL8M_FCAL_Pos)))
#define OSCCTRL_CAL8M_MASK          0x3F3Fu      /**< \brief (OSCCTRL_CAL8M) Register Bits Mask */

/* -------- OSCCTRL_CAL12M : (OSCCTRL Offset: 0x4C) (R/W 16) 12MHz Oscillator Calibration -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t TCAL:6;           /*!< bit:  0.. 5  Temperature Calibration (12MHz)    */
    uint16_t :2;               /*!< bit:  6.. 7  Reserved                           */
    uint16_t FCAL:6;           /*!< bit:  8..13  Frequency Calibration (12MHz)      */
    uint16_t :2;               /*!< bit: 14..15  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} OSCCTRL_CAL12M_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define OSCCTRL_CAL12M_OFFSET       0x4C         /**< \brief (OSCCTRL_CAL12M offset) 12MHz Oscillator Calibration */

#define OSCCTRL_CAL12M_TCAL_Pos     0            /**< \brief (OSCCTRL_CAL12M) Temperature Calibration (12MHz) */
#define OSCCTRL_CAL12M_TCAL_Msk     (0x3Fu << OSCCTRL_CAL12M_TCAL_Pos)
#define OSCCTRL_CAL12M_TCAL(value)  ((OSCCTRL_CAL12M_TCAL_Msk & ((value) << OSCCTRL_CAL12M_TCAL_Pos)))
#define OSCCTRL_CAL12M_FCAL_Pos     8            /**< \brief (OSCCTRL_CAL12M) Frequency Calibration (12MHz) */
#define OSCCTRL_CAL12M_FCAL_Msk     (0x3Fu << OSCCTRL_CAL12M_FCAL_Pos)
#define OSCCTRL_CAL12M_FCAL(value)  ((OSCCTRL_CAL12M_FCAL_Msk & ((value) << OSCCTRL_CAL12M_FCAL_Pos)))
#define OSCCTRL_CAL12M_MASK         0x3F3Fu      /**< \brief (OSCCTRL_CAL12M) Register Bits Mask */

/* -------- OSCCTRL_CAL16M : (OSCCTRL Offset: 0x50) (R/W 16) 16MHz Oscillator Calibration -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t TCAL:6;           /*!< bit:  0.. 5  Temperature Calibration (16MHz)    */
    uint16_t :2;               /*!< bit:  6.. 7  Reserved                           */
    uint16_t FCAL:6;           /*!< bit:  8..13  Frequency Calibration (16MHz)      */
    uint16_t :2;               /*!< bit: 14..15  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} OSCCTRL_CAL16M_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define OSCCTRL_CAL16M_OFFSET       0x50         /**< \brief (OSCCTRL_CAL16M offset) 16MHz Oscillator Calibration */

#define OSCCTRL_CAL16M_TCAL_Pos     0            /**< \brief (OSCCTRL_CAL16M) Temperature Calibration (16MHz) */
#define OSCCTRL_CAL16M_TCAL_Msk     (0x3Fu << OSCCTRL_CAL16M_TCAL_Pos)
#define OSCCTRL_CAL16M_TCAL(value)  ((OSCCTRL_CAL16M_TCAL_Msk & ((value) << OSCCTRL_CAL16M_TCAL_Pos)))
#define OSCCTRL_CAL16M_FCAL_Pos     8            /**< \brief (OSCCTRL_CAL16M) Frequency Calibration (16MHz) */
#define OSCCTRL_CAL16M_FCAL_Msk     (0x3Fu << OSCCTRL_CAL16M_FCAL_Pos)
#define OSCCTRL_CAL16M_FCAL(value)  ((OSCCTRL_CAL16M_FCAL_Msk & ((value) << OSCCTRL_CAL16M_FCAL_Pos)))
#define OSCCTRL_CAL16M_MASK         0x3F3Fu      /**< \brief (OSCCTRL_CAL16M) Register Bits Mask */

/* -------- OSCCTRL_OSC16MTEST : (OSCCTRL Offset: 0x54) (R/W  8) OSC16M Test Mode -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  FSEL:1;           /*!< bit:      0  Drive FSEL bits from pads          */
    uint8_t  :7;               /*!< bit:  1.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} OSCCTRL_OSC16MTEST_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define OSCCTRL_OSC16MTEST_OFFSET   0x54         /**< \brief (OSCCTRL_OSC16MTEST offset) OSC16M Test Mode */
#define OSCCTRL_OSC16MTEST_RESETVALUE 0x00         /**< \brief (OSCCTRL_OSC16MTEST reset_value) OSC16M Test Mode */

#define OSCCTRL_OSC16MTEST_FSEL_Pos 0            /**< \brief (OSCCTRL_OSC16MTEST) Drive FSEL bits from pads */
#define OSCCTRL_OSC16MTEST_FSEL     (0x1u << OSCCTRL_OSC16MTEST_FSEL_Pos)
#define OSCCTRL_OSC16MTEST_MASK     0x01u        /**< \brief (OSCCTRL_OSC16MTEST) Register Bits Mask */

/* -------- OSCCTRL_DFLLTEST : (OSCCTRL Offset: 0x58) (R/W  8) DFLL48M Test -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  TCAL:3;           /*!< bit:  0.. 2  Temperature Calibration            */
    uint8_t  :5;               /*!< bit:  3.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} OSCCTRL_DFLLTEST_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define OSCCTRL_DFLLTEST_OFFSET     0x58         /**< \brief (OSCCTRL_DFLLTEST offset) DFLL48M Test */
#define OSCCTRL_DFLLTEST_RESETVALUE 0x04         /**< \brief (OSCCTRL_DFLLTEST reset_value) DFLL48M Test */

#define OSCCTRL_DFLLTEST_TCAL_Pos   0            /**< \brief (OSCCTRL_DFLLTEST) Temperature Calibration */
#define OSCCTRL_DFLLTEST_TCAL_Msk   (0x7u << OSCCTRL_DFLLTEST_TCAL_Pos)
#define OSCCTRL_DFLLTEST_TCAL(value) ((OSCCTRL_DFLLTEST_TCAL_Msk & ((value) << OSCCTRL_DFLLTEST_TCAL_Pos)))
#define OSCCTRL_DFLLTEST_MASK       0x07u        /**< \brief (OSCCTRL_DFLLTEST) Register Bits Mask */

/* -------- OSCCTRL_TESTMODE : (OSCCTRL Offset: 0x5C) (R/W 16) Test Mode -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t XOSC:1;           /*!< bit:      0  XOSC Test Mode Enable              */
    uint16_t OSC16M:1;         /*!< bit:      1  OSC16M Test Mode Enable            */
    uint16_t DFLL:1;           /*!< bit:      2  DFLL Test Mode Enable              */
    uint16_t DPLL:1;           /*!< bit:      3  DPLL Test Mode Enable              */
    uint16_t ALLCLK:1;         /*!< bit:      4  All Clocks Test Mode Enable        */
    uint16_t :11;              /*!< bit:  5..15  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} OSCCTRL_TESTMODE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

