zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define OSCCTRL_TESTMODE_OFFSET     0x5C         /**< \brief (OSCCTRL_TESTMODE offset) Test Mode */
#define OSCCTRL_TESTMODE_RESETVALUE 0x0000       /**< \brief (OSCCTRL_TESTMODE reset_value) Test Mode */

#define OSCCTRL_TESTMODE_XOSC_Pos   0            /**< \brief (OSCCTRL_TESTMODE) XOSC Test Mode Enable */
#define OSCCTRL_TESTMODE_XOSC       (0x1u << OSCCTRL_TESTMODE_XOSC_Pos)
#define OSCCTRL_TESTMODE_OSC16M_Pos 1            /**< \brief (OSCCTRL_TESTMODE) OSC16M Test Mode Enable */
#define OSCCTRL_TESTMODE_OSC16M     (0x1u << OSCCTRL_TESTMODE_OSC16M_Pos)
#define OSCCTRL_TESTMODE_DFLL_Pos   2            /**< \brief (OSCCTRL_TESTMODE) DFLL Test Mode Enable */
#define OSCCTRL_TESTMODE_DFLL       (0x1u << OSCCTRL_TESTMODE_DFLL_Pos)
#define OSCCTRL_TESTMODE_DPLL_Pos   3            /**< \brief (OSCCTRL_TESTMODE) DPLL Test Mode Enable */
#define OSCCTRL_TESTMODE_DPLL       (0x1u << OSCCTRL_TESTMODE_DPLL_Pos)
#define OSCCTRL_TESTMODE_ALLCLK_Pos 4            /**< \brief (OSCCTRL_TESTMODE) All Clocks Test Mode Enable */
#define OSCCTRL_TESTMODE_ALLCLK     (0x1u << OSCCTRL_TESTMODE_ALLCLK_Pos)
#define OSCCTRL_TESTMODE_MASK       0x001Fu      /**< \brief (OSCCTRL_TESTMODE) Register Bits Mask */

/** \brief OSCCTRL hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  __IO OSCCTRL_INTENCLR_Type     INTENCLR;    /**< \brief Offset: 0x00 (R/W 32) Interrupt Enable Clear */
  __IO OSCCTRL_INTENSET_Type     INTENSET;    /**< \brief Offset: 0x04 (R/W 32) Interrupt Enable Set */
  __IO OSCCTRL_INTFLAG_Type      INTFLAG;     /**< \brief Offset: 0x08 (R/W 32) Interrupt Flag Status and Clear */
  __I  OSCCTRL_STATUS_Type       STATUS;      /**< \brief Offset: 0x0C (R/  32) Power and Clocks Status */
  __IO OSCCTRL_XOSCCTRL_Type     XOSCCTRL;    /**< \brief Offset: 0x10 (R/W 16) External Multipurpose Crystal Oscillator (XOSC) Control */
       RoReg8                    Reserved1[0x2];
  __IO OSCCTRL_OSC16MCTRL_Type   OSC16MCTRL;  /**< \brief Offset: 0x14 (R/W  8) 16MHz Internal Oscillator (OSC16M) Control */
       RoReg8                    Reserved2[0x3];
  __IO OSCCTRL_DFLLCTRL_Type     DFLLCTRL;    /**< \brief Offset: 0x18 (R/W 16) DFLL48M Control */
       RoReg8                    Reserved3[0x2];
  __IO OSCCTRL_DFLLVAL_Type      DFLLVAL;     /**< \brief Offset: 0x1C (R/W 32) DFLL48M Value */
  __IO OSCCTRL_DFLLMUL_Type      DFLLMUL;     /**< \brief Offset: 0x20 (R/W 32) DFLL48M Multiplier */
  __IO OSCCTRL_DFLLSYNC_Type     DFLLSYNC;    /**< \brief Offset: 0x24 (R/W  8) DFLL48M Synchronization */
       RoReg8                    Reserved4[0x3];
  __IO OSCCTRL_DPLLCTRLA_Type    DPLLCTRLA;   /**< \brief Offset: 0x28 (R/W  8) DPLL Control */
       RoReg8                    Reserved5[0x3];
  __IO OSCCTRL_DPLLRATIO_Type    DPLLRATIO;   /**< \brief Offset: 0x2C (R/W 32) DPLL Ratio Control */
  __IO OSCCTRL_DPLLCTRLB_Type    DPLLCTRLB;   /**< \brief Offset: 0x30 (R/W 32) Digital Core Configuration */
  __IO OSCCTRL_DPLLPRESC_Type    DPLLPRESC;   /**< \brief Offset: 0x34 (R/W  8) DPLL Prescaler */
       RoReg8                    Reserved6[0x3];
  __I  OSCCTRL_DPLLSYNCBUSY_Type DPLLSYNCBUSY; /**< \brief Offset: 0x38 (R/   8) DPLL Synchronization Busy */
       RoReg8                    Reserved7[0x3];
  __I  OSCCTRL_DPLLSTATUS_Type   DPLLSTATUS;  /**< \brief Offset: 0x3C (R/   8) DPLL Status */
       RoReg8                    Reserved8[0x3];
  __IO OSCCTRL_DPLLTEST_Type     DPLLTEST;    /**< \brief Offset: 0x40 (R/W 32) DPLL Test */
  __IO OSCCTRL_CAL4M_Type        CAL4M;       /**< \brief Offset: 0x44 (R/W 16) 4MHz Oscillator Calibration */
       RoReg8                    Reserved9[0x2];
  __IO OSCCTRL_CAL8M_Type        CAL8M;       /**< \brief Offset: 0x48 (R/W 16) 8MHz Oscillator Calibration */
       RoReg8                    Reserved10[0x2];
  __IO OSCCTRL_CAL12M_Type       CAL12M;      /**< \brief Offset: 0x4C (R/W 16) 12MHz Oscillator Calibration */
       RoReg8                    Reserved11[0x2];
  __IO OSCCTRL_CAL16M_Type       CAL16M;      /**< \brief Offset: 0x50 (R/W 16) 16MHz Oscillator Calibration */
       RoReg8                    Reserved12[0x2];
  __IO OSCCTRL_OSC16MTEST_Type   OSC16MTEST;  /**< \brief Offset: 0x54 (R/W  8) OSC16M Test Mode */
       RoReg8                    Reserved13[0x3];
  __IO OSCCTRL_DFLLTEST_Type     DFLLTEST;    /**< \brief Offset: 0x58 (R/W  8) DFLL48M Test */
       RoReg8                    Reserved14[0x3];
  __IO OSCCTRL_TESTMODE_Type     TESTMODE;    /**< \brief Offset: 0x5C (R/W 16) Test Mode */
} Oscctrl;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR OSC32KCTRL */
/* ========================================================================== */
/** \addtogroup U3005_OSC32KCTRL 32k Oscillators Control */
/*@{*/

#define OSC32KCTRL_U2246
#define REV_OSC32KCTRL              0x100

/* -------- OSC32KCTRL_INTENCLR : (OSC32KCTRL Offset: 0x00) (R/W 32) Interrupt Enable Clear -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t XOSC32KRDY:1;     /*!< bit:      0  XOSC32K Ready Interrupt Enable     */
    uint32_t OSC32KRDY:1;      /*!< bit:      1  OSC32K Ready Interrupt Enable      */
    uint32_t :30;              /*!< bit:  2..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} OSC32KCTRL_INTENCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define OSC32KCTRL_INTENCLR_OFFSET  0x00         /**< \brief (OSC32KCTRL_INTENCLR offset) Interrupt Enable Clear */
#define OSC32KCTRL_INTENCLR_RESETVALUE 0x00000000   /**< \brief (OSC32KCTRL_INTENCLR reset_value) Interrupt Enable Clear */

#define OSC32KCTRL_INTENCLR_XOSC32KRDY_Pos 0            /**< \brief (OSC32KCTRL_INTENCLR) XOSC32K Ready Interrupt Enable */
#define OSC32KCTRL_INTENCLR_XOSC32KRDY (0x1u << OSC32KCTRL_INTENCLR_XOSC32KRDY_Pos)
#define OSC32KCTRL_INTENCLR_OSC32KRDY_Pos 1            /**< \brief (OSC32KCTRL_INTENCLR) OSC32K Ready Interrupt Enable */
#define OSC32KCTRL_INTENCLR_OSC32KRDY (0x1u << OSC32KCTRL_INTENCLR_OSC32KRDY_Pos)
#define OSC32KCTRL_INTENCLR_MASK    0x00000003u  /**< \brief (OSC32KCTRL_INTENCLR) Register Bits Mask */

