zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define OSC32KCTRL_OSCULP32K_EN32K_Pos 1            /**< \brief (OSC32KCTRL_OSCULP32K) Enable Out 32k */
#define OSC32KCTRL_OSCULP32K_EN32K  (0x1u << OSC32KCTRL_OSCULP32K_EN32K_Pos)
#define OSC32KCTRL_OSCULP32K_EN1K_Pos 2            /**< \brief (OSC32KCTRL_OSCULP32K) Enable Out 1k */
#define OSC32KCTRL_OSCULP32K_EN1K   (0x1u << OSC32KCTRL_OSCULP32K_EN1K_Pos)
#define OSC32KCTRL_OSCULP32K_CALIB_Pos 8            /**< \brief (OSC32KCTRL_OSCULP32K) Oscillator Calibration */
#define OSC32KCTRL_OSCULP32K_CALIB_Msk (0x1Fu << OSC32KCTRL_OSCULP32K_CALIB_Pos)
#define OSC32KCTRL_OSCULP32K_CALIB(value) ((OSC32KCTRL_OSCULP32K_CALIB_Msk & ((value) << OSC32KCTRL_OSCULP32K_CALIB_Pos)))
#define OSC32KCTRL_OSCULP32K_WRTLOCK_Pos 15           /**< \brief (OSC32KCTRL_OSCULP32K) Write Lock */
#define OSC32KCTRL_OSCULP32K_WRTLOCK (0x1u << OSC32KCTRL_OSCULP32K_WRTLOCK_Pos)
#define OSC32KCTRL_OSCULP32K_MASK   0x00009F06u  /**< \brief (OSC32KCTRL_OSCULP32K) Register Bits Mask */

/* -------- OSC32KCTRL_OSCULP32KTEST : (OSC32KCTRL Offset: 0x20) (R/W 32) OSCULP32K Test -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DISABLE:1;        /*!< bit:      0  Disable Test Mode                  */
    uint32_t BIASOUTEN:1;      /*!< bit:      1  Bias Output Enable                 */
    uint32_t CONTREF:1;        /*!< bit:      2  Reference Forced to Continuous Mode */
    uint32_t :29;              /*!< bit:  3..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} OSC32KCTRL_OSCULP32KTEST_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define OSC32KCTRL_OSCULP32KTEST_OFFSET 0x20         /**< \brief (OSC32KCTRL_OSCULP32KTEST offset) OSCULP32K Test */
#define OSC32KCTRL_OSCULP32KTEST_RESETVALUE 0x00000000   /**< \brief (OSC32KCTRL_OSCULP32KTEST reset_value) OSCULP32K Test */

#define OSC32KCTRL_OSCULP32KTEST_DISABLE_Pos 0            /**< \brief (OSC32KCTRL_OSCULP32KTEST) Disable Test Mode */
#define OSC32KCTRL_OSCULP32KTEST_DISABLE (0x1u << OSC32KCTRL_OSCULP32KTEST_DISABLE_Pos)
#define OSC32KCTRL_OSCULP32KTEST_BIASOUTEN_Pos 1            /**< \brief (OSC32KCTRL_OSCULP32KTEST) Bias Output Enable */
#define OSC32KCTRL_OSCULP32KTEST_BIASOUTEN (0x1u << OSC32KCTRL_OSCULP32KTEST_BIASOUTEN_Pos)
#define OSC32KCTRL_OSCULP32KTEST_CONTREF_Pos 2            /**< \brief (OSC32KCTRL_OSCULP32KTEST) Reference Forced to Continuous Mode */
#define OSC32KCTRL_OSCULP32KTEST_CONTREF (0x1u << OSC32KCTRL_OSCULP32KTEST_CONTREF_Pos)
#define OSC32KCTRL_OSCULP32KTEST_MASK 0x00000007u  /**< \brief (OSC32KCTRL_OSCULP32KTEST) Register Bits Mask */

/* -------- OSC32KCTRL_TESTMODE : (OSC32KCTRL Offset: 0x24) (R/W 32) Test Mode -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t XOSC32K:1;        /*!< bit:      0  XOSC32 Test Mode Enable            */
    uint32_t OSC32K:1;         /*!< bit:      1  OSC32K Test Mode Enable            */
    uint32_t OSCULP32K:1;      /*!< bit:      2  OSCULP32K Test Mode Enable         */
    uint32_t ALLCLK:1;         /*!< bit:      3  All Clocks Test Mode Enable        */
    uint32_t :28;              /*!< bit:  4..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} OSC32KCTRL_TESTMODE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define OSC32KCTRL_TESTMODE_OFFSET  0x24         /**< \brief (OSC32KCTRL_TESTMODE offset) Test Mode */
#define OSC32KCTRL_TESTMODE_RESETVALUE 0x00000000   /**< \brief (OSC32KCTRL_TESTMODE reset_value) Test Mode */

#define OSC32KCTRL_TESTMODE_XOSC32K_Pos 0            /**< \brief (OSC32KCTRL_TESTMODE) XOSC32 Test Mode Enable */
#define OSC32KCTRL_TESTMODE_XOSC32K (0x1u << OSC32KCTRL_TESTMODE_XOSC32K_Pos)
#define OSC32KCTRL_TESTMODE_OSC32K_Pos 1            /**< \brief (OSC32KCTRL_TESTMODE) OSC32K Test Mode Enable */
#define OSC32KCTRL_TESTMODE_OSC32K  (0x1u << OSC32KCTRL_TESTMODE_OSC32K_Pos)
#define OSC32KCTRL_TESTMODE_OSCULP32K_Pos 2            /**< \brief (OSC32KCTRL_TESTMODE) OSCULP32K Test Mode Enable */
#define OSC32KCTRL_TESTMODE_OSCULP32K (0x1u << OSC32KCTRL_TESTMODE_OSCULP32K_Pos)
#define OSC32KCTRL_TESTMODE_ALLCLK_Pos 3            /**< \brief (OSC32KCTRL_TESTMODE) All Clocks Test Mode Enable */
#define OSC32KCTRL_TESTMODE_ALLCLK  (0x1u << OSC32KCTRL_TESTMODE_ALLCLK_Pos)
#define OSC32KCTRL_TESTMODE_MASK    0x0000000Fu  /**< \brief (OSC32KCTRL_TESTMODE) Register Bits Mask */

/** \brief OSC32KCTRL hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  __IO OSC32KCTRL_INTENCLR_Type  INTENCLR;    /**< \brief Offset: 0x00 (R/W 32) Interrupt Enable Clear */
  __IO OSC32KCTRL_INTENSET_Type  INTENSET;    /**< \brief Offset: 0x04 (R/W 32) Interrupt Enable Set */
  __IO OSC32KCTRL_INTFLAG_Type   INTFLAG;     /**< \brief Offset: 0x08 (R/W 32) Interrupt Flag Status and Clear */
  __I  OSC32KCTRL_STATUS_Type    STATUS;      /**< \brief Offset: 0x0C (R/  32) Power and Clocks Status */
  __IO OSC32KCTRL_RTCCTRL_Type   RTCCTRL;     /**< \brief Offset: 0x10 (R/W 32) Clock selection */
  __IO OSC32KCTRL_XOSC32K_Type   XOSC32K;     /**< \brief Offset: 0x14 (R/W 32) 32kHz External Crystal Oscillator (XOSC32K) Control */
  __IO OSC32KCTRL_OSC32K_Type    OSC32K;      /**< \brief Offset: 0x18 (R/W 32) 32kHz Internal Oscillator (OSC32K) Control */
  __IO OSC32KCTRL_OSCULP32K_Type OSCULP32K;   /**< \brief Offset: 0x1C (R/W 32) 32kHz Ultra Low Power Internal Oscillator (OSCULP32K) Control */
  __IO OSC32KCTRL_OSCULP32KTEST_Type OSCULP32KTEST; /**< \brief Offset: 0x20 (R/W 32) OSCULP32K Test */
  __IO OSC32KCTRL_TESTMODE_Type  TESTMODE;    /**< \brief Offset: 0x24 (R/W 32) Test Mode */
} Osc32kctrl;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR PAC */
/* ========================================================================== */
/** \addtogroup U3005_PAC Peripheral Access Controller */
/*@{*/

#define PAC_U2120
#define REV_PAC                     0x100

/* -------- PAC_WRCTRL : (PAC Offset: 0x00) (R/W 32) Write control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t PERID:16;         /*!< bit:  0..15  Peripheral identifier              */
    uint32_t KEY:8;            /*!< bit: 16..23  Peripheral access control key      */
    uint32_t :8;               /*!< bit: 24..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PAC_WRCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PAC_WRCTRL_OFFSET           0x00         /**< \brief (PAC_WRCTRL offset) Write control */
#define PAC_WRCTRL_RESETVALUE       0x00000000   /**< \brief (PAC_WRCTRL reset_value) Write control */

