zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define PAC_INTFLAGA_PM_Pos         0            /**< \brief (PAC_INTFLAGA) PM */
#define PAC_INTFLAGA_PM             (0x1u << PAC_INTFLAGA_PM_Pos)
#define PAC_INTFLAGA_MCLK_Pos       1            /**< \brief (PAC_INTFLAGA) MCLK */
#define PAC_INTFLAGA_MCLK           (0x1u << PAC_INTFLAGA_MCLK_Pos)
#define PAC_INTFLAGA_RSTC_Pos       2            /**< \brief (PAC_INTFLAGA) RSTC */
#define PAC_INTFLAGA_RSTC           (0x1u << PAC_INTFLAGA_RSTC_Pos)
#define PAC_INTFLAGA_OSCCTRL_Pos    3            /**< \brief (PAC_INTFLAGA) OSCCTRL */
#define PAC_INTFLAGA_OSCCTRL        (0x1u << PAC_INTFLAGA_OSCCTRL_Pos)
#define PAC_INTFLAGA_OSC32KCTRL_Pos 4            /**< \brief (PAC_INTFLAGA) OSC32KCTRL */
#define PAC_INTFLAGA_OSC32KCTRL     (0x1u << PAC_INTFLAGA_OSC32KCTRL_Pos)
#define PAC_INTFLAGA_SUPC_Pos       5            /**< \brief (PAC_INTFLAGA) SUPC */
#define PAC_INTFLAGA_SUPC           (0x1u << PAC_INTFLAGA_SUPC_Pos)
#define PAC_INTFLAGA_GCLK_Pos       6            /**< \brief (PAC_INTFLAGA) GCLK */
#define PAC_INTFLAGA_GCLK           (0x1u << PAC_INTFLAGA_GCLK_Pos)
#define PAC_INTFLAGA_WDT_Pos        7            /**< \brief (PAC_INTFLAGA) WDT */
#define PAC_INTFLAGA_WDT            (0x1u << PAC_INTFLAGA_WDT_Pos)
#define PAC_INTFLAGA_RTC_Pos        8            /**< \brief (PAC_INTFLAGA) RTC */
#define PAC_INTFLAGA_RTC            (0x1u << PAC_INTFLAGA_RTC_Pos)
#define PAC_INTFLAGA_EIC_Pos        9            /**< \brief (PAC_INTFLAGA) EIC */
#define PAC_INTFLAGA_EIC            (0x1u << PAC_INTFLAGA_EIC_Pos)
#define PAC_INTFLAGA_PORT_Pos       10           /**< \brief (PAC_INTFLAGA) PORT */
#define PAC_INTFLAGA_PORT           (0x1u << PAC_INTFLAGA_PORT_Pos)
#define PAC_INTFLAGA_TAL_Pos        11           /**< \brief (PAC_INTFLAGA) TAL */
#define PAC_INTFLAGA_TAL            (0x1u << PAC_INTFLAGA_TAL_Pos)
#define PAC_INTFLAGA_DSUSTANDBY_Pos 12           /**< \brief (PAC_INTFLAGA) DSUSTANDBY */
#define PAC_INTFLAGA_DSUSTANDBY     (0x1u << PAC_INTFLAGA_DSUSTANDBY_Pos)
#define PAC_INTFLAGA_MASK           0x00001FFFu  /**< \brief (PAC_INTFLAGA) Register Bits Mask */

/* -------- PAC_INTFLAGB : (PAC Offset: 0x18) (R/W 32) Peripheral interrupt flag status - Bridge B -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t USB:1;            /*!< bit:      0  USB                                */
    uint32_t DSU:1;            /*!< bit:      1  DSU                                */
    uint32_t NVMCTRL:1;        /*!< bit:      2  NVMCTRL                            */
    uint32_t MTB:1;            /*!< bit:      3  MTB                                */
    uint32_t HMATRIXHS:1;      /*!< bit:      4  HMATRIXHS                          */
    uint32_t ATW:1;            /*!< bit:      5  ATW                                */
    uint32_t :26;              /*!< bit:  6..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PAC_INTFLAGB_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PAC_INTFLAGB_OFFSET         0x18         /**< \brief (PAC_INTFLAGB offset) Peripheral interrupt flag status - Bridge B */
#define PAC_INTFLAGB_RESETVALUE     0x00000000   /**< \brief (PAC_INTFLAGB reset_value) Peripheral interrupt flag status - Bridge B */

#define PAC_INTFLAGB_USB_Pos        0            /**< \brief (PAC_INTFLAGB) USB */
#define PAC_INTFLAGB_USB            (0x1u << PAC_INTFLAGB_USB_Pos)
#define PAC_INTFLAGB_DSU_Pos        1            /**< \brief (PAC_INTFLAGB) DSU */
#define PAC_INTFLAGB_DSU            (0x1u << PAC_INTFLAGB_DSU_Pos)
#define PAC_INTFLAGB_NVMCTRL_Pos    2            /**< \brief (PAC_INTFLAGB) NVMCTRL */
#define PAC_INTFLAGB_NVMCTRL        (0x1u << PAC_INTFLAGB_NVMCTRL_Pos)
#define PAC_INTFLAGB_MTB_Pos        3            /**< \brief (PAC_INTFLAGB) MTB */
#define PAC_INTFLAGB_MTB            (0x1u << PAC_INTFLAGB_MTB_Pos)
#define PAC_INTFLAGB_HMATRIXHS_Pos  4            /**< \brief (PAC_INTFLAGB) HMATRIXHS */
#define PAC_INTFLAGB_HMATRIXHS      (0x1u << PAC_INTFLAGB_HMATRIXHS_Pos)
#define PAC_INTFLAGB_ATW_Pos        5            /**< \brief (PAC_INTFLAGB) ATW */
#define PAC_INTFLAGB_ATW            (0x1u << PAC_INTFLAGB_ATW_Pos)
#define PAC_INTFLAGB_MASK           0x0000003Fu  /**< \brief (PAC_INTFLAGB) Register Bits Mask */

/* -------- PAC_INTFLAGC : (PAC Offset: 0x1C) (R/W 32) Peripheral interrupt flag status - Bridge C -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t SERCOM0:1;        /*!< bit:      0  SERCOM0                            */
    uint32_t SERCOM1:1;        /*!< bit:      1  SERCOM1                            */
    uint32_t SERCOM2:1;        /*!< bit:      2  SERCOM2                            */
    uint32_t SERCOM3:1;        /*!< bit:      3  SERCOM3                            */
    uint32_t SERCOM4:1;        /*!< bit:      4  SERCOM4                            */
    uint32_t TCC0:1;           /*!< bit:      5  TCC0                               */
    uint32_t TCC1:1;           /*!< bit:      6  TCC1                               */
    uint32_t TCC2:1;           /*!< bit:      7  TCC2                               */
    uint32_t TC0:1;            /*!< bit:      8  TC0                                */
    uint32_t TC1:1;            /*!< bit:      9  TC1                                */
    uint32_t TC2:1;            /*!< bit:     10  TC2                                */
    uint32_t TC3:1;            /*!< bit:     11  TC3                                */
    uint32_t DAC:1;            /*!< bit:     12  DAC                                */
    uint32_t AES:1;            /*!< bit:     13  AES                                */
    uint32_t TRNG:1;           /*!< bit:     14  TRNG                               */
    uint32_t RFCTRL:1;         /*!< bit:     15  RFCTRL                             */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PAC_INTFLAGC_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

