zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define PAC_INTFLAGE_PAC_Pos        0            /**< \brief (PAC_INTFLAGE) PAC */
#define PAC_INTFLAGE_PAC            (0x1u << PAC_INTFLAGE_PAC_Pos)
#define PAC_INTFLAGE_DMAC_Pos       1            /**< \brief (PAC_INTFLAGE) DMAC */
#define PAC_INTFLAGE_DMAC           (0x1u << PAC_INTFLAGE_DMAC_Pos)
#define PAC_INTFLAGE_HMATRIXLP_Pos  2            /**< \brief (PAC_INTFLAGE) HMATRIXLP */
#define PAC_INTFLAGE_HMATRIXLP      (0x1u << PAC_INTFLAGE_HMATRIXLP_Pos)
#define PAC_INTFLAGE_PICOP_Pos      3            /**< \brief (PAC_INTFLAGE) PICOP */
#define PAC_INTFLAGE_PICOP          (0x1u << PAC_INTFLAGE_PICOP_Pos)
#define PAC_INTFLAGE_MASK           0x0000000Fu  /**< \brief (PAC_INTFLAGE) Register Bits Mask */

/* -------- PAC_STATUSA : (PAC Offset: 0x34) (R/  32) Peripheral write protection status - Bridge A -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t PM:1;             /*!< bit:      0  PM APB Protect Enable              */
    uint32_t MCLK:1;           /*!< bit:      1  MCLK APB Protect Enable            */
    uint32_t RSTC:1;           /*!< bit:      2  RSTC APB Protect Enable            */
    uint32_t OSCCTRL:1;        /*!< bit:      3  OSCCTRL APB Protect Enable         */
    uint32_t OSC32KCTRL:1;     /*!< bit:      4  OSC32KCTRL APB Protect Enable      */
    uint32_t SUPC:1;           /*!< bit:      5  SUPC APB Protect Enable            */
    uint32_t GCLK:1;           /*!< bit:      6  GCLK APB Protect Enable            */
    uint32_t WDT:1;            /*!< bit:      7  WDT APB Protect Enable             */
    uint32_t RTC:1;            /*!< bit:      8  RTC APB Protect Enable             */
    uint32_t EIC:1;            /*!< bit:      9  EIC APB Protect Enable             */
    uint32_t PORT:1;           /*!< bit:     10  PORT APB Protect Enable            */
    uint32_t TAL:1;            /*!< bit:     11  TAL APB Protect Enable             */
    uint32_t DSUSTANDBY:1;     /*!< bit:     12  DSUSTANDBY APB Protect Enable      */
    uint32_t :19;              /*!< bit: 13..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PAC_STATUSA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PAC_STATUSA_OFFSET          0x34         /**< \brief (PAC_STATUSA offset) Peripheral write protection status - Bridge A */
#define PAC_STATUSA_RESETVALUE      0x00001000   /**< \brief (PAC_STATUSA reset_value) Peripheral write protection status - Bridge A */

#define PAC_STATUSA_PM_Pos          0            /**< \brief (PAC_STATUSA) PM APB Protect Enable */
#define PAC_STATUSA_PM              (0x1u << PAC_STATUSA_PM_Pos)
#define PAC_STATUSA_MCLK_Pos        1            /**< \brief (PAC_STATUSA) MCLK APB Protect Enable */
#define PAC_STATUSA_MCLK            (0x1u << PAC_STATUSA_MCLK_Pos)
#define PAC_STATUSA_RSTC_Pos        2            /**< \brief (PAC_STATUSA) RSTC APB Protect Enable */
#define PAC_STATUSA_RSTC            (0x1u << PAC_STATUSA_RSTC_Pos)
#define PAC_STATUSA_OSCCTRL_Pos     3            /**< \brief (PAC_STATUSA) OSCCTRL APB Protect Enable */
#define PAC_STATUSA_OSCCTRL         (0x1u << PAC_STATUSA_OSCCTRL_Pos)
#define PAC_STATUSA_OSC32KCTRL_Pos  4            /**< \brief (PAC_STATUSA) OSC32KCTRL APB Protect Enable */
#define PAC_STATUSA_OSC32KCTRL      (0x1u << PAC_STATUSA_OSC32KCTRL_Pos)
#define PAC_STATUSA_SUPC_Pos        5            /**< \brief (PAC_STATUSA) SUPC APB Protect Enable */
#define PAC_STATUSA_SUPC            (0x1u << PAC_STATUSA_SUPC_Pos)
#define PAC_STATUSA_GCLK_Pos        6            /**< \brief (PAC_STATUSA) GCLK APB Protect Enable */
#define PAC_STATUSA_GCLK            (0x1u << PAC_STATUSA_GCLK_Pos)
#define PAC_STATUSA_WDT_Pos         7            /**< \brief (PAC_STATUSA) WDT APB Protect Enable */
#define PAC_STATUSA_WDT             (0x1u << PAC_STATUSA_WDT_Pos)
#define PAC_STATUSA_RTC_Pos         8            /**< \brief (PAC_STATUSA) RTC APB Protect Enable */
#define PAC_STATUSA_RTC             (0x1u << PAC_STATUSA_RTC_Pos)
#define PAC_STATUSA_EIC_Pos         9            /**< \brief (PAC_STATUSA) EIC APB Protect Enable */
#define PAC_STATUSA_EIC             (0x1u << PAC_STATUSA_EIC_Pos)
#define PAC_STATUSA_PORT_Pos        10           /**< \brief (PAC_STATUSA) PORT APB Protect Enable */
#define PAC_STATUSA_PORT            (0x1u << PAC_STATUSA_PORT_Pos)
#define PAC_STATUSA_TAL_Pos         11           /**< \brief (PAC_STATUSA) TAL APB Protect Enable */
#define PAC_STATUSA_TAL             (0x1u << PAC_STATUSA_TAL_Pos)
#define PAC_STATUSA_DSUSTANDBY_Pos  12           /**< \brief (PAC_STATUSA) DSUSTANDBY APB Protect Enable */
#define PAC_STATUSA_DSUSTANDBY      (0x1u << PAC_STATUSA_DSUSTANDBY_Pos)
#define PAC_STATUSA_MASK            0x00001FFFu  /**< \brief (PAC_STATUSA) Register Bits Mask */

/* -------- PAC_STATUSB : (PAC Offset: 0x38) (R/  32) Peripheral write protection status - Bridge B -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t USB:1;            /*!< bit:      0  USB APB Protect Enable             */
    uint32_t DSU:1;            /*!< bit:      1  DSU APB Protect Enable             */
    uint32_t NVMCTRL:1;        /*!< bit:      2  NVMCTRL APB Protect Enable         */
    uint32_t MTB:1;            /*!< bit:      3  MTB APB Protect Enable             */
    uint32_t HMATRIXHS:1;      /*!< bit:      4  HMATRIXHS APB Protect Enable       */
    uint32_t ATW:1;            /*!< bit:      5  ATW APB Protect Enable             */
    uint32_t :26;              /*!< bit:  6..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PAC_STATUSB_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PAC_STATUSB_OFFSET          0x38         /**< \brief (PAC_STATUSB offset) Peripheral write protection status - Bridge B */
#define PAC_STATUSB_RESETVALUE      0x00000022   /**< \brief (PAC_STATUSB reset_value) Peripheral write protection status - Bridge B */

#define PAC_STATUSB_USB_Pos         0            /**< \brief (PAC_STATUSB) USB APB Protect Enable */
#define PAC_STATUSB_USB             (0x1u << PAC_STATUSB_USB_Pos)
#define PAC_STATUSB_DSU_Pos         1            /**< \brief (PAC_STATUSB) DSU APB Protect Enable */
#define PAC_STATUSB_DSU             (0x1u << PAC_STATUSB_DSU_Pos)
#define PAC_STATUSB_NVMCTRL_Pos     2            /**< \brief (PAC_STATUSB) NVMCTRL APB Protect Enable */
#define PAC_STATUSB_NVMCTRL         (0x1u << PAC_STATUSB_NVMCTRL_Pos)
#define PAC_STATUSB_MTB_Pos         3            /**< \brief (PAC_STATUSB) MTB APB Protect Enable */
#define PAC_STATUSB_MTB             (0x1u << PAC_STATUSB_MTB_Pos)
#define PAC_STATUSB_HMATRIXHS_Pos   4            /**< \brief (PAC_STATUSB) HMATRIXHS APB Protect Enable */
#define PAC_STATUSB_HMATRIXHS       (0x1u << PAC_STATUSB_HMATRIXHS_Pos)
#define PAC_STATUSB_ATW_Pos         5            /**< \brief (PAC_STATUSB) ATW APB Protect Enable */
#define PAC_STATUSB_ATW             (0x1u << PAC_STATUSB_ATW_Pos)
#define PAC_STATUSB_MASK            0x0000003Fu  /**< \brief (PAC_STATUSB) Register Bits Mask */

/* -------- PAC_STATUSC : (PAC Offset: 0x3C) (R/  32) Peripheral write protection status - Bridge C -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t SERCOM0:1;        /*!< bit:      0  SERCOM0 APB Protect Enable         */
    uint32_t SERCOM1:1;        /*!< bit:      1  SERCOM1 APB Protect Enable         */
    uint32_t SERCOM2:1;        /*!< bit:      2  SERCOM2 APB Protect Enable         */
    uint32_t SERCOM3:1;        /*!< bit:      3  SERCOM3 APB Protect Enable         */
    uint32_t SERCOM4:1;        /*!< bit:      4  SERCOM4 APB Protect Enable         */
    uint32_t TCC0:1;           /*!< bit:      5  TCC0 APB Protect Enable            */
    uint32_t TCC1:1;           /*!< bit:      6  TCC1 APB Protect Enable            */
    uint32_t TCC2:1;           /*!< bit:      7  TCC2 APB Protect Enable            */
    uint32_t TC0:1;            /*!< bit:      8  TC0 APB Protect Enable             */
    uint32_t TC1:1;            /*!< bit:      9  TC1 APB Protect Enable             */
    uint32_t TC2:1;            /*!< bit:     10  TC2 APB Protect Enable             */
    uint32_t TC3:1;            /*!< bit:     11  TC3 APB Protect Enable             */
    uint32_t DAC:1;            /*!< bit:     12  DAC APB Protect Enable             */
    uint32_t AES:1;            /*!< bit:     13  AES APB Protect Enable             */
    uint32_t TRNG:1;           /*!< bit:     14  TRNG APB Protect Enable            */
    uint32_t RFCTRL:1;         /*!< bit:     15  RFCTRL APB Protect Enable          */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PAC_STATUSC_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PAC_STATUSC_OFFSET          0x3C         /**< \brief (PAC_STATUSC offset) Peripheral write protection status - Bridge C */
#define PAC_STATUSC_RESETVALUE      0x00000000   /**< \brief (PAC_STATUSC reset_value) Peripheral write protection status - Bridge C */

#define PAC_STATUSC_SERCOM0_Pos     0            /**< \brief (PAC_STATUSC) SERCOM0 APB Protect Enable */
#define PAC_STATUSC_SERCOM0         (0x1u << PAC_STATUSC_SERCOM0_Pos)
#define PAC_STATUSC_SERCOM1_Pos     1            /**< \brief (PAC_STATUSC) SERCOM1 APB Protect Enable */
#define PAC_STATUSC_SERCOM1         (0x1u << PAC_STATUSC_SERCOM1_Pos)
#define PAC_STATUSC_SERCOM2_Pos     2            /**< \brief (PAC_STATUSC) SERCOM2 APB Protect Enable */
#define PAC_STATUSC_SERCOM2         (0x1u << PAC_STATUSC_SERCOM2_Pos)
#define PAC_STATUSC_SERCOM3_Pos     3            /**< \brief (PAC_STATUSC) SERCOM3 APB Protect Enable */
#define PAC_STATUSC_SERCOM3         (0x1u << PAC_STATUSC_SERCOM3_Pos)
#define PAC_STATUSC_SERCOM4_Pos     4            /**< \brief (PAC_STATUSC) SERCOM4 APB Protect Enable */
#define PAC_STATUSC_SERCOM4         (0x1u << PAC_STATUSC_SERCOM4_Pos)
#define PAC_STATUSC_TCC0_Pos        5            /**< \brief (PAC_STATUSC) TCC0 APB Protect Enable */
#define PAC_STATUSC_TCC0            (0x1u << PAC_STATUSC_TCC0_Pos)
#define PAC_STATUSC_TCC1_Pos        6            /**< \brief (PAC_STATUSC) TCC1 APB Protect Enable */
#define PAC_STATUSC_TCC1            (0x1u << PAC_STATUSC_TCC1_Pos)
#define PAC_STATUSC_TCC2_Pos        7            /**< \brief (PAC_STATUSC) TCC2 APB Protect Enable */
#define PAC_STATUSC_TCC2            (0x1u << PAC_STATUSC_TCC2_Pos)
#define PAC_STATUSC_TC0_Pos         8            /**< \brief (PAC_STATUSC) TC0 APB Protect Enable */
#define PAC_STATUSC_TC0             (0x1u << PAC_STATUSC_TC0_Pos)
#define PAC_STATUSC_TC1_Pos         9            /**< \brief (PAC_STATUSC) TC1 APB Protect Enable */
#define PAC_STATUSC_TC1             (0x1u << PAC_STATUSC_TC1_Pos)
#define PAC_STATUSC_TC2_Pos         10           /**< \brief (PAC_STATUSC) TC2 APB Protect Enable */
#define PAC_STATUSC_TC2             (0x1u << PAC_STATUSC_TC2_Pos)
#define PAC_STATUSC_TC3_Pos         11           /**< \brief (PAC_STATUSC) TC3 APB Protect Enable */
#define PAC_STATUSC_TC3             (0x1u << PAC_STATUSC_TC3_Pos)
#define PAC_STATUSC_DAC_Pos         12           /**< \brief (PAC_STATUSC) DAC APB Protect Enable */
#define PAC_STATUSC_DAC             (0x1u << PAC_STATUSC_DAC_Pos)
#define PAC_STATUSC_AES_Pos         13           /**< \brief (PAC_STATUSC) AES APB Protect Enable */
#define PAC_STATUSC_AES             (0x1u << PAC_STATUSC_AES_Pos)
#define PAC_STATUSC_TRNG_Pos        14           /**< \brief (PAC_STATUSC) TRNG APB Protect Enable */
#define PAC_STATUSC_TRNG            (0x1u << PAC_STATUSC_TRNG_Pos)
#define PAC_STATUSC_RFCTRL_Pos      15           /**< \brief (PAC_STATUSC) RFCTRL APB Protect Enable */
#define PAC_STATUSC_RFCTRL          (0x1u << PAC_STATUSC_RFCTRL_Pos)
#define PAC_STATUSC_MASK            0x0000FFFFu  /**< \brief (PAC_STATUSC) Register Bits Mask */

