zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
/* -------- PICOP_ID : (PICOP Offset: 0x000) (R/W 32) ID n -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ID:32;            /*!< bit:  0..31  ID String 0                        */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PICOP_ID_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PICOP_ID_OFFSET             0x000        /**< \brief (PICOP_ID offset) ID n */
#define PICOP_ID_RESETVALUE         0x00000000   /**< \brief (PICOP_ID reset_value) ID n */

#define PICOP_ID_ID_Pos             0            /**< \brief (PICOP_ID) ID String 0 */
#define PICOP_ID_ID_Msk             (0xFFFFFFFFu << PICOP_ID_ID_Pos)
#define PICOP_ID_ID(value)          ((PICOP_ID_ID_Msk & ((value) << PICOP_ID_ID_Pos)))
#define PICOP_ID_MASK               0xFFFFFFFFu  /**< \brief (PICOP_ID) Register Bits Mask */

/* -------- PICOP_CONFIG : (PICOP Offset: 0x020) (R/W 32) Configuration -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ISA:2;            /*!< bit:  0.. 1  Instruction Set Architecture       */
    uint32_t ASP:1;            /*!< bit:      2  Aligned Stack Pointer              */
    uint32_t MARRET:1;         /*!< bit:      3  Misaligned implicit long return register (GCC compatibility) */
    uint32_t RRET:4;           /*!< bit:  4.. 7  Implicit return word register      */
    uint32_t PCEXEN:1;         /*!< bit:      8  PC_EX register enabled for reduced interrupt latency */
    uint32_t :23;              /*!< bit:  9..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PICOP_CONFIG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PICOP_CONFIG_OFFSET         0x020        /**< \brief (PICOP_CONFIG offset) Configuration */
#define PICOP_CONFIG_RESETVALUE     0x00000000   /**< \brief (PICOP_CONFIG reset_value) Configuration */

#define PICOP_CONFIG_ISA_Pos        0            /**< \brief (PICOP_CONFIG) Instruction Set Architecture */
#define PICOP_CONFIG_ISA_Msk        (0x3u << PICOP_CONFIG_ISA_Pos)
#define PICOP_CONFIG_ISA(value)     ((PICOP_CONFIG_ISA_Msk & ((value) << PICOP_CONFIG_ISA_Pos)))
#define   PICOP_CONFIG_ISA_AVR8_Val       0x0u   /**< \brief (PICOP_CONFIG) AVR8 ISA, AVR8SP=1 */
#define   PICOP_CONFIG_ISA_AVR16C_Val     0x1u   /**< \brief (PICOP_CONFIG) AVR16 ISA fully compatible with AVR8 ISA, AVR8SP=1 */
#define   PICOP_CONFIG_ISA_AVR16E_Val     0x2u   /**< \brief (PICOP_CONFIG) AVR16 ISA extended, AVR8SP=1 */
#define   PICOP_CONFIG_ISA_AVR16_Val      0x3u   /**< \brief (PICOP_CONFIG) AVR16 ISA extended, AVR8SP=0 */
#define PICOP_CONFIG_ISA_AVR8       (PICOP_CONFIG_ISA_AVR8_Val     << PICOP_CONFIG_ISA_Pos)
#define PICOP_CONFIG_ISA_AVR16C     (PICOP_CONFIG_ISA_AVR16C_Val   << PICOP_CONFIG_ISA_Pos)
#define PICOP_CONFIG_ISA_AVR16E     (PICOP_CONFIG_ISA_AVR16E_Val   << PICOP_CONFIG_ISA_Pos)
#define PICOP_CONFIG_ISA_AVR16      (PICOP_CONFIG_ISA_AVR16_Val    << PICOP_CONFIG_ISA_Pos)
#define PICOP_CONFIG_ASP_Pos        2            /**< \brief (PICOP_CONFIG) Aligned Stack Pointer */
#define PICOP_CONFIG_ASP            (0x1u << PICOP_CONFIG_ASP_Pos)
#define PICOP_CONFIG_MARRET_Pos     3            /**< \brief (PICOP_CONFIG) Misaligned implicit long return register (GCC compatibility) */
#define PICOP_CONFIG_MARRET         (0x1u << PICOP_CONFIG_MARRET_Pos)
#define PICOP_CONFIG_RRET_Pos       4            /**< \brief (PICOP_CONFIG) Implicit return word register */
#define PICOP_CONFIG_RRET_Msk       (0xFu << PICOP_CONFIG_RRET_Pos)
#define PICOP_CONFIG_RRET(value)    ((PICOP_CONFIG_RRET_Msk & ((value) << PICOP_CONFIG_RRET_Pos)))
#define PICOP_CONFIG_PCEXEN_Pos     8            /**< \brief (PICOP_CONFIG) PC_EX register enabled for reduced interrupt latency */
#define PICOP_CONFIG_PCEXEN         (0x1u << PICOP_CONFIG_PCEXEN_Pos)
#define PICOP_CONFIG_MASK           0x000001FFu  /**< \brief (PICOP_CONFIG) Register Bits Mask */

/* -------- PICOP_CTRL : (PICOP Offset: 0x024) (R/W 32) Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t MAPUEXCEPT:1;     /*!< bit:      0  Enable exception for illegal access */
    uint32_t WPICACHE:1;       /*!< bit:      1  Write protect iCache               */
    uint32_t WPVEC:2;          /*!< bit:  2.. 3  Write protect vectors              */
    uint32_t WPCTX:2;          /*!< bit:  4.. 5  Write protect contexts             */
    uint32_t WPCODE:4;         /*!< bit:  6.. 9  Write protect code                 */
    uint32_t :22;              /*!< bit: 10..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PICOP_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PICOP_CTRL_OFFSET           0x024        /**< \brief (PICOP_CTRL offset) Control */
#define PICOP_CTRL_RESETVALUE       0x00000000   /**< \brief (PICOP_CTRL reset_value) Control */

#define PICOP_CTRL_MAPUEXCEPT_Pos   0            /**< \brief (PICOP_CTRL) Enable exception for illegal access */
#define PICOP_CTRL_MAPUEXCEPT       (0x1u << PICOP_CTRL_MAPUEXCEPT_Pos)
#define PICOP_CTRL_WPICACHE_Pos     1            /**< \brief (PICOP_CTRL) Write protect iCache */
#define PICOP_CTRL_WPICACHE         (0x1u << PICOP_CTRL_WPICACHE_Pos)
#define PICOP_CTRL_WPVEC_Pos        2            /**< \brief (PICOP_CTRL) Write protect vectors */
#define PICOP_CTRL_WPVEC_Msk        (0x3u << PICOP_CTRL_WPVEC_Pos)
#define PICOP_CTRL_WPVEC(value)     ((PICOP_CTRL_WPVEC_Msk & ((value) << PICOP_CTRL_WPVEC_Pos)))
#define   PICOP_CTRL_WPVEC_NONE_Val       0x0u   /**< \brief (PICOP_CTRL)  */
#define   PICOP_CTRL_WPVEC_RSTNMI_Val     0x1u   /**< \brief (PICOP_CTRL)  */
#define PICOP_CTRL_WPVEC_NONE       (PICOP_CTRL_WPVEC_NONE_Val     << PICOP_CTRL_WPVEC_Pos)
#define PICOP_CTRL_WPVEC_RSTNMI     (PICOP_CTRL_WPVEC_RSTNMI_Val   << PICOP_CTRL_WPVEC_Pos)
#define PICOP_CTRL_WPCTX_Pos        4            /**< \brief (PICOP_CTRL) Write protect contexts */
#define PICOP_CTRL_WPCTX_Msk        (0x3u << PICOP_CTRL_WPCTX_Pos)
#define PICOP_CTRL_WPCTX(value)     ((PICOP_CTRL_WPCTX_Msk & ((value) << PICOP_CTRL_WPCTX_Pos)))
#define   PICOP_CTRL_WPCTX_NONE_Val       0x0u   /**< \brief (PICOP_CTRL)  */
#define   PICOP_CTRL_WPCTX_CTX0_Val       0x1u   /**< \brief (PICOP_CTRL)  */
#define   PICOP_CTRL_WPCTX_CTX01_Val      0x2u   /**< \brief (PICOP_CTRL)  */
#define   PICOP_CTRL_WPCTX_CTX012_Val     0x3u   /**< \brief (PICOP_CTRL)  */
#define PICOP_CTRL_WPCTX_NONE       (PICOP_CTRL_WPCTX_NONE_Val     << PICOP_CTRL_WPCTX_Pos)
#define PICOP_CTRL_WPCTX_CTX0       (PICOP_CTRL_WPCTX_CTX0_Val     << PICOP_CTRL_WPCTX_Pos)
#define PICOP_CTRL_WPCTX_CTX01      (PICOP_CTRL_WPCTX_CTX01_Val    << PICOP_CTRL_WPCTX_Pos)
#define PICOP_CTRL_WPCTX_CTX012     (PICOP_CTRL_WPCTX_CTX012_Val   << PICOP_CTRL_WPCTX_Pos)
#define PICOP_CTRL_WPCODE_Pos       6            /**< \brief (PICOP_CTRL) Write protect code */
#define PICOP_CTRL_WPCODE_Msk       (0xFu << PICOP_CTRL_WPCODE_Pos)
#define PICOP_CTRL_WPCODE(value)    ((PICOP_CTRL_WPCODE_Msk & ((value) << PICOP_CTRL_WPCODE_Pos)))
#define   PICOP_CTRL_WPCODE_NONE_Val      0x0u   /**< \brief (PICOP_CTRL)  */
#define   PICOP_CTRL_WPCODE_256B_Val      0x1u   /**< \brief (PICOP_CTRL)  */
#define   PICOP_CTRL_WPCODE_512B_Val      0x2u   /**< \brief (PICOP_CTRL)  */
#define   PICOP_CTRL_WPCODE_768B_Val      0x3u   /**< \brief (PICOP_CTRL)  */
#define   PICOP_CTRL_WPCODE_1024B_Val     0x4u   /**< \brief (PICOP_CTRL)  */
#define   PICOP_CTRL_WPCODE_1280B_Val     0x5u   /**< \brief (PICOP_CTRL)  */
#define   PICOP_CTRL_WPCODE_1536B_Val     0x6u   /**< \brief (PICOP_CTRL)  */
#define   PICOP_CTRL_WPCODE_1792B_Val     0x7u   /**< \brief (PICOP_CTRL)  */
#define   PICOP_CTRL_WPCODE_2048B_Val     0x8u   /**< \brief (PICOP_CTRL)  */
#define   PICOP_CTRL_WPCODE_2304B_Val     0x9u   /**< \brief (PICOP_CTRL)  */
#define   PICOP_CTRL_WPCODE_2560B_Val     0xAu   /**< \brief (PICOP_CTRL)  */
#define   PICOP_CTRL_WPCODE_2816B_Val     0xBu   /**< \brief (PICOP_CTRL)  */
#define   PICOP_CTRL_WPCODE_3072B_Val     0xCu   /**< \brief (PICOP_CTRL)  */
#define   PICOP_CTRL_WPCODE_3328B_Val     0xDu   /**< \brief (PICOP_CTRL)  */
#define   PICOP_CTRL_WPCODE_3584B_Val     0xEu   /**< \brief (PICOP_CTRL)  */
#define   PICOP_CTRL_WPCODE_3840B_Val     0xFu   /**< \brief (PICOP_CTRL)  */
#define PICOP_CTRL_WPCODE_NONE      (PICOP_CTRL_WPCODE_NONE_Val    << PICOP_CTRL_WPCODE_Pos)
#define PICOP_CTRL_WPCODE_256B      (PICOP_CTRL_WPCODE_256B_Val    << PICOP_CTRL_WPCODE_Pos)
#define PICOP_CTRL_WPCODE_512B      (PICOP_CTRL_WPCODE_512B_Val    << PICOP_CTRL_WPCODE_Pos)
#define PICOP_CTRL_WPCODE_768B      (PICOP_CTRL_WPCODE_768B_Val    << PICOP_CTRL_WPCODE_Pos)
#define PICOP_CTRL_WPCODE_1024B     (PICOP_CTRL_WPCODE_1024B_Val   << PICOP_CTRL_WPCODE_Pos)
#define PICOP_CTRL_WPCODE_1280B     (PICOP_CTRL_WPCODE_1280B_Val   << PICOP_CTRL_WPCODE_Pos)
#define PICOP_CTRL_WPCODE_1536B     (PICOP_CTRL_WPCODE_1536B_Val   << PICOP_CTRL_WPCODE_Pos)
#define PICOP_CTRL_WPCODE_1792B     (PICOP_CTRL_WPCODE_1792B_Val   << PICOP_CTRL_WPCODE_Pos)
#define PICOP_CTRL_WPCODE_2048B     (PICOP_CTRL_WPCODE_2048B_Val   << PICOP_CTRL_WPCODE_Pos)
#define PICOP_CTRL_WPCODE_2304B     (PICOP_CTRL_WPCODE_2304B_Val   << PICOP_CTRL_WPCODE_Pos)
#define PICOP_CTRL_WPCODE_2560B     (PICOP_CTRL_WPCODE_2560B_Val   << PICOP_CTRL_WPCODE_Pos)
#define PICOP_CTRL_WPCODE_2816B     (PICOP_CTRL_WPCODE_2816B_Val   << PICOP_CTRL_WPCODE_Pos)
#define PICOP_CTRL_WPCODE_3072B     (PICOP_CTRL_WPCODE_3072B_Val   << PICOP_CTRL_WPCODE_Pos)
#define PICOP_CTRL_WPCODE_3328B     (PICOP_CTRL_WPCODE_3328B_Val   << PICOP_CTRL_WPCODE_Pos)
#define PICOP_CTRL_WPCODE_3584B     (PICOP_CTRL_WPCODE_3584B_Val   << PICOP_CTRL_WPCODE_Pos)
#define PICOP_CTRL_WPCODE_3840B     (PICOP_CTRL_WPCODE_3840B_Val   << PICOP_CTRL_WPCODE_Pos)
#define PICOP_CTRL_MASK             0x000003FFu  /**< \brief (PICOP_CTRL) Register Bits Mask */

/* -------- PICOP_CMD : (PICOP Offset: 0x028) (R/W 32) Command -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct { // CMD mode
    uint32_t CMD:4;            /*!< bit:  0.. 3  Command                            */
    uint32_t :12;              /*!< bit:  4..15  Reserved                           */
    uint32_t UNLOCK:16;        /*!< bit: 16..31  Unlock                             */
  } CMD;                       /*!< Structure used for CMD                          */
  struct { // STATUS mode
    uint32_t CTTSEX:1;         /*!< bit:      0  Context Task Switch                */
    uint32_t IL0EX:1;          /*!< bit:      1  Interrupt Level 0 Exception        */
    uint32_t IL1EX:1;          /*!< bit:      2  Interrupt Level 1 Exception        */
    uint32_t IL2EX:1;          /*!< bit:      3  Interrupt Level 2 Exception        */
    uint32_t IL3EX:1;          /*!< bit:      4  Interrupt Level 3 Exception        */
    uint32_t IL4EX:1;          /*!< bit:      5  Interrupt Level 4 Exception        */
    uint32_t NMIEX:1;          /*!< bit:      6  NMI Exception                      */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t EXCEPT:1;         /*!< bit:      8  Exception                          */
    uint32_t AVR16:1;          /*!< bit:      9  AVR16 Mode                         */
    uint32_t OCDCOF:1;         /*!< bit:     10  OCD Change of Flow                 */
    uint32_t :5;               /*!< bit: 11..15  Reserved                           */
    uint32_t UPC:8;            /*!< bit: 16..23  Microcode State                    */
    uint32_t :3;               /*!< bit: 24..26  Reserved                           */
    uint32_t STATE:5;          /*!< bit: 27..31  System State                       */
  } STATUS;                    /*!< Structure used for STATUS                       */
  uint32_t reg;                /*!< Type      used for register access              */
} PICOP_CMD_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

