zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define PICOP_OCDSTATUS_OFFSET      0x058        /**< \brief (PICOP_OCDSTATUS offset) OCD Status and Command */
#define PICOP_OCDSTATUS_RESETVALUE  0x00000000   /**< \brief (PICOP_OCDSTATUS reset_value) OCD Status and Command */

// CMD mode
#define PICOP_OCDSTATUS_CMD_INST_Pos 0            /**< \brief (PICOP_OCDSTATUS_CMD) Instruction Override */
#define PICOP_OCDSTATUS_CMD_INST_Msk (0xFFFFu << PICOP_OCDSTATUS_CMD_INST_Pos)
#define PICOP_OCDSTATUS_CMD_INST(value) ((PICOP_OCDSTATUS_CMD_INST_Msk & ((value) << PICOP_OCDSTATUS_CMD_INST_Pos)))
#define PICOP_OCDSTATUS_CMD_MASK    0x0000FFFFu  /**< \brief (PICOP_OCDSTATUS_CMD) Register Bits Mask */

// STATUS mode
#define PICOP_OCDSTATUS_STATUS_BPEXT_Pos 1            /**< \brief (PICOP_OCDSTATUS_STATUS) External Breakpoint */
#define PICOP_OCDSTATUS_STATUS_BPEXT (0x1u << PICOP_OCDSTATUS_STATUS_BPEXT_Pos)
#define PICOP_OCDSTATUS_STATUS_BPSSTEP_Pos 2            /**< \brief (PICOP_OCDSTATUS_STATUS) Single Step Breakpoint */
#define PICOP_OCDSTATUS_STATUS_BPSSTEP (0x1u << PICOP_OCDSTATUS_STATUS_BPSSTEP_Pos)
#define PICOP_OCDSTATUS_STATUS_BPCOF_Pos 3            /**< \brief (PICOP_OCDSTATUS_STATUS) Change of Flow Breakpoint */
#define PICOP_OCDSTATUS_STATUS_BPCOF (0x1u << PICOP_OCDSTATUS_STATUS_BPCOF_Pos)
#define PICOP_OCDSTATUS_STATUS_BPRST_Pos 4            /**< \brief (PICOP_OCDSTATUS_STATUS) Reset Breakpoint */
#define PICOP_OCDSTATUS_STATUS_BPRST (0x1u << PICOP_OCDSTATUS_STATUS_BPRST_Pos)
#define PICOP_OCDSTATUS_STATUS_BPEXCEPTION_Pos 5            /**< \brief (PICOP_OCDSTATUS_STATUS) Exception Breakpoint */
#define PICOP_OCDSTATUS_STATUS_BPEXCEPTION (0x1u << PICOP_OCDSTATUS_STATUS_BPEXCEPTION_Pos)
#define PICOP_OCDSTATUS_STATUS_BPIRQ_Pos 6            /**< \brief (PICOP_OCDSTATUS_STATUS) Interrupt Request Breakpoint */
#define PICOP_OCDSTATUS_STATUS_BPIRQ (0x1u << PICOP_OCDSTATUS_STATUS_BPIRQ_Pos)
#define PICOP_OCDSTATUS_STATUS_BPSW_Pos 7            /**< \brief (PICOP_OCDSTATUS_STATUS) Software Breakpoint */
#define PICOP_OCDSTATUS_STATUS_BPSW (0x1u << PICOP_OCDSTATUS_STATUS_BPSW_Pos)
#define PICOP_OCDSTATUS_STATUS_BPSLEEP_Pos 8            /**< \brief (PICOP_OCDSTATUS_STATUS) Sleep Breakpoint */
#define PICOP_OCDSTATUS_STATUS_BPSLEEP (0x1u << PICOP_OCDSTATUS_STATUS_BPSLEEP_Pos)
#define PICOP_OCDSTATUS_STATUS_BPWDT_Pos 9            /**< \brief (PICOP_OCDSTATUS_STATUS) Watchdog Timer Breakpoint */
#define PICOP_OCDSTATUS_STATUS_BPWDT (0x1u << PICOP_OCDSTATUS_STATUS_BPWDT_Pos)
#define PICOP_OCDSTATUS_STATUS_BPISA_Pos 10           /**< \brief (PICOP_OCDSTATUS_STATUS) ISA Breakpoint */
#define PICOP_OCDSTATUS_STATUS_BPISA (0x1u << PICOP_OCDSTATUS_STATUS_BPISA_Pos)
#define PICOP_OCDSTATUS_STATUS_BPCOMP_Pos 12           /**< \brief (PICOP_OCDSTATUS_STATUS) Comparator Breakpoint */
#define PICOP_OCDSTATUS_STATUS_BPCOMP_Msk (0xFu << PICOP_OCDSTATUS_STATUS_BPCOMP_Pos)
#define PICOP_OCDSTATUS_STATUS_BPCOMP(value) ((PICOP_OCDSTATUS_STATUS_BPCOMP_Msk & ((value) << PICOP_OCDSTATUS_STATUS_BPCOMP_Pos)))
#define PICOP_OCDSTATUS_STATUS_MASK 0x0000F7FEu  /**< \brief (PICOP_OCDSTATUS_STATUS) Register Bits Mask */

/* -------- PICOP_OCDPC : (PICOP Offset: 0x05C) (R/W 32) ODC Program Counter -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t PC:16;            /*!< bit:  0..15  Program Counter                    */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PICOP_OCDPC_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PICOP_OCDPC_OFFSET          0x05C        /**< \brief (PICOP_OCDPC offset) ODC Program Counter */

#define PICOP_OCDPC_PC_Pos          0            /**< \brief (PICOP_OCDPC) Program Counter */
#define PICOP_OCDPC_PC_Msk          (0xFFFFu << PICOP_OCDPC_PC_Pos)
#define PICOP_OCDPC_PC(value)       ((PICOP_OCDPC_PC_Msk & ((value) << PICOP_OCDPC_PC_Pos)))
#define PICOP_OCDPC_MASK            0x0000FFFFu  /**< \brief (PICOP_OCDPC) Register Bits Mask */

/* -------- PICOP_OCDFEAT : (PICOP Offset: 0x060) (R/W 32) OCD Features -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t CCNT:2;           /*!< bit:  0.. 1  Cycle Counter                      */
    uint32_t BPGEN:2;          /*!< bit:  2.. 3  Breakpoint Generators              */
    uint32_t :28;              /*!< bit:  4..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PICOP_OCDFEAT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PICOP_OCDFEAT_OFFSET        0x060        /**< \brief (PICOP_OCDFEAT offset) OCD Features */
#define PICOP_OCDFEAT_RESETVALUE    0x00000000   /**< \brief (PICOP_OCDFEAT reset_value) OCD Features */

#define PICOP_OCDFEAT_CCNT_Pos      0            /**< \brief (PICOP_OCDFEAT) Cycle Counter */
#define PICOP_OCDFEAT_CCNT_Msk      (0x3u << PICOP_OCDFEAT_CCNT_Pos)
#define PICOP_OCDFEAT_CCNT(value)   ((PICOP_OCDFEAT_CCNT_Msk & ((value) << PICOP_OCDFEAT_CCNT_Pos)))
#define PICOP_OCDFEAT_BPGEN_Pos     2            /**< \brief (PICOP_OCDFEAT) Breakpoint Generators */
#define PICOP_OCDFEAT_BPGEN_Msk     (0x3u << PICOP_OCDFEAT_BPGEN_Pos)
#define PICOP_OCDFEAT_BPGEN(value)  ((PICOP_OCDFEAT_BPGEN_Msk & ((value) << PICOP_OCDFEAT_BPGEN_Pos)))
#define PICOP_OCDFEAT_MASK          0x0000000Fu  /**< \brief (PICOP_OCDFEAT) Register Bits Mask */

/* -------- PICOP_OCDCCNT : (PICOP Offset: 0x068) (R/W 32) OCD Cycle Counter -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t CCNT:32;          /*!< bit:  0..31  Cycle Count                        */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PICOP_OCDCCNT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PICOP_OCDCCNT_OFFSET        0x068        /**< \brief (PICOP_OCDCCNT offset) OCD Cycle Counter */
#define PICOP_OCDCCNT_RESETVALUE    0x00000000   /**< \brief (PICOP_OCDCCNT reset_value) OCD Cycle Counter */

