zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define PICOP_S11S10_R0_Pos         0            /**< \brief (PICOP_S11S10) Register 0 */
#define PICOP_S11S10_R0_Msk         (0xFFu << PICOP_S11S10_R0_Pos)
#define PICOP_S11S10_R0(value)      ((PICOP_S11S10_R0_Msk & ((value) << PICOP_S11S10_R0_Pos)))
#define PICOP_S11S10_R1_Pos         8            /**< \brief (PICOP_S11S10) Register 1 */
#define PICOP_S11S10_R1_Msk         (0xFFu << PICOP_S11S10_R1_Pos)
#define PICOP_S11S10_R1(value)      ((PICOP_S11S10_R1_Msk & ((value) << PICOP_S11S10_R1_Pos)))
#define PICOP_S11S10_R2_Pos         16           /**< \brief (PICOP_S11S10) Register 2 */
#define PICOP_S11S10_R2_Msk         (0xFFu << PICOP_S11S10_R2_Pos)
#define PICOP_S11S10_R2(value)      ((PICOP_S11S10_R2_Msk & ((value) << PICOP_S11S10_R2_Pos)))
#define PICOP_S11S10_R3_Pos         24           /**< \brief (PICOP_S11S10) Register 3 */
#define PICOP_S11S10_R3_Msk         (0xFFu << PICOP_S11S10_R3_Pos)
#define PICOP_S11S10_R3(value)      ((PICOP_S11S10_R3_Msk & ((value) << PICOP_S11S10_R3_Pos)))
#define PICOP_S11S10_MASK           0xFFFFFFFFu  /**< \brief (PICOP_S11S10) Register Bits Mask */

/* -------- PICOP_LINK : (PICOP Offset: 0x0B8) (R/W 32) Link -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} PICOP_LINK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PICOP_LINK_OFFSET           0x0B8        /**< \brief (PICOP_LINK offset) Link */
#define PICOP_LINK_MASK             0xFFFFFFFFu  /**< \brief (PICOP_LINK) Register Bits Mask */

/* -------- PICOP_SP : (PICOP Offset: 0x0BC) (R/W 32) Stack Pointer -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t R0:8;             /*!< bit:  0.. 7  Register 0                         */
    uint32_t R1:8;             /*!< bit:  8..15  Register 1                         */
    uint32_t R2:8;             /*!< bit: 16..23  Register 2                         */
    uint32_t R3:8;             /*!< bit: 24..31  Register 3                         */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PICOP_SP_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PICOP_SP_OFFSET             0x0BC        /**< \brief (PICOP_SP offset) Stack Pointer */

#define PICOP_SP_R0_Pos             0            /**< \brief (PICOP_SP) Register 0 */
#define PICOP_SP_R0_Msk             (0xFFu << PICOP_SP_R0_Pos)
#define PICOP_SP_R0(value)          ((PICOP_SP_R0_Msk & ((value) << PICOP_SP_R0_Pos)))
#define PICOP_SP_R1_Pos             8            /**< \brief (PICOP_SP) Register 1 */
#define PICOP_SP_R1_Msk             (0xFFu << PICOP_SP_R1_Pos)
#define PICOP_SP_R1(value)          ((PICOP_SP_R1_Msk & ((value) << PICOP_SP_R1_Pos)))
#define PICOP_SP_R2_Pos             16           /**< \brief (PICOP_SP) Register 2 */
#define PICOP_SP_R2_Msk             (0xFFu << PICOP_SP_R2_Pos)
#define PICOP_SP_R2(value)          ((PICOP_SP_R2_Msk & ((value) << PICOP_SP_R2_Pos)))
#define PICOP_SP_R3_Pos             24           /**< \brief (PICOP_SP) Register 3 */
#define PICOP_SP_R3_Msk             (0xFFu << PICOP_SP_R3_Pos)
#define PICOP_SP_R3(value)          ((PICOP_SP_R3_Msk & ((value) << PICOP_SP_R3_Pos)))
#define PICOP_SP_MASK               0xFFFFFFFFu  /**< \brief (PICOP_SP) Register Bits Mask */

/* -------- PICOP_MMUFLASH : (PICOP Offset: 0x100) (R/W 32) MMU mapping for flash -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ADDRESS:4;        /*!< bit:  0.. 3  MMU Flash Address                  */
    uint32_t :28;              /*!< bit:  4..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PICOP_MMUFLASH_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PICOP_MMUFLASH_OFFSET       0x100        /**< \brief (PICOP_MMUFLASH offset) MMU mapping for flash */
#define PICOP_MMUFLASH_RESETVALUE   0x00000000   /**< \brief (PICOP_MMUFLASH reset_value) MMU mapping for flash */

#define PICOP_MMUFLASH_ADDRESS_Pos  0            /**< \brief (PICOP_MMUFLASH) MMU Flash Address */
#define PICOP_MMUFLASH_ADDRESS_Msk  (0xFu << PICOP_MMUFLASH_ADDRESS_Pos)
#define PICOP_MMUFLASH_ADDRESS(value) ((PICOP_MMUFLASH_ADDRESS_Msk & ((value) << PICOP_MMUFLASH_ADDRESS_Pos)))
#define PICOP_MMUFLASH_MASK         0x0000000Fu  /**< \brief (PICOP_MMUFLASH) Register Bits Mask */

/* -------- PICOP_MMU0 : (PICOP Offset: 0x118) (R/W 32) MMU mapping user 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ADDRESS:32;       /*!< bit:  0..31  MMU User 0 Address                 */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PICOP_MMU0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PICOP_MMU0_OFFSET           0x118        /**< \brief (PICOP_MMU0 offset) MMU mapping user 0 */
#define PICOP_MMU0_RESETVALUE       0x00000000   /**< \brief (PICOP_MMU0 reset_value) MMU mapping user 0 */

#define PICOP_MMU0_ADDRESS_Pos      0            /**< \brief (PICOP_MMU0) MMU User 0 Address */
#define PICOP_MMU0_ADDRESS_Msk      (0xFFFFFFFFu << PICOP_MMU0_ADDRESS_Pos)
#define PICOP_MMU0_ADDRESS(value)   ((PICOP_MMU0_ADDRESS_Msk & ((value) << PICOP_MMU0_ADDRESS_Pos)))
#define PICOP_MMU0_MASK             0xFFFFFFFFu  /**< \brief (PICOP_MMU0) Register Bits Mask */

/* -------- PICOP_MMU1 : (PICOP Offset: 0x11C) (R/W 32) MMU mapping user 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ADDRESS:32;       /*!< bit:  0..31  MMU User 1 Address                 */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PICOP_MMU1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PICOP_MMU1_OFFSET           0x11C        /**< \brief (PICOP_MMU1 offset) MMU mapping user 1 */
#define PICOP_MMU1_RESETVALUE       0x00000000   /**< \brief (PICOP_MMU1 reset_value) MMU mapping user 1 */

#define PICOP_MMU1_ADDRESS_Pos      0            /**< \brief (PICOP_MMU1) MMU User 1 Address */
#define PICOP_MMU1_ADDRESS_Msk      (0xFFFFFFFFu << PICOP_MMU1_ADDRESS_Pos)
#define PICOP_MMU1_ADDRESS(value)   ((PICOP_MMU1_ADDRESS_Msk & ((value) << PICOP_MMU1_ADDRESS_Pos)))
#define PICOP_MMU1_MASK             0xFFFFFFFFu  /**< \brief (PICOP_MMU1) Register Bits Mask */

