zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define PM_INTENSET_PLRDY_Pos       0            /**< \brief (PM_INTENSET) Performance Level Ready interrupt Enable */
#define PM_INTENSET_PLRDY           (0x1u << PM_INTENSET_PLRDY_Pos)
#define PM_INTENSET_MASK            0x01u        /**< \brief (PM_INTENSET) Register Bits Mask */

/* -------- PM_INTFLAG : (PM Offset: 0x06) (R/W  8) Interrupt Flag Status and Clear -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  PLRDY:1;          /*!< bit:      0  Performance Level Ready            */
    uint8_t  :7;               /*!< bit:  1.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PM_INTFLAG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_INTFLAG_OFFSET           0x06         /**< \brief (PM_INTFLAG offset) Interrupt Flag Status and Clear */
#define PM_INTFLAG_RESETVALUE       0x00         /**< \brief (PM_INTFLAG reset_value) Interrupt Flag Status and Clear */

#define PM_INTFLAG_PLRDY_Pos        0            /**< \brief (PM_INTFLAG) Performance Level Ready */
#define PM_INTFLAG_PLRDY            (0x1u << PM_INTFLAG_PLRDY_Pos)
#define PM_INTFLAG_MASK             0x01u        /**< \brief (PM_INTFLAG) Register Bits Mask */

/* -------- PM_STDBYCFG : (PM Offset: 0x08) (R/W 16) Standby Configuration -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t PDCFG:2;          /*!< bit:  0.. 1  Power Domain Configuration         */
    uint16_t :2;               /*!< bit:  2.. 3  Reserved                           */
    uint16_t DPGPD0:1;         /*!< bit:      4  Dynamic Power Gating for PD0       */
    uint16_t DPGPD1:1;         /*!< bit:      5  Dynamic Power Gating for PD1       */
    uint16_t :1;               /*!< bit:      6  Reserved                           */
    uint16_t AVREGSD:1;        /*!< bit:      7  Automatic VREG Switching Disable   */
    uint16_t LINKPD:2;         /*!< bit:  8.. 9  Linked Power Domain                */
    uint16_t BBIASHS:2;        /*!< bit: 10..11  Back Bias for HMCRAMCHS            */
    uint16_t BBIASLP:2;        /*!< bit: 12..13  Back Bias for HMCRAMCLP            */
    uint16_t BBIASPP:2;        /*!< bit: 14..15  Back Bias for PicoPram             */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PM_STDBYCFG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_STDBYCFG_OFFSET          0x08         /**< \brief (PM_STDBYCFG offset) Standby Configuration */
#define PM_STDBYCFG_RESETVALUE      0x0000       /**< \brief (PM_STDBYCFG reset_value) Standby Configuration */

#define PM_STDBYCFG_PDCFG_Pos       0            /**< \brief (PM_STDBYCFG) Power Domain Configuration */
#define PM_STDBYCFG_PDCFG_Msk       (0x3u << PM_STDBYCFG_PDCFG_Pos)
#define PM_STDBYCFG_PDCFG(value)    ((PM_STDBYCFG_PDCFG_Msk & ((value) << PM_STDBYCFG_PDCFG_Pos)))
#define   PM_STDBYCFG_PDCFG_DEFAULT_Val   0x0u   /**< \brief (PM_STDBYCFG) All power domains switching is handled by hardware. */
#define   PM_STDBYCFG_PDCFG_PD0_Val       0x1u   /**< \brief (PM_STDBYCFG) PD0 is forced ACTIVE. PD1 and PD2 power domains switching is handled by hardware. */
#define   PM_STDBYCFG_PDCFG_PD01_Val      0x2u   /**< \brief (PM_STDBYCFG) PD0 and PD1 are forced ACTIVE. PD2 power domain switching is handled by hardware. */
#define   PM_STDBYCFG_PDCFG_PD012_Val     0x3u   /**< \brief (PM_STDBYCFG) All power domains are forced ACTIVE. */
#define PM_STDBYCFG_PDCFG_DEFAULT   (PM_STDBYCFG_PDCFG_DEFAULT_Val << PM_STDBYCFG_PDCFG_Pos)
#define PM_STDBYCFG_PDCFG_PD0       (PM_STDBYCFG_PDCFG_PD0_Val     << PM_STDBYCFG_PDCFG_Pos)
#define PM_STDBYCFG_PDCFG_PD01      (PM_STDBYCFG_PDCFG_PD01_Val    << PM_STDBYCFG_PDCFG_Pos)
#define PM_STDBYCFG_PDCFG_PD012     (PM_STDBYCFG_PDCFG_PD012_Val   << PM_STDBYCFG_PDCFG_Pos)
#define PM_STDBYCFG_DPGPD0_Pos      4            /**< \brief (PM_STDBYCFG) Dynamic Power Gating for PD0 */
#define PM_STDBYCFG_DPGPD0          (0x1u << PM_STDBYCFG_DPGPD0_Pos)
#define PM_STDBYCFG_DPGPD1_Pos      5            /**< \brief (PM_STDBYCFG) Dynamic Power Gating for PD1 */
#define PM_STDBYCFG_DPGPD1          (0x1u << PM_STDBYCFG_DPGPD1_Pos)
#define PM_STDBYCFG_AVREGSD_Pos     7            /**< \brief (PM_STDBYCFG) Automatic VREG Switching Disable */
#define PM_STDBYCFG_AVREGSD         (0x1u << PM_STDBYCFG_AVREGSD_Pos)
#define PM_STDBYCFG_LINKPD_Pos      8            /**< \brief (PM_STDBYCFG) Linked Power Domain */
#define PM_STDBYCFG_LINKPD_Msk      (0x3u << PM_STDBYCFG_LINKPD_Pos)
#define PM_STDBYCFG_LINKPD(value)   ((PM_STDBYCFG_LINKPD_Msk & ((value) << PM_STDBYCFG_LINKPD_Pos)))
#define   PM_STDBYCFG_LINKPD_DEFAULT_Val  0x0u   /**< \brief (PM_STDBYCFG) Power domains are not linked */
#define   PM_STDBYCFG_LINKPD_PD01_Val     0x1u   /**< \brief (PM_STDBYCFG) PD0 and PD1 power domains are linked */
#define   PM_STDBYCFG_LINKPD_PD12_Val     0x2u   /**< \brief (PM_STDBYCFG) PD1 and PD2 power domains are linked */
#define   PM_STDBYCFG_LINKPD_PD012_Val    0x3u   /**< \brief (PM_STDBYCFG) All power domains are linked */
#define PM_STDBYCFG_LINKPD_DEFAULT  (PM_STDBYCFG_LINKPD_DEFAULT_Val << PM_STDBYCFG_LINKPD_Pos)
#define PM_STDBYCFG_LINKPD_PD01     (PM_STDBYCFG_LINKPD_PD01_Val   << PM_STDBYCFG_LINKPD_Pos)
#define PM_STDBYCFG_LINKPD_PD12     (PM_STDBYCFG_LINKPD_PD12_Val   << PM_STDBYCFG_LINKPD_Pos)
#define PM_STDBYCFG_LINKPD_PD012    (PM_STDBYCFG_LINKPD_PD012_Val  << PM_STDBYCFG_LINKPD_Pos)
#define PM_STDBYCFG_BBIASHS_Pos     10           /**< \brief (PM_STDBYCFG) Back Bias for HMCRAMCHS */
#define PM_STDBYCFG_BBIASHS_Msk     (0x3u << PM_STDBYCFG_BBIASHS_Pos)
#define PM_STDBYCFG_BBIASHS(value)  ((PM_STDBYCFG_BBIASHS_Msk & ((value) << PM_STDBYCFG_BBIASHS_Pos)))
#define PM_STDBYCFG_BBIASLP_Pos     12           /**< \brief (PM_STDBYCFG) Back Bias for HMCRAMCLP */
#define PM_STDBYCFG_BBIASLP_Msk     (0x3u << PM_STDBYCFG_BBIASLP_Pos)
#define PM_STDBYCFG_BBIASLP(value)  ((PM_STDBYCFG_BBIASLP_Msk & ((value) << PM_STDBYCFG_BBIASLP_Pos)))
#define PM_STDBYCFG_BBIASPP_Pos     14           /**< \brief (PM_STDBYCFG) Back Bias for PicoPram */
#define PM_STDBYCFG_BBIASPP_Msk     (0x3u << PM_STDBYCFG_BBIASPP_Pos)
#define PM_STDBYCFG_BBIASPP(value)  ((PM_STDBYCFG_BBIASPP_Msk & ((value) << PM_STDBYCFG_BBIASPP_Pos)))
#define PM_STDBYCFG_MASK            0xFFB3u      /**< \brief (PM_STDBYCFG) Register Bits Mask */

/* -------- PM_RINGOSC : (PM Offset: 0x0A) (R/W  8) Ring Oscillator Depth Configuration -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  SRINGOSC:2;       /*!< bit:  0.. 1  Standby Ring Oscillator Size Depth */
    uint8_t  :2;               /*!< bit:  2.. 3  Reserved                           */
    uint8_t  BRINGOSC:2;       /*!< bit:  4.. 5  Backup Ring Oscillator Size Depth  */
    uint8_t  :2;               /*!< bit:  6.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PM_RINGOSC_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_RINGOSC_OFFSET           0x0A         /**< \brief (PM_RINGOSC offset) Ring Oscillator Depth Configuration */
#define PM_RINGOSC_RESETVALUE       0x00         /**< \brief (PM_RINGOSC reset_value) Ring Oscillator Depth Configuration */

#define PM_RINGOSC_SRINGOSC_Pos     0            /**< \brief (PM_RINGOSC) Standby Ring Oscillator Size Depth */
#define PM_RINGOSC_SRINGOSC_Msk     (0x3u << PM_RINGOSC_SRINGOSC_Pos)
#define PM_RINGOSC_SRINGOSC(value)  ((PM_RINGOSC_SRINGOSC_Msk & ((value) << PM_RINGOSC_SRINGOSC_Pos)))
#define   PM_RINGOSC_SRINGOSC_DLY0_Val    0x0u   /**< \brief (PM_RINGOSC) Ring oscillator depth is default */
#define   PM_RINGOSC_SRINGOSC_DLY1_Val    0x1u   /**< \brief (PM_RINGOSC) Ring oscillator depth is default + 1 ORDLY15 */
#define   PM_RINGOSC_SRINGOSC_DLY2_Val    0x2u   /**< \brief (PM_RINGOSC) Ring oscillator depth is default + 2 ORDLY15 */
#define   PM_RINGOSC_SRINGOSC_DLY3_Val    0x3u   /**< \brief (PM_RINGOSC) Ring oscillator depth is default + 3 ORDLY15 */
#define PM_RINGOSC_SRINGOSC_DLY0    (PM_RINGOSC_SRINGOSC_DLY0_Val  << PM_RINGOSC_SRINGOSC_Pos)
#define PM_RINGOSC_SRINGOSC_DLY1    (PM_RINGOSC_SRINGOSC_DLY1_Val  << PM_RINGOSC_SRINGOSC_Pos)
#define PM_RINGOSC_SRINGOSC_DLY2    (PM_RINGOSC_SRINGOSC_DLY2_Val  << PM_RINGOSC_SRINGOSC_Pos)
#define PM_RINGOSC_SRINGOSC_DLY3    (PM_RINGOSC_SRINGOSC_DLY3_Val  << PM_RINGOSC_SRINGOSC_Pos)
#define PM_RINGOSC_BRINGOSC_Pos     4            /**< \brief (PM_RINGOSC) Backup Ring Oscillator Size Depth */
#define PM_RINGOSC_BRINGOSC_Msk     (0x3u << PM_RINGOSC_BRINGOSC_Pos)
#define PM_RINGOSC_BRINGOSC(value)  ((PM_RINGOSC_BRINGOSC_Msk & ((value) << PM_RINGOSC_BRINGOSC_Pos)))
#define   PM_RINGOSC_BRINGOSC_DLY0_Val    0x0u   /**< \brief (PM_RINGOSC) Ring oscillator depth is default */
#define   PM_RINGOSC_BRINGOSC_DLY1_Val    0x1u   /**< \brief (PM_RINGOSC) Ring oscillator depth is default + 1 ORDLY15 */
#define   PM_RINGOSC_BRINGOSC_DLY2_Val    0x2u   /**< \brief (PM_RINGOSC) Ring oscillator depth is default + 2 ORDLY15 */
#define   PM_RINGOSC_BRINGOSC_DLY3_Val    0x3u   /**< \brief (PM_RINGOSC) Ring oscillator depth is default + 3 ORDLY15 */
#define PM_RINGOSC_BRINGOSC_DLY0    (PM_RINGOSC_BRINGOSC_DLY0_Val  << PM_RINGOSC_BRINGOSC_Pos)
#define PM_RINGOSC_BRINGOSC_DLY1    (PM_RINGOSC_BRINGOSC_DLY1_Val  << PM_RINGOSC_BRINGOSC_Pos)
#define PM_RINGOSC_BRINGOSC_DLY2    (PM_RINGOSC_BRINGOSC_DLY2_Val  << PM_RINGOSC_BRINGOSC_Pos)
#define PM_RINGOSC_BRINGOSC_DLY3    (PM_RINGOSC_BRINGOSC_DLY3_Val  << PM_RINGOSC_BRINGOSC_Pos)
#define PM_RINGOSC_MASK             0x33u        /**< \brief (PM_RINGOSC) Register Bits Mask */

/* -------- PM_GSTAT : (PM Offset: 0x0B) (R/   8) Global Status -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  FSMSTAT:4;        /*!< bit:  0.. 3  FSM Status                         */
    uint8_t  :4;               /*!< bit:  4.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PM_GSTAT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_GSTAT_OFFSET             0x0B         /**< \brief (PM_GSTAT offset) Global Status */
#define PM_GSTAT_RESETVALUE         0x00         /**< \brief (PM_GSTAT reset_value) Global Status */

#define PM_GSTAT_FSMSTAT_Pos        0            /**< \brief (PM_GSTAT) FSM Status */
#define PM_GSTAT_FSMSTAT_Msk        (0xFu << PM_GSTAT_FSMSTAT_Pos)
#define PM_GSTAT_FSMSTAT(value)     ((PM_GSTAT_FSMSTAT_Msk & ((value) << PM_GSTAT_FSMSTAT_Pos)))
#define PM_GSTAT_MASK               0x0Fu        /**< \brief (PM_GSTAT) Register Bits Mask */

/* -------- PM_PWSAKDLY : (PM Offset: 0x0C) (R/W  8) Power Switch Acknowledge Delay -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  DLYVAL:7;         /*!< bit:  0.. 6  Delay Value                        */
    uint8_t  IGNACK:1;         /*!< bit:      7  Ignore Acknowledge                 */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PM_PWSAKDLY_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_PWSAKDLY_OFFSET          0x0C         /**< \brief (PM_PWSAKDLY offset) Power Switch Acknowledge Delay */
#define PM_PWSAKDLY_RESETVALUE      0x00         /**< \brief (PM_PWSAKDLY reset_value) Power Switch Acknowledge Delay */

#define PM_PWSAKDLY_DLYVAL_Pos      0            /**< \brief (PM_PWSAKDLY) Delay Value */
#define PM_PWSAKDLY_DLYVAL_Msk      (0x7Fu << PM_PWSAKDLY_DLYVAL_Pos)
#define PM_PWSAKDLY_DLYVAL(value)   ((PM_PWSAKDLY_DLYVAL_Msk & ((value) << PM_PWSAKDLY_DLYVAL_Pos)))
#define PM_PWSAKDLY_IGNACK_Pos      7            /**< \brief (PM_PWSAKDLY) Ignore Acknowledge */
#define PM_PWSAKDLY_IGNACK          (0x1u << PM_PWSAKDLY_IGNACK_Pos)
#define PM_PWSAKDLY_MASK            0xFFu        /**< \brief (PM_PWSAKDLY) Register Bits Mask */

/* -------- PM_STATPD : (PM Offset: 0x10) (R/  32) Status of Power domain n -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t AHB:1;            /*!< bit:      0  AHB request                        */
    uint32_t APB:1;            /*!< bit:      1  APB request                        */
    uint32_t GCLK:1;           /*!< bit:      2  GCLK request                       */
    uint32_t EVTUSER:1;        /*!< bit:      3  User event                         */
    uint32_t EVTGEN:1;         /*!< bit:      4  Gen event                          */
    uint32_t WAKEPP:1;         /*!< bit:      5  Wake from picoproc                 */
    uint32_t PWSACK:1;         /*!< bit:      6  Power Switch Acknowledge signal    */
    uint32_t PWREQ:1;          /*!< bit:      7  Power request                      */
    uint32_t OSCRDY:1;         /*!< bit:      8  Oscillator ready                   */
    uint32_t FORCE:1;          /*!< bit:      9  Power domain is forced             */
    uint32_t MCLK:1;           /*!< bit:     10  MCLK activity                      */
    uint32_t PDSTATE:4;        /*!< bit: 11..14  Power Domain State                 */
    uint32_t MCLKOFF:1;        /*!< bit:     15  MCLK ON/OFF                        */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_STATPD_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_STATPD_OFFSET            0x10         /**< \brief (PM_STATPD offset) Status of Power domain n */
#define PM_STATPD_RESETVALUE        0x00000000   /**< \brief (PM_STATPD reset_value) Status of Power domain n */

#define PM_STATPD_AHB_Pos           0            /**< \brief (PM_STATPD) AHB request */
#define PM_STATPD_AHB               (0x1u << PM_STATPD_AHB_Pos)
#define PM_STATPD_APB_Pos           1            /**< \brief (PM_STATPD) APB request */
#define PM_STATPD_APB               (0x1u << PM_STATPD_APB_Pos)
#define PM_STATPD_GCLK_Pos          2            /**< \brief (PM_STATPD) GCLK request */
#define PM_STATPD_GCLK              (0x1u << PM_STATPD_GCLK_Pos)
#define PM_STATPD_EVTUSER_Pos       3            /**< \brief (PM_STATPD) User event */
#define PM_STATPD_EVTUSER           (0x1u << PM_STATPD_EVTUSER_Pos)
#define PM_STATPD_EVTGEN_Pos        4            /**< \brief (PM_STATPD) Gen event */
#define PM_STATPD_EVTGEN            (0x1u << PM_STATPD_EVTGEN_Pos)
#define PM_STATPD_WAKEPP_Pos        5            /**< \brief (PM_STATPD) Wake from picoproc */
#define PM_STATPD_WAKEPP            (0x1u << PM_STATPD_WAKEPP_Pos)
#define PM_STATPD_PWSACK_Pos        6            /**< \brief (PM_STATPD) Power Switch Acknowledge signal */
#define PM_STATPD_PWSACK            (0x1u << PM_STATPD_PWSACK_Pos)
#define PM_STATPD_PWREQ_Pos         7            /**< \brief (PM_STATPD) Power request */
#define PM_STATPD_PWREQ             (0x1u << PM_STATPD_PWREQ_Pos)
#define PM_STATPD_OSCRDY_Pos        8            /**< \brief (PM_STATPD) Oscillator ready */
#define PM_STATPD_OSCRDY            (0x1u << PM_STATPD_OSCRDY_Pos)
#define PM_STATPD_FORCE_Pos         9            /**< \brief (PM_STATPD) Power domain is forced */
#define PM_STATPD_FORCE             (0x1u << PM_STATPD_FORCE_Pos)
#define PM_STATPD_MCLK_Pos          10           /**< \brief (PM_STATPD) MCLK activity */
#define PM_STATPD_MCLK              (0x1u << PM_STATPD_MCLK_Pos)
#define PM_STATPD_PDSTATE_Pos       11           /**< \brief (PM_STATPD) Power Domain State */
#define PM_STATPD_PDSTATE_Msk       (0xFu << PM_STATPD_PDSTATE_Pos)
#define PM_STATPD_PDSTATE(value)    ((PM_STATPD_PDSTATE_Msk & ((value) << PM_STATPD_PDSTATE_Pos)))
#define   PM_STATPD_PDSTATE_ACTIVE_Val    0x0u   /**< \brief (PM_STATPD) Power domain is active */
#define   PM_STATPD_PDSTATE_WAIT_STOP_CLK_Val 0x1u   /**< \brief (PM_STATPD) Wait until clocks are stopped */
#define   PM_STATPD_PDSTATE_RET_SAVE_Val  0x2u   /**< \brief (PM_STATPD) Power domain is going to retention: logic is retained */
#define   PM_STATPD_PDSTATE_RET_RESET_Val 0x3u   /**< \brief (PM_STATPD) Power domain is going to retention: reset is asserted (not used) */
#define   PM_STATPD_PDSTATE_RET_PWR_OFF_Val 0x4u   /**< \brief (PM_STATPD) Power domain is in RETENTION- power switch is OFF */
#define   PM_STATPD_PDSTATE_RET_PWR_ON_Val 0x5u   /**< \brief (PM_STATPD) exiting retention, power-switch is ON */
#define   PM_STATPD_PDSTATE_RET_RST_RLS_Val 0x6u   /**< \brief (PM_STATPD) exiting retention, reset is released */
#define   PM_STATPD_PDSTATE_RET_RESTORE_Val 0x7u   /**< \brief (PM_STATPD) exiting retention, logic is restored */
#define   PM_STATPD_PDSTATE_RET_START_CLK_Val 0x8u   /**< \brief (PM_STATPD) exiting retention, clocks can be turn ON. */
#define PM_STATPD_PDSTATE_ACTIVE    (PM_STATPD_PDSTATE_ACTIVE_Val  << PM_STATPD_PDSTATE_Pos)
#define PM_STATPD_PDSTATE_WAIT_STOP_CLK (PM_STATPD_PDSTATE_WAIT_STOP_CLK_Val << PM_STATPD_PDSTATE_Pos)
#define PM_STATPD_PDSTATE_RET_SAVE  (PM_STATPD_PDSTATE_RET_SAVE_Val << PM_STATPD_PDSTATE_Pos)
#define PM_STATPD_PDSTATE_RET_RESET (PM_STATPD_PDSTATE_RET_RESET_Val << PM_STATPD_PDSTATE_Pos)
#define PM_STATPD_PDSTATE_RET_PWR_OFF (PM_STATPD_PDSTATE_RET_PWR_OFF_Val << PM_STATPD_PDSTATE_Pos)
#define PM_STATPD_PDSTATE_RET_PWR_ON (PM_STATPD_PDSTATE_RET_PWR_ON_Val << PM_STATPD_PDSTATE_Pos)
#define PM_STATPD_PDSTATE_RET_RST_RLS (PM_STATPD_PDSTATE_RET_RST_RLS_Val << PM_STATPD_PDSTATE_Pos)
#define PM_STATPD_PDSTATE_RET_RESTORE (PM_STATPD_PDSTATE_RET_RESTORE_Val << PM_STATPD_PDSTATE_Pos)
#define PM_STATPD_PDSTATE_RET_START_CLK (PM_STATPD_PDSTATE_RET_START_CLK_Val << PM_STATPD_PDSTATE_Pos)
#define PM_STATPD_MCLKOFF_Pos       15           /**< \brief (PM_STATPD) MCLK ON/OFF */
#define PM_STATPD_MCLKOFF           (0x1u << PM_STATPD_MCLKOFF_Pos)
#define PM_STATPD_MASK              0x0000FFFFu  /**< \brief (PM_STATPD) Register Bits Mask */

