zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
/* -------- PM_TEST : (PM Offset: 0x20) (R/W  8) Test -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  SRINGOSC:1;       /*!< bit:      0  Standby Ring Osc Test Enable       */
    uint8_t  BRINGOSC:1;       /*!< bit:      1  Backup Ring Osc Test Enable        */
    uint8_t  DBGSIGEN:1;       /*!< bit:      2  Debug Signals Enable               */
    uint8_t  FORCEOSC:1;       /*!< bit:      3  Force Ring Oscillator              */
    uint8_t  PDINDEX:2;        /*!< bit:  4.. 5  Power Domain Index                 */
    uint8_t  IGNDBG:1;         /*!< bit:      6  Ignored Debugger                   */
    uint8_t  TESTMOD:1;        /*!< bit:      7  Test Mode Enable                   */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PM_TEST_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_TEST_OFFSET              0x20         /**< \brief (PM_TEST offset) Test */
#define PM_TEST_RESETVALUE          0x00         /**< \brief (PM_TEST reset_value) Test */

#define PM_TEST_SRINGOSC_Pos        0            /**< \brief (PM_TEST) Standby Ring Osc Test Enable */
#define PM_TEST_SRINGOSC            (0x1u << PM_TEST_SRINGOSC_Pos)
#define PM_TEST_BRINGOSC_Pos        1            /**< \brief (PM_TEST) Backup Ring Osc Test Enable */
#define PM_TEST_BRINGOSC            (0x1u << PM_TEST_BRINGOSC_Pos)
#define PM_TEST_DBGSIGEN_Pos        2            /**< \brief (PM_TEST) Debug Signals Enable */
#define PM_TEST_DBGSIGEN            (0x1u << PM_TEST_DBGSIGEN_Pos)
#define PM_TEST_FORCEOSC_Pos        3            /**< \brief (PM_TEST) Force Ring Oscillator */
#define PM_TEST_FORCEOSC            (0x1u << PM_TEST_FORCEOSC_Pos)
#define PM_TEST_PDINDEX_Pos         4            /**< \brief (PM_TEST) Power Domain Index */
#define PM_TEST_PDINDEX_Msk         (0x3u << PM_TEST_PDINDEX_Pos)
#define PM_TEST_PDINDEX(value)      ((PM_TEST_PDINDEX_Msk & ((value) << PM_TEST_PDINDEX_Pos)))
#define PM_TEST_IGNDBG_Pos          6            /**< \brief (PM_TEST) Ignored Debugger */
#define PM_TEST_IGNDBG              (0x1u << PM_TEST_IGNDBG_Pos)
#define PM_TEST_TESTMOD_Pos         7            /**< \brief (PM_TEST) Test Mode Enable */
#define PM_TEST_TESTMOD             (0x1u << PM_TEST_TESTMOD_Pos)
#define PM_TEST_MASK                0xFFu        /**< \brief (PM_TEST) Register Bits Mask */

/** \brief PM hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  __IO PM_CTRLA_Type             CTRLA;       /**< \brief Offset: 0x00 (R/W  8) Control A */
  __IO PM_SLEEPCFG_Type          SLEEPCFG;    /**< \brief Offset: 0x01 (R/W  8) Sleep Configuration */
  __IO PM_PLCFG_Type             PLCFG;       /**< \brief Offset: 0x02 (R/W  8) Performance Level Configuration */
       RoReg8                    Reserved1[0x1];
  __IO PM_INTENCLR_Type          INTENCLR;    /**< \brief Offset: 0x04 (R/W  8) Interrupt Enable Clear */
  __IO PM_INTENSET_Type          INTENSET;    /**< \brief Offset: 0x05 (R/W  8) Interrupt Enable Set */
  __IO PM_INTFLAG_Type           INTFLAG;     /**< \brief Offset: 0x06 (R/W  8) Interrupt Flag Status and Clear */
       RoReg8                    Reserved2[0x1];
  __IO PM_STDBYCFG_Type          STDBYCFG;    /**< \brief Offset: 0x08 (R/W 16) Standby Configuration */
  __IO PM_RINGOSC_Type           RINGOSC;     /**< \brief Offset: 0x0A (R/W  8) Ring Oscillator Depth Configuration */
  __I  PM_GSTAT_Type             GSTAT;       /**< \brief Offset: 0x0B (R/   8) Global Status */
  __IO PM_PWSAKDLY_Type          PWSAKDLY;    /**< \brief Offset: 0x0C (R/W  8) Power Switch Acknowledge Delay */
       RoReg8                    Reserved3[0x3];
  __I  PM_STATPD_Type            STATPD[3];   /**< \brief Offset: 0x10 (R/  32) Status of Power domain n */
       RoReg8                    Reserved4[0x4];
  __IO PM_TEST_Type              TEST;        /**< \brief Offset: 0x20 (R/W  8) Test */
} Pm;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR PORT */
/* ========================================================================== */
/** \addtogroup U3005_PORT Port Module */
/*@{*/

#define PORT_U2210
#define REV_PORT                    0x200

/* -------- PORT_DIR : (PORT Offset: 0x00) (R/W 32) Data Direction -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} PORT_DIR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PORT_DIR_OFFSET             0x00         /**< \brief (PORT_DIR offset) Data Direction */
#define PORT_DIR_RESETVALUE         0x00000000   /**< \brief (PORT_DIR reset_value) Data Direction */
#define PORT_DIR_MASK               0xFFFFFFFFu  /**< \brief (PORT_DIR) Register Bits Mask */

/* -------- PORT_DIRCLR : (PORT Offset: 0x04) (R/W 32) Data Direction Clear -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} PORT_DIRCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PORT_DIRCLR_OFFSET          0x04         /**< \brief (PORT_DIRCLR offset) Data Direction Clear */
#define PORT_DIRCLR_RESETVALUE      0x00000000   /**< \brief (PORT_DIRCLR reset_value) Data Direction Clear */
#define PORT_DIRCLR_MASK            0xFFFFFFFFu  /**< \brief (PORT_DIRCLR) Register Bits Mask */

/* -------- PORT_DIRSET : (PORT Offset: 0x08) (R/W 32) Data Direction Set -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} PORT_DIRSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

