zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define PORT_PINCFG_PMUXEN_Pos      0            /**< \brief (PORT_PINCFG) Select Peripheral Multiplexer */
#define PORT_PINCFG_PMUXEN          (0x1u << PORT_PINCFG_PMUXEN_Pos)
#define PORT_PINCFG_INEN_Pos        1            /**< \brief (PORT_PINCFG) Input Enable */
#define PORT_PINCFG_INEN            (0x1u << PORT_PINCFG_INEN_Pos)
#define PORT_PINCFG_PULLEN_Pos      2            /**< \brief (PORT_PINCFG) Pull Enable */
#define PORT_PINCFG_PULLEN          (0x1u << PORT_PINCFG_PULLEN_Pos)
#define PORT_PINCFG_DRVSTR_Pos      6            /**< \brief (PORT_PINCFG) Output Driver Strength Selection */
#define PORT_PINCFG_DRVSTR          (0x1u << PORT_PINCFG_DRVSTR_Pos)
#define PORT_PINCFG_MASK            0x47u        /**< \brief (PORT_PINCFG) Register Bits Mask */

/** \brief PortGroup hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  __IO PORT_DIR_Type             DIR;         /**< \brief Offset: 0x00 (R/W 32) Data Direction */
  __IO PORT_DIRCLR_Type          DIRCLR;      /**< \brief Offset: 0x04 (R/W 32) Data Direction Clear */
  __IO PORT_DIRSET_Type          DIRSET;      /**< \brief Offset: 0x08 (R/W 32) Data Direction Set */
  __IO PORT_DIRTGL_Type          DIRTGL;      /**< \brief Offset: 0x0C (R/W 32) Data Direction Toggle */
  __IO PORT_OUT_Type             OUT;         /**< \brief Offset: 0x10 (R/W 32) Data Output Value */
  __IO PORT_OUTCLR_Type          OUTCLR;      /**< \brief Offset: 0x14 (R/W 32) Data Output Value Clear */
  __IO PORT_OUTSET_Type          OUTSET;      /**< \brief Offset: 0x18 (R/W 32) Data Output Value Set */
  __IO PORT_OUTTGL_Type          OUTTGL;      /**< \brief Offset: 0x1C (R/W 32) Data Output Value Toggle */
  __I  PORT_IN_Type              IN;          /**< \brief Offset: 0x20 (R/  32) Data Input Value */
  __IO PORT_CTRL_Type            CTRL;        /**< \brief Offset: 0x24 (R/W 32) Control */
  __O  PORT_WRCONFIG_Type        WRCONFIG;    /**< \brief Offset: 0x28 ( /W 32) Write Configuration */
  __IO PORT_EVCTRL_Type          EVCTRL;      /**< \brief Offset: 0x2C (R/W 32) Event Input Control */
  __IO PORT_PMUX_Type            PMUX[16];    /**< \brief Offset: 0x30 (R/W  8) Peripheral Multiplexing n */
  __IO PORT_PINCFG_Type          PINCFG[32];  /**< \brief Offset: 0x40 (R/W  8) Pin Configuration n */
       RoReg8                    Reserved1[0x20];
} PortGroup;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief PORT hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
       PortGroup                 Group[3];    /**< \brief Offset: 0x00 PortGroup groups */
} Port;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#ifdef __GNUC__
 #define SECTION_PORT_IOBUS
#endif

/*@}*/

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR PTC */
/* ========================================================================== */
/** \addtogroup U3005_PTC Peripheral Touch Controller */
/*@{*/

#define PTC_U2215
#define REV_PTC                     0x200

/* -------- PTC_CTRLA : (PTC Offset: 0x00) (R/W  8) Control A -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  SWRST:1;          /*!< bit:      0  Software Reset                     */
    uint8_t  ENABLE:1;         /*!< bit:      1  Enable                             */
    uint8_t  RUNSTDBY:1;       /*!< bit:      2  Run in Standby                     */
    uint8_t  :5;               /*!< bit:  3.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_CTRLA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_CTRLA_OFFSET            0x00         /**< \brief (PTC_CTRLA offset) Control A */
#define PTC_CTRLA_RESETVALUE        0x00         /**< \brief (PTC_CTRLA reset_value) Control A */

#define PTC_CTRLA_SWRST_Pos         0            /**< \brief (PTC_CTRLA) Software Reset */
#define PTC_CTRLA_SWRST             (0x1u << PTC_CTRLA_SWRST_Pos)
#define PTC_CTRLA_ENABLE_Pos        1            /**< \brief (PTC_CTRLA) Enable */
#define PTC_CTRLA_ENABLE            (0x1u << PTC_CTRLA_ENABLE_Pos)
#define PTC_CTRLA_RUNSTDBY_Pos      2            /**< \brief (PTC_CTRLA) Run in Standby */
#define PTC_CTRLA_RUNSTDBY          (0x1u << PTC_CTRLA_RUNSTDBY_Pos)
#define PTC_CTRLA_MASK              0x07u        /**< \brief (PTC_CTRLA) Register Bits Mask */

/* -------- PTC_STATUS : (PTC Offset: 0x01) (R/   8) Status -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  :7;               /*!< bit:  0.. 6  Reserved                           */
    uint8_t  SYNCBUSY:1;       /*!< bit:      7  Synchronization Busy Status        */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_STATUS_OFFSET           0x01         /**< \brief (PTC_STATUS offset) Status */
#define PTC_STATUS_RESETVALUE       0x00         /**< \brief (PTC_STATUS reset_value) Status */

#define PTC_STATUS_SYNCBUSY_Pos     7            /**< \brief (PTC_STATUS) Synchronization Busy Status */
#define PTC_STATUS_SYNCBUSY         (0x1u << PTC_STATUS_SYNCBUSY_Pos)
#define PTC_STATUS_MASK             0x80u        /**< \brief (PTC_STATUS) Register Bits Mask */

/* -------- PTC_CTRLB : (PTC Offset: 0x04) (R/W  8) Control B -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  PRSC:2;           /*!< bit:  0.. 1  Clock Prescaler                    */
    uint8_t  FREERUN:1;        /*!< bit:      2  Free Running                       */
    uint8_t  ADRS:1;           /*!< bit:      3  ADC Resolution                     */
    uint8_t  :4;               /*!< bit:  4.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_CTRLB_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_CTRLB_OFFSET            0x04         /**< \brief (PTC_CTRLB offset) Control B */
#define PTC_CTRLB_RESETVALUE        0x00         /**< \brief (PTC_CTRLB reset_value) Control B */

#define PTC_CTRLB_PRSC_Pos          0            /**< \brief (PTC_CTRLB) Clock Prescaler */
#define PTC_CTRLB_PRSC_Msk          (0x3u << PTC_CTRLB_PRSC_Pos)
#define PTC_CTRLB_PRSC(value)       ((PTC_CTRLB_PRSC_Msk & ((value) << PTC_CTRLB_PRSC_Pos)))
#define   PTC_CTRLB_PRSC_OFF_Val          0x0u   /**< \brief (PTC_CTRLB) No division */
#define   PTC_CTRLB_PRSC_DIV2_Val         0x1u   /**< \brief (PTC_CTRLB) Peripheral clock divided by 2 */
#define   PTC_CTRLB_PRSC_DIV4_Val         0x2u   /**< \brief (PTC_CTRLB) Peripheral clock divided by 4 */
#define   PTC_CTRLB_PRSC_DIV8_Val         0x3u   /**< \brief (PTC_CTRLB) Peripheral clock divided by 8 */
#define PTC_CTRLB_PRSC_OFF          (PTC_CTRLB_PRSC_OFF_Val        << PTC_CTRLB_PRSC_Pos)
#define PTC_CTRLB_PRSC_DIV2         (PTC_CTRLB_PRSC_DIV2_Val       << PTC_CTRLB_PRSC_Pos)
#define PTC_CTRLB_PRSC_DIV4         (PTC_CTRLB_PRSC_DIV4_Val       << PTC_CTRLB_PRSC_Pos)
#define PTC_CTRLB_PRSC_DIV8         (PTC_CTRLB_PRSC_DIV8_Val       << PTC_CTRLB_PRSC_Pos)
#define PTC_CTRLB_FREERUN_Pos       2            /**< \brief (PTC_CTRLB) Free Running */
#define PTC_CTRLB_FREERUN           (0x1u << PTC_CTRLB_FREERUN_Pos)
#define PTC_CTRLB_ADRS_Pos          3            /**< \brief (PTC_CTRLB) ADC Resolution */
#define PTC_CTRLB_ADRS              (0x1u << PTC_CTRLB_ADRS_Pos)
#define PTC_CTRLB_MASK              0x0Fu        /**< \brief (PTC_CTRLB) Register Bits Mask */

/* -------- PTC_EVCTRL : (PTC Offset: 0x05) (R/W  8) Event Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  STCONVEI:1;       /*!< bit:      0  Start Conversion Event Input Enable */
    uint8_t  EOCEO:1;          /*!< bit:      1  End of Conversion Event Output Enable */
    uint8_t  WCOMPEO:1;        /*!< bit:      2  Window Comparator Event Output Enable */
    uint8_t  :1;               /*!< bit:      3  Reserved                           */
    uint8_t  STCONVINV:1;      /*!< bit:      4  Start Conversion Event Invert Enable */
    uint8_t  :3;               /*!< bit:  5.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_EVCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

