zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define PTC_CTSCTRLA_OFFSET         0x0C         /**< \brief (PTC_CTSCTRLA offset) Capacitive Touch Sensing Control A */
#define PTC_CTSCTRLA_RESETVALUE     0x00         /**< \brief (PTC_CTSCTRLA reset_value) Capacitive Touch Sensing Control A */

#define PTC_CTSCTRLA_SDS_Pos        0            /**< \brief (PTC_CTSCTRLA) Sampling Delay Selection */
#define PTC_CTSCTRLA_SDS_Msk        (0xFu << PTC_CTSCTRLA_SDS_Pos)
#define PTC_CTSCTRLA_SDS(value)     ((PTC_CTSCTRLA_SDS_Msk & ((value) << PTC_CTSCTRLA_SDS_Pos)))
#define   PTC_CTSCTRLA_SDS_OFF_Val        0x0u   /**< \brief (PTC_CTSCTRLA) No sampling delay */
#define   PTC_CTSCTRLA_SDS_DLY1_Val       0x1u   /**< \brief (PTC_CTSCTRLA) 1 CLKPTC cycle sampling delay */
#define   PTC_CTSCTRLA_SDS_DLY2_Val       0x2u   /**< \brief (PTC_CTSCTRLA) 2 CLKPTC cycles sampling delay */
#define   PTC_CTSCTRLA_SDS_DLY3_Val       0x3u   /**< \brief (PTC_CTSCTRLA) 3 CLKPTC cycles sampling delay */
#define   PTC_CTSCTRLA_SDS_DLY4_Val       0x4u   /**< \brief (PTC_CTSCTRLA) 4 CLKPTC cycles sampling delay */
#define   PTC_CTSCTRLA_SDS_DLY5_Val       0x5u   /**< \brief (PTC_CTSCTRLA) 5 CLKPTC cycles sampling delay */
#define   PTC_CTSCTRLA_SDS_DLY6_Val       0x6u   /**< \brief (PTC_CTSCTRLA) 6 CLKPTC cycles sampling delay */
#define   PTC_CTSCTRLA_SDS_DLY7_Val       0x7u   /**< \brief (PTC_CTSCTRLA) 7 CLKPTC cycles sampling delay */
#define   PTC_CTSCTRLA_SDS_DLY8_Val       0x8u   /**< \brief (PTC_CTSCTRLA) 8 CLKPTC cycles sampling delay */
#define   PTC_CTSCTRLA_SDS_DLY9_Val       0x9u   /**< \brief (PTC_CTSCTRLA) 9 CLKPTC cycles sampling delay */
#define   PTC_CTSCTRLA_SDS_DLY10_Val      0xAu   /**< \brief (PTC_CTSCTRLA) 10 CLKPTC cycles sampling delay */
#define   PTC_CTSCTRLA_SDS_DLY11_Val      0xBu   /**< \brief (PTC_CTSCTRLA) 11 CLKPTC cycles sampling delay */
#define   PTC_CTSCTRLA_SDS_DLY12_Val      0xCu   /**< \brief (PTC_CTSCTRLA) 12 CLKPTC cycles sampling delay */
#define   PTC_CTSCTRLA_SDS_DLY13_Val      0xDu   /**< \brief (PTC_CTSCTRLA) 13 CLKPTC cycles sampling delay */
#define   PTC_CTSCTRLA_SDS_DLY14_Val      0xEu   /**< \brief (PTC_CTSCTRLA) 14 CLKPTC cycles sampling delay */
#define   PTC_CTSCTRLA_SDS_DLY15_Val      0xFu   /**< \brief (PTC_CTSCTRLA) 15 CLKPTC cycles sampling delay */
#define PTC_CTSCTRLA_SDS_OFF        (PTC_CTSCTRLA_SDS_OFF_Val      << PTC_CTSCTRLA_SDS_Pos)
#define PTC_CTSCTRLA_SDS_DLY1       (PTC_CTSCTRLA_SDS_DLY1_Val     << PTC_CTSCTRLA_SDS_Pos)
#define PTC_CTSCTRLA_SDS_DLY2       (PTC_CTSCTRLA_SDS_DLY2_Val     << PTC_CTSCTRLA_SDS_Pos)
#define PTC_CTSCTRLA_SDS_DLY3       (PTC_CTSCTRLA_SDS_DLY3_Val     << PTC_CTSCTRLA_SDS_Pos)
#define PTC_CTSCTRLA_SDS_DLY4       (PTC_CTSCTRLA_SDS_DLY4_Val     << PTC_CTSCTRLA_SDS_Pos)
#define PTC_CTSCTRLA_SDS_DLY5       (PTC_CTSCTRLA_SDS_DLY5_Val     << PTC_CTSCTRLA_SDS_Pos)
#define PTC_CTSCTRLA_SDS_DLY6       (PTC_CTSCTRLA_SDS_DLY6_Val     << PTC_CTSCTRLA_SDS_Pos)
#define PTC_CTSCTRLA_SDS_DLY7       (PTC_CTSCTRLA_SDS_DLY7_Val     << PTC_CTSCTRLA_SDS_Pos)
#define PTC_CTSCTRLA_SDS_DLY8       (PTC_CTSCTRLA_SDS_DLY8_Val     << PTC_CTSCTRLA_SDS_Pos)
#define PTC_CTSCTRLA_SDS_DLY9       (PTC_CTSCTRLA_SDS_DLY9_Val     << PTC_CTSCTRLA_SDS_Pos)
#define PTC_CTSCTRLA_SDS_DLY10      (PTC_CTSCTRLA_SDS_DLY10_Val    << PTC_CTSCTRLA_SDS_Pos)
#define PTC_CTSCTRLA_SDS_DLY11      (PTC_CTSCTRLA_SDS_DLY11_Val    << PTC_CTSCTRLA_SDS_Pos)
#define PTC_CTSCTRLA_SDS_DLY12      (PTC_CTSCTRLA_SDS_DLY12_Val    << PTC_CTSCTRLA_SDS_Pos)
#define PTC_CTSCTRLA_SDS_DLY13      (PTC_CTSCTRLA_SDS_DLY13_Val    << PTC_CTSCTRLA_SDS_Pos)
#define PTC_CTSCTRLA_SDS_DLY14      (PTC_CTSCTRLA_SDS_DLY14_Val    << PTC_CTSCTRLA_SDS_Pos)
#define PTC_CTSCTRLA_SDS_DLY15      (PTC_CTSCTRLA_SDS_DLY15_Val    << PTC_CTSCTRLA_SDS_Pos)
#define PTC_CTSCTRLA_ASDV_Pos       4            /**< \brief (PTC_CTSCTRLA) Automatic Sampling Delay Variation */
#define PTC_CTSCTRLA_ASDV           (0x1u << PTC_CTSCTRLA_ASDV_Pos)
#define PTC_CTSCTRLA_CCDS_Pos       5            /**< \brief (PTC_CTSCTRLA) Channel Change Delay Selection */
#define PTC_CTSCTRLA_CCDS_Msk       (0x3u << PTC_CTSCTRLA_CCDS_Pos)
#define PTC_CTSCTRLA_CCDS(value)    ((PTC_CTSCTRLA_CCDS_Msk & ((value) << PTC_CTSCTRLA_CCDS_Pos)))
#define   PTC_CTSCTRLA_CCDS_DLY0_Val      0x0u   /**< \brief (PTC_CTSCTRLA) 0, 0, 0 Programmable CC Delay, Pipeline Delay, Total CC Delay [CLKPTC cycles] */
#define   PTC_CTSCTRLA_CCDS_DLY27_Val     0x1u   /**< \brief (PTC_CTSCTRLA) 16, 11, 27 Programmable CC Delay, Pipeline Delay, Total CC Delay [CLKPTC cycles] */
#define   PTC_CTSCTRLA_CCDS_DLY43_Val     0x2u   /**< \brief (PTC_CTSCTRLA) 32, 11, 43 Programmable CC Delay, Pipeline Delay, Total CC Delay [CLKPTC cycles] */
#define   PTC_CTSCTRLA_CCDS_DLY75_Val     0x3u   /**< \brief (PTC_CTSCTRLA) 64, 11, 75 Programmable CC Delay, Pipeline Delay, Total CC Delay [CLKPTC cycles] */
#define PTC_CTSCTRLA_CCDS_DLY0      (PTC_CTSCTRLA_CCDS_DLY0_Val    << PTC_CTSCTRLA_CCDS_Pos)
#define PTC_CTSCTRLA_CCDS_DLY27     (PTC_CTSCTRLA_CCDS_DLY27_Val   << PTC_CTSCTRLA_CCDS_Pos)
#define PTC_CTSCTRLA_CCDS_DLY43     (PTC_CTSCTRLA_CCDS_DLY43_Val   << PTC_CTSCTRLA_CCDS_Pos)
#define PTC_CTSCTRLA_CCDS_DLY75     (PTC_CTSCTRLA_CCDS_DLY75_Val   << PTC_CTSCTRLA_CCDS_Pos)
#define PTC_CTSCTRLA_MASK           0x7Fu        /**< \brief (PTC_CTSCTRLA) Register Bits Mask */

/* -------- PTC_CTSCTRLC : (PTC Offset: 0x0D) (R/W  8) CTS Control C -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  ADAS:3;           /*!< bit:  0.. 2  ADC Accumulation Number            */
    uint8_t  :4;               /*!< bit:  3.. 6  Reserved                           */
    uint8_t  STCONV:1;         /*!< bit:      7  Start Conversion                   */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_CTSCTRLC_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_CTSCTRLC_OFFSET         0x0D         /**< \brief (PTC_CTSCTRLC offset) CTS Control C */
#define PTC_CTSCTRLC_RESETVALUE     0x00         /**< \brief (PTC_CTSCTRLC reset_value) CTS Control C */

#define PTC_CTSCTRLC_ADAS_Pos       0            /**< \brief (PTC_CTSCTRLC) ADC Accumulation Number */
#define PTC_CTSCTRLC_ADAS_Msk       (0x7u << PTC_CTSCTRLC_ADAS_Pos)
#define PTC_CTSCTRLC_ADAS(value)    ((PTC_CTSCTRLC_ADAS_Msk & ((value) << PTC_CTSCTRLC_ADAS_Pos)))
#define   PTC_CTSCTRLC_ADAS_ACC1_Val      0x0u   /**< \brief (PTC_CTSCTRLC) 1 result accumulation */
#define   PTC_CTSCTRLC_ADAS_ACC2_Val      0x1u   /**< \brief (PTC_CTSCTRLC) 2 results accumulation */
#define   PTC_CTSCTRLC_ADAS_ACC4_Val      0x2u   /**< \brief (PTC_CTSCTRLC) 4 results accumulation */
#define   PTC_CTSCTRLC_ADAS_ACC8_Val      0x3u   /**< \brief (PTC_CTSCTRLC) 8 results accumulation */
#define   PTC_CTSCTRLC_ADAS_ACC16_Val     0x4u   /**< \brief (PTC_CTSCTRLC) 16 results accumulation */
#define   PTC_CTSCTRLC_ADAS_ACC32_Val     0x5u   /**< \brief (PTC_CTSCTRLC) 32 results accumulation */
#define   PTC_CTSCTRLC_ADAS_ACC64_Val     0x6u   /**< \brief (PTC_CTSCTRLC) 64 results accumulation */
#define PTC_CTSCTRLC_ADAS_ACC1      (PTC_CTSCTRLC_ADAS_ACC1_Val    << PTC_CTSCTRLC_ADAS_Pos)
#define PTC_CTSCTRLC_ADAS_ACC2      (PTC_CTSCTRLC_ADAS_ACC2_Val    << PTC_CTSCTRLC_ADAS_Pos)
#define PTC_CTSCTRLC_ADAS_ACC4      (PTC_CTSCTRLC_ADAS_ACC4_Val    << PTC_CTSCTRLC_ADAS_Pos)
#define PTC_CTSCTRLC_ADAS_ACC8      (PTC_CTSCTRLC_ADAS_ACC8_Val    << PTC_CTSCTRLC_ADAS_Pos)
#define PTC_CTSCTRLC_ADAS_ACC16     (PTC_CTSCTRLC_ADAS_ACC16_Val   << PTC_CTSCTRLC_ADAS_Pos)
#define PTC_CTSCTRLC_ADAS_ACC32     (PTC_CTSCTRLC_ADAS_ACC32_Val   << PTC_CTSCTRLC_ADAS_Pos)
#define PTC_CTSCTRLC_ADAS_ACC64     (PTC_CTSCTRLC_ADAS_ACC64_Val   << PTC_CTSCTRLC_ADAS_Pos)
#define PTC_CTSCTRLC_STCONV_Pos     7            /**< \brief (PTC_CTSCTRLC) Start Conversion */
#define PTC_CTSCTRLC_STCONV         (0x1u << PTC_CTSCTRLC_STCONV_Pos)
#define PTC_CTSCTRLC_MASK           0x87u        /**< \brief (PTC_CTSCTRLC) Register Bits Mask */

/* -------- PTC_YSEL : (PTC Offset: 0x10) (R/W 16) Y-Line Selection -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t YSEL:16;          /*!< bit:  0..15  Y-Line Selection                   */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_YSEL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_YSEL_OFFSET             0x10         /**< \brief (PTC_YSEL offset) Y-Line Selection */
#define PTC_YSEL_RESETVALUE         0x0000       /**< \brief (PTC_YSEL reset_value) Y-Line Selection */

#define PTC_YSEL_YSEL_Pos           0            /**< \brief (PTC_YSEL) Y-Line Selection */
#define PTC_YSEL_YSEL_Msk           (0xFFFFu << PTC_YSEL_YSEL_Pos)
#define PTC_YSEL_YSEL(value)        ((PTC_YSEL_YSEL_Msk & ((value) << PTC_YSEL_YSEL_Pos)))
#define PTC_YSEL_MASK               0xFFFFu      /**< \brief (PTC_YSEL) Register Bits Mask */

/* -------- PTC_XSEL : (PTC Offset: 0x12) (R/W 16) X-Line Selection -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t XSEL:16;          /*!< bit:  0..15  X-Line Selection                   */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_XSEL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_XSEL_OFFSET             0x12         /**< \brief (PTC_XSEL offset) X-Line Selection */
#define PTC_XSEL_RESETVALUE         0x0000       /**< \brief (PTC_XSEL reset_value) X-Line Selection */

#define PTC_XSEL_XSEL_Pos           0            /**< \brief (PTC_XSEL) X-Line Selection */
#define PTC_XSEL_XSEL_Msk           (0xFFFFu << PTC_XSEL_XSEL_Pos)
#define PTC_XSEL_XSEL(value)        ((PTC_XSEL_XSEL_Msk & ((value) << PTC_XSEL_XSEL_Pos)))
#define PTC_XSEL_MASK               0xFFFFu      /**< \brief (PTC_XSEL) Register Bits Mask */

/* -------- PTC_YEN : (PTC Offset: 0x14) (R/W 16) Y-Line Enable -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t YEN:16;           /*!< bit:  0..15  Y-Line Enable                      */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_YEN_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_YEN_OFFSET              0x14         /**< \brief (PTC_YEN offset) Y-Line Enable */
#define PTC_YEN_RESETVALUE          0x0000       /**< \brief (PTC_YEN reset_value) Y-Line Enable */

#define PTC_YEN_YEN_Pos             0            /**< \brief (PTC_YEN) Y-Line Enable */
#define PTC_YEN_YEN_Msk             (0xFFFFu << PTC_YEN_YEN_Pos)
#define PTC_YEN_YEN(value)          ((PTC_YEN_YEN_Msk & ((value) << PTC_YEN_YEN_Pos)))
#define PTC_YEN_MASK                0xFFFFu      /**< \brief (PTC_YEN) Register Bits Mask */

/* -------- PTC_XEN : (PTC Offset: 0x16) (R/W 16) X-Line Enable -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t XEN:16;           /*!< bit:  0..15  X-Line Enable                      */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_XEN_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_XEN_OFFSET              0x16         /**< \brief (PTC_XEN offset) X-Line Enable */
#define PTC_XEN_RESETVALUE          0x0000       /**< \brief (PTC_XEN reset_value) X-Line Enable */

