zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define PTC_XEN_XEN_Pos             0            /**< \brief (PTC_XEN) X-Line Enable */
#define PTC_XEN_XEN_Msk             (0xFFFFu << PTC_XEN_XEN_Pos)
#define PTC_XEN_XEN(value)          ((PTC_XEN_XEN_Msk & ((value) << PTC_XEN_XEN_Pos)))
#define PTC_XEN_MASK                0xFFFFu      /**< \brief (PTC_XEN) Register Bits Mask */

/* -------- PTC_CCCAL : (PTC Offset: 0x18) (R/W 16) CTS Compensation Capacitor Calibration -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t CCA:4;            /*!< bit:  0.. 3  Compensation Capacitor Accurate Value */
    uint16_t CCF:4;            /*!< bit:  4.. 7  Compensation Capacitor Fine Value  */
    uint16_t CCC:4;            /*!< bit:  8..11  Compensation Capacitor Coarse Value */
    uint16_t CCR:2;            /*!< bit: 12..13  Compensation Capacitor Rough Value */
    uint16_t :2;               /*!< bit: 14..15  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_CCCAL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_CCCAL_OFFSET            0x18         /**< \brief (PTC_CCCAL offset) CTS Compensation Capacitor Calibration */
#define PTC_CCCAL_RESETVALUE        0x0000       /**< \brief (PTC_CCCAL reset_value) CTS Compensation Capacitor Calibration */

#define PTC_CCCAL_CCA_Pos           0            /**< \brief (PTC_CCCAL) Compensation Capacitor Accurate Value */
#define PTC_CCCAL_CCA_Msk           (0xFu << PTC_CCCAL_CCA_Pos)
#define PTC_CCCAL_CCA(value)        ((PTC_CCCAL_CCA_Msk & ((value) << PTC_CCCAL_CCA_Pos)))
#define   PTC_CCCAL_CCA_0_Val             0x0u   /**< \brief (PTC_CCCAL) 0 */
#define   PTC_CCCAL_CCA_1_Val             0x1u   /**< \brief (PTC_CCCAL) 0.00675 */
#define   PTC_CCCAL_CCA_2_Val             0x2u   /**< \brief (PTC_CCCAL) 0.01350 */
#define   PTC_CCCAL_CCA_3_Val             0x3u   /**< \brief (PTC_CCCAL) 0.02025 */
#define   PTC_CCCAL_CCA_4_Val             0x4u   /**< \brief (PTC_CCCAL) 0.02700 */
#define   PTC_CCCAL_CCA_5_Val             0x5u   /**< \brief (PTC_CCCAL) 0.03375 */
#define   PTC_CCCAL_CCA_6_Val             0x6u   /**< \brief (PTC_CCCAL) 0.04050 */
#define   PTC_CCCAL_CCA_7_Val             0x7u   /**< \brief (PTC_CCCAL) 0.04725 */
#define   PTC_CCCAL_CCA_8_Val             0x8u   /**< \brief (PTC_CCCAL) 0.05400 */
#define   PTC_CCCAL_CCA_9_Val             0x9u   /**< \brief (PTC_CCCAL) 0.06075 */
#define   PTC_CCCAL_CCA_10_Val            0xAu   /**< \brief (PTC_CCCAL) 0.06750 */
#define   PTC_CCCAL_CCA_11_Val            0xBu   /**< \brief (PTC_CCCAL) 0.07425 */
#define   PTC_CCCAL_CCA_12_Val            0xCu   /**< \brief (PTC_CCCAL) 0.08100 */
#define   PTC_CCCAL_CCA_13_Val            0xDu   /**< \brief (PTC_CCCAL) 0.08775 */
#define   PTC_CCCAL_CCA_14_Val            0xEu   /**< \brief (PTC_CCCAL) 0.09450 */
#define   PTC_CCCAL_CCA_15_Val            0xFu   /**< \brief (PTC_CCCAL) 0.10125 */
#define PTC_CCCAL_CCA_0             (PTC_CCCAL_CCA_0_Val           << PTC_CCCAL_CCA_Pos)
#define PTC_CCCAL_CCA_1             (PTC_CCCAL_CCA_1_Val           << PTC_CCCAL_CCA_Pos)
#define PTC_CCCAL_CCA_2             (PTC_CCCAL_CCA_2_Val           << PTC_CCCAL_CCA_Pos)
#define PTC_CCCAL_CCA_3             (PTC_CCCAL_CCA_3_Val           << PTC_CCCAL_CCA_Pos)
#define PTC_CCCAL_CCA_4             (PTC_CCCAL_CCA_4_Val           << PTC_CCCAL_CCA_Pos)
#define PTC_CCCAL_CCA_5             (PTC_CCCAL_CCA_5_Val           << PTC_CCCAL_CCA_Pos)
#define PTC_CCCAL_CCA_6             (PTC_CCCAL_CCA_6_Val           << PTC_CCCAL_CCA_Pos)
#define PTC_CCCAL_CCA_7             (PTC_CCCAL_CCA_7_Val           << PTC_CCCAL_CCA_Pos)
#define PTC_CCCAL_CCA_8             (PTC_CCCAL_CCA_8_Val           << PTC_CCCAL_CCA_Pos)
#define PTC_CCCAL_CCA_9             (PTC_CCCAL_CCA_9_Val           << PTC_CCCAL_CCA_Pos)
#define PTC_CCCAL_CCA_10            (PTC_CCCAL_CCA_10_Val          << PTC_CCCAL_CCA_Pos)
#define PTC_CCCAL_CCA_11            (PTC_CCCAL_CCA_11_Val          << PTC_CCCAL_CCA_Pos)
#define PTC_CCCAL_CCA_12            (PTC_CCCAL_CCA_12_Val          << PTC_CCCAL_CCA_Pos)
#define PTC_CCCAL_CCA_13            (PTC_CCCAL_CCA_13_Val          << PTC_CCCAL_CCA_Pos)
#define PTC_CCCAL_CCA_14            (PTC_CCCAL_CCA_14_Val          << PTC_CCCAL_CCA_Pos)
#define PTC_CCCAL_CCA_15            (PTC_CCCAL_CCA_15_Val          << PTC_CCCAL_CCA_Pos)
#define PTC_CCCAL_CCF_Pos           4            /**< \brief (PTC_CCCAL) Compensation Capacitor Fine Value */
#define PTC_CCCAL_CCF_Msk           (0xFu << PTC_CCCAL_CCF_Pos)
#define PTC_CCCAL_CCF(value)        ((PTC_CCCAL_CCF_Msk & ((value) << PTC_CCCAL_CCF_Pos)))
#define   PTC_CCCAL_CCF_0_Val             0x0u   /**< \brief (PTC_CCCAL) 0 */
#define   PTC_CCCAL_CCF_1_Val             0x1u   /**< \brief (PTC_CCCAL) 0.0675 */
#define   PTC_CCCAL_CCF_2_Val             0x2u   /**< \brief (PTC_CCCAL) 0.1350 */
#define   PTC_CCCAL_CCF_3_Val             0x3u   /**< \brief (PTC_CCCAL) 0.2025 */
#define   PTC_CCCAL_CCF_4_Val             0x4u   /**< \brief (PTC_CCCAL) 0.2700 */
#define   PTC_CCCAL_CCF_5_Val             0x5u   /**< \brief (PTC_CCCAL) 0.3375 */
#define   PTC_CCCAL_CCF_6_Val             0x6u   /**< \brief (PTC_CCCAL) 0.4050 */
#define   PTC_CCCAL_CCF_7_Val             0x7u   /**< \brief (PTC_CCCAL) 0.4725 */
#define   PTC_CCCAL_CCF_8_Val             0x8u   /**< \brief (PTC_CCCAL) 0.5400 */
#define   PTC_CCCAL_CCF_9_Val             0x9u   /**< \brief (PTC_CCCAL) 0.6075 */
#define   PTC_CCCAL_CCF_10_Val            0xAu   /**< \brief (PTC_CCCAL) 0.6750 */
#define   PTC_CCCAL_CCF_11_Val            0xBu   /**< \brief (PTC_CCCAL) 0.7425 */
#define   PTC_CCCAL_CCF_12_Val            0xCu   /**< \brief (PTC_CCCAL) 0.8100 */
#define   PTC_CCCAL_CCF_13_Val            0xDu   /**< \brief (PTC_CCCAL) 0.8775 */
#define   PTC_CCCAL_CCF_14_Val            0xEu   /**< \brief (PTC_CCCAL) 0.9450 */
#define   PTC_CCCAL_CCF_15_Val            0xFu   /**< \brief (PTC_CCCAL) 1.0125 */
#define PTC_CCCAL_CCF_0             (PTC_CCCAL_CCF_0_Val           << PTC_CCCAL_CCF_Pos)
#define PTC_CCCAL_CCF_1             (PTC_CCCAL_CCF_1_Val           << PTC_CCCAL_CCF_Pos)
#define PTC_CCCAL_CCF_2             (PTC_CCCAL_CCF_2_Val           << PTC_CCCAL_CCF_Pos)
#define PTC_CCCAL_CCF_3             (PTC_CCCAL_CCF_3_Val           << PTC_CCCAL_CCF_Pos)
#define PTC_CCCAL_CCF_4             (PTC_CCCAL_CCF_4_Val           << PTC_CCCAL_CCF_Pos)
#define PTC_CCCAL_CCF_5             (PTC_CCCAL_CCF_5_Val           << PTC_CCCAL_CCF_Pos)
#define PTC_CCCAL_CCF_6             (PTC_CCCAL_CCF_6_Val           << PTC_CCCAL_CCF_Pos)
#define PTC_CCCAL_CCF_7             (PTC_CCCAL_CCF_7_Val           << PTC_CCCAL_CCF_Pos)
#define PTC_CCCAL_CCF_8             (PTC_CCCAL_CCF_8_Val           << PTC_CCCAL_CCF_Pos)
#define PTC_CCCAL_CCF_9             (PTC_CCCAL_CCF_9_Val           << PTC_CCCAL_CCF_Pos)
#define PTC_CCCAL_CCF_10            (PTC_CCCAL_CCF_10_Val          << PTC_CCCAL_CCF_Pos)
#define PTC_CCCAL_CCF_11            (PTC_CCCAL_CCF_11_Val          << PTC_CCCAL_CCF_Pos)
#define PTC_CCCAL_CCF_12            (PTC_CCCAL_CCF_12_Val          << PTC_CCCAL_CCF_Pos)
#define PTC_CCCAL_CCF_13            (PTC_CCCAL_CCF_13_Val          << PTC_CCCAL_CCF_Pos)
#define PTC_CCCAL_CCF_14            (PTC_CCCAL_CCF_14_Val          << PTC_CCCAL_CCF_Pos)
#define PTC_CCCAL_CCF_15            (PTC_CCCAL_CCF_15_Val          << PTC_CCCAL_CCF_Pos)
#define PTC_CCCAL_CCC_Pos           8            /**< \brief (PTC_CCCAL) Compensation Capacitor Coarse Value */
#define PTC_CCCAL_CCC_Msk           (0xFu << PTC_CCCAL_CCC_Pos)
#define PTC_CCCAL_CCC(value)        ((PTC_CCCAL_CCC_Msk & ((value) << PTC_CCCAL_CCC_Pos)))
#define   PTC_CCCAL_CCC_0_Val             0x0u   /**< \brief (PTC_CCCAL) 0 */
#define   PTC_CCCAL_CCC_1_Val             0x1u   /**< \brief (PTC_CCCAL) 0.675 */
#define   PTC_CCCAL_CCC_2_Val             0x2u   /**< \brief (PTC_CCCAL) 1.350 */
#define   PTC_CCCAL_CCC_3_Val             0x3u   /**< \brief (PTC_CCCAL) 2.025 */
#define   PTC_CCCAL_CCC_4_Val             0x4u   /**< \brief (PTC_CCCAL) 2.700 */
#define   PTC_CCCAL_CCC_5_Val             0x5u   /**< \brief (PTC_CCCAL) 3.375 */
#define   PTC_CCCAL_CCC_6_Val             0x6u   /**< \brief (PTC_CCCAL) 4.050 */
#define   PTC_CCCAL_CCC_7_Val             0x7u   /**< \brief (PTC_CCCAL) 4.725 */
#define   PTC_CCCAL_CCC_8_Val             0x8u   /**< \brief (PTC_CCCAL) 5.400 */
#define   PTC_CCCAL_CCC_9_Val             0x9u   /**< \brief (PTC_CCCAL) 6.075 */
#define   PTC_CCCAL_CCC_10_Val            0xAu   /**< \brief (PTC_CCCAL) 6.750 */
#define   PTC_CCCAL_CCC_11_Val            0xBu   /**< \brief (PTC_CCCAL) 7.425 */
#define   PTC_CCCAL_CCC_12_Val            0xCu   /**< \brief (PTC_CCCAL) 8.100 */
#define   PTC_CCCAL_CCC_13_Val            0xDu   /**< \brief (PTC_CCCAL) 8.775 */
#define   PTC_CCCAL_CCC_14_Val            0xEu   /**< \brief (PTC_CCCAL) 9.450 */
#define   PTC_CCCAL_CCC_15_Val            0xFu   /**< \brief (PTC_CCCAL) 10.125 */
#define PTC_CCCAL_CCC_0             (PTC_CCCAL_CCC_0_Val           << PTC_CCCAL_CCC_Pos)
#define PTC_CCCAL_CCC_1             (PTC_CCCAL_CCC_1_Val           << PTC_CCCAL_CCC_Pos)
#define PTC_CCCAL_CCC_2             (PTC_CCCAL_CCC_2_Val           << PTC_CCCAL_CCC_Pos)
#define PTC_CCCAL_CCC_3             (PTC_CCCAL_CCC_3_Val           << PTC_CCCAL_CCC_Pos)
#define PTC_CCCAL_CCC_4             (PTC_CCCAL_CCC_4_Val           << PTC_CCCAL_CCC_Pos)
#define PTC_CCCAL_CCC_5             (PTC_CCCAL_CCC_5_Val           << PTC_CCCAL_CCC_Pos)
#define PTC_CCCAL_CCC_6             (PTC_CCCAL_CCC_6_Val           << PTC_CCCAL_CCC_Pos)
#define PTC_CCCAL_CCC_7             (PTC_CCCAL_CCC_7_Val           << PTC_CCCAL_CCC_Pos)
#define PTC_CCCAL_CCC_8             (PTC_CCCAL_CCC_8_Val           << PTC_CCCAL_CCC_Pos)
#define PTC_CCCAL_CCC_9             (PTC_CCCAL_CCC_9_Val           << PTC_CCCAL_CCC_Pos)
#define PTC_CCCAL_CCC_10            (PTC_CCCAL_CCC_10_Val          << PTC_CCCAL_CCC_Pos)
#define PTC_CCCAL_CCC_11            (PTC_CCCAL_CCC_11_Val          << PTC_CCCAL_CCC_Pos)
#define PTC_CCCAL_CCC_12            (PTC_CCCAL_CCC_12_Val          << PTC_CCCAL_CCC_Pos)
#define PTC_CCCAL_CCC_13            (PTC_CCCAL_CCC_13_Val          << PTC_CCCAL_CCC_Pos)
#define PTC_CCCAL_CCC_14            (PTC_CCCAL_CCC_14_Val          << PTC_CCCAL_CCC_Pos)
#define PTC_CCCAL_CCC_15            (PTC_CCCAL_CCC_15_Val          << PTC_CCCAL_CCC_Pos)
#define PTC_CCCAL_CCR_Pos           12           /**< \brief (PTC_CCCAL) Compensation Capacitor Rough Value */
#define PTC_CCCAL_CCR_Msk           (0x3u << PTC_CCCAL_CCR_Pos)
#define PTC_CCCAL_CCR(value)        ((PTC_CCCAL_CCR_Msk & ((value) << PTC_CCCAL_CCR_Pos)))
#define   PTC_CCCAL_CCR_0_Val             0x0u   /**< \brief (PTC_CCCAL) 0 */
#define   PTC_CCCAL_CCR_1_Val             0x1u   /**< \brief (PTC_CCCAL) 6.75 */
#define   PTC_CCCAL_CCR_2_Val             0x2u   /**< \brief (PTC_CCCAL) 13.5 */
#define   PTC_CCCAL_CCR_3_Val             0x3u   /**< \brief (PTC_CCCAL) 21.25 */
#define PTC_CCCAL_CCR_0             (PTC_CCCAL_CCR_0_Val           << PTC_CCCAL_CCR_Pos)
#define PTC_CCCAL_CCR_1             (PTC_CCCAL_CCR_1_Val           << PTC_CCCAL_CCR_Pos)
#define PTC_CCCAL_CCR_2             (PTC_CCCAL_CCR_2_Val           << PTC_CCCAL_CCR_Pos)
#define PTC_CCCAL_CCR_3             (PTC_CCCAL_CCR_3_Val           << PTC_CCCAL_CCR_Pos)
#define PTC_CCCAL_MASK              0x3FFFu      /**< \brief (PTC_CCCAL) Register Bits Mask */

/* -------- PTC_CICAL : (PTC Offset: 0x1A) (R/W  8) Integration Capacitor (CI) Calibration -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  CIF:4;            /*!< bit:  0.. 3  Integration Capacitor Fine Value   */
    uint8_t  CIC:2;            /*!< bit:  4.. 5  Integration Capacitor Coarse Value */
    uint8_t  :2;               /*!< bit:  6.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_CICAL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_CICAL_OFFSET            0x1A         /**< \brief (PTC_CICAL offset) Integration Capacitor (CI) Calibration */
#define PTC_CICAL_RESETVALUE        0x00         /**< \brief (PTC_CICAL reset_value) Integration Capacitor (CI) Calibration */

#define PTC_CICAL_CIF_Pos           0            /**< \brief (PTC_CICAL) Integration Capacitor Fine Value */
#define PTC_CICAL_CIF_Msk           (0xFu << PTC_CICAL_CIF_Pos)
#define PTC_CICAL_CIF(value)        ((PTC_CICAL_CIF_Msk & ((value) << PTC_CICAL_CIF_Pos)))
#define   PTC_CICAL_CIF_0_Val             0x0u   /**< \brief (PTC_CICAL) 0 */
#define   PTC_CICAL_CIF_1_Val             0x1u   /**< \brief (PTC_CICAL) 0.675 */
#define   PTC_CICAL_CIF_2_Val             0x2u   /**< \brief (PTC_CICAL) 1.350 */
#define   PTC_CICAL_CIF_3_Val             0x3u   /**< \brief (PTC_CICAL) 2.025 */
#define   PTC_CICAL_CIF_4_Val             0x4u   /**< \brief (PTC_CICAL) 2.700 */
#define   PTC_CICAL_CIF_5_Val             0x5u   /**< \brief (PTC_CICAL) 3.375 */
#define   PTC_CICAL_CIF_6_Val             0x6u   /**< \brief (PTC_CICAL) 4.050 */
#define   PTC_CICAL_CIF_7_Val             0x7u   /**< \brief (PTC_CICAL) 4.725 */
#define   PTC_CICAL_CIF_8_Val             0x8u   /**< \brief (PTC_CICAL) 5.400 */
#define   PTC_CICAL_CIF_9_Val             0x9u   /**< \brief (PTC_CICAL) 6.075 */
#define   PTC_CICAL_CIF_10_Val            0xAu   /**< \brief (PTC_CICAL) 6.750 */
#define   PTC_CICAL_CIF_11_Val            0xBu   /**< \brief (PTC_CICAL) 7.425 */
#define   PTC_CICAL_CIF_12_Val            0xCu   /**< \brief (PTC_CICAL) 8.100 */
#define   PTC_CICAL_CIF_13_Val            0xDu   /**< \brief (PTC_CICAL) 8.775 */
#define   PTC_CICAL_CIF_14_Val            0xEu   /**< \brief (PTC_CICAL) 9.450 */
#define   PTC_CICAL_CIF_15_Val            0xFu   /**< \brief (PTC_CICAL) 10.125 */
#define PTC_CICAL_CIF_0             (PTC_CICAL_CIF_0_Val           << PTC_CICAL_CIF_Pos)
#define PTC_CICAL_CIF_1             (PTC_CICAL_CIF_1_Val           << PTC_CICAL_CIF_Pos)
#define PTC_CICAL_CIF_2             (PTC_CICAL_CIF_2_Val           << PTC_CICAL_CIF_Pos)
#define PTC_CICAL_CIF_3             (PTC_CICAL_CIF_3_Val           << PTC_CICAL_CIF_Pos)
#define PTC_CICAL_CIF_4             (PTC_CICAL_CIF_4_Val           << PTC_CICAL_CIF_Pos)
#define PTC_CICAL_CIF_5             (PTC_CICAL_CIF_5_Val           << PTC_CICAL_CIF_Pos)
#define PTC_CICAL_CIF_6             (PTC_CICAL_CIF_6_Val           << PTC_CICAL_CIF_Pos)
#define PTC_CICAL_CIF_7             (PTC_CICAL_CIF_7_Val           << PTC_CICAL_CIF_Pos)
#define PTC_CICAL_CIF_8             (PTC_CICAL_CIF_8_Val           << PTC_CICAL_CIF_Pos)
#define PTC_CICAL_CIF_9             (PTC_CICAL_CIF_9_Val           << PTC_CICAL_CIF_Pos)
#define PTC_CICAL_CIF_10            (PTC_CICAL_CIF_10_Val          << PTC_CICAL_CIF_Pos)
#define PTC_CICAL_CIF_11            (PTC_CICAL_CIF_11_Val          << PTC_CICAL_CIF_Pos)
#define PTC_CICAL_CIF_12            (PTC_CICAL_CIF_12_Val          << PTC_CICAL_CIF_Pos)
#define PTC_CICAL_CIF_13            (PTC_CICAL_CIF_13_Val          << PTC_CICAL_CIF_Pos)
#define PTC_CICAL_CIF_14            (PTC_CICAL_CIF_14_Val          << PTC_CICAL_CIF_Pos)
#define PTC_CICAL_CIF_15            (PTC_CICAL_CIF_15_Val          << PTC_CICAL_CIF_Pos)
#define PTC_CICAL_CIC_Pos           4            /**< \brief (PTC_CICAL) Integration Capacitor Coarse Value */
#define PTC_CICAL_CIC_Msk           (0x3u << PTC_CICAL_CIC_Pos)
#define PTC_CICAL_CIC(value)        ((PTC_CICAL_CIC_Msk & ((value) << PTC_CICAL_CIC_Pos)))
#define   PTC_CICAL_CIC_0_Val             0x0u   /**< \brief (PTC_CICAL) 0 */
#define   PTC_CICAL_CIC_1_Val             0x1u   /**< \brief (PTC_CICAL) 6.75 */
#define   PTC_CICAL_CIC_2_Val             0x2u   /**< \brief (PTC_CICAL) 13.5 */
#define   PTC_CICAL_CIC_3_Val             0x3u   /**< \brief (PTC_CICAL) 21.25 */
#define PTC_CICAL_CIC_0             (PTC_CICAL_CIC_0_Val           << PTC_CICAL_CIC_Pos)
#define PTC_CICAL_CIC_1             (PTC_CICAL_CIC_1_Val           << PTC_CICAL_CIC_Pos)
#define PTC_CICAL_CIC_2             (PTC_CICAL_CIC_2_Val           << PTC_CICAL_CIC_Pos)
#define PTC_CICAL_CIC_3             (PTC_CICAL_CIC_3_Val           << PTC_CICAL_CIC_Pos)
#define PTC_CICAL_MASK              0x3Fu        /**< \brief (PTC_CICAL) Register Bits Mask */

/* -------- PTC_CTSRS : (PTC Offset: 0x1B) (R/W  8) CTS Resistor Selection -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  RSEL:2;           /*!< bit:  0.. 1  Resistor Selection                 */
    uint8_t  :6;               /*!< bit:  2.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_CTSRS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_CTSRS_OFFSET            0x1B         /**< \brief (PTC_CTSRS offset) CTS Resistor Selection */
#define PTC_CTSRS_RESETVALUE        0x00         /**< \brief (PTC_CTSRS reset_value) CTS Resistor Selection */

#define PTC_CTSRS_RSEL_Pos          0            /**< \brief (PTC_CTSRS) Resistor Selection */
#define PTC_CTSRS_RSEL_Msk          (0x3u << PTC_CTSRS_RSEL_Pos)
#define PTC_CTSRS_RSEL(value)       ((PTC_CTSRS_RSEL_Msk & ((value) << PTC_CTSRS_RSEL_Pos)))
#define   PTC_CTSRS_RSEL_OFF_Val          0x0u   /**< \brief (PTC_CTSRS) No resistor */
#define   PTC_CTSRS_RSEL_R20K_Val         0x1u   /**< \brief (PTC_CTSRS) 20 kohm */
#define   PTC_CTSRS_RSEL_R50K_Val         0x2u   /**< \brief (PTC_CTSRS) 50 kohm */
#define   PTC_CTSRS_RSEL_R100K_Val        0x3u   /**< \brief (PTC_CTSRS) 100 kohm */
#define PTC_CTSRS_RSEL_OFF          (PTC_CTSRS_RSEL_OFF_Val        << PTC_CTSRS_RSEL_Pos)
#define PTC_CTSRS_RSEL_R20K         (PTC_CTSRS_RSEL_R20K_Val       << PTC_CTSRS_RSEL_Pos)
#define PTC_CTSRS_RSEL_R50K         (PTC_CTSRS_RSEL_R50K_Val       << PTC_CTSRS_RSEL_Pos)
#define PTC_CTSRS_RSEL_R100K        (PTC_CTSRS_RSEL_R100K_Val      << PTC_CTSRS_RSEL_Pos)
#define PTC_CTSRS_MASK              0x03u        /**< \brief (PTC_CTSRS) Register Bits Mask */

/* -------- PTC_RESULT : (PTC Offset: 0x1C) (R/  16) Result -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t RES:16;           /*!< bit:  0..15  ADC/Accumulator Result Data Register */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_RESULT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_RESULT_OFFSET           0x1C         /**< \brief (PTC_RESULT offset) Result */
#define PTC_RESULT_RESETVALUE       0x0000       /**< \brief (PTC_RESULT reset_value) Result */

#define PTC_RESULT_RES_Pos          0            /**< \brief (PTC_RESULT) ADC/Accumulator Result Data Register */
#define PTC_RESULT_RES_Msk          (0xFFFFu << PTC_RESULT_RES_Pos)
#define PTC_RESULT_RES(value)       ((PTC_RESULT_RES_Msk & ((value) << PTC_RESULT_RES_Pos)))
#define PTC_RESULT_MASK             0xFFFFu      /**< \brief (PTC_RESULT) Register Bits Mask */

/* -------- PTC_CTSCTRLB : (PTC Offset: 0x20) (R/W  8) Capacitive Touch Sensing Control B -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  :2;               /*!< bit:  0.. 1  Reserved                           */
    uint8_t  CTSLP:1;          /*!< bit:      2  CTS system in Low Power Mode       */
    uint8_t  SCF:1;            /*!< bit:      3  Self Cap Fix                       */
    uint8_t  CTSM:4;           /*!< bit:  4.. 7  Capacitive Touch Sensing Mode      */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_CTSCTRLB_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_CTSCTRLB_OFFSET         0x20         /**< \brief (PTC_CTSCTRLB offset) Capacitive Touch Sensing Control B */
#define PTC_CTSCTRLB_RESETVALUE     0x00         /**< \brief (PTC_CTSCTRLB reset_value) Capacitive Touch Sensing Control B */

#define PTC_CTSCTRLB_CTSLP_Pos      2            /**< \brief (PTC_CTSCTRLB) CTS system in Low Power Mode */
#define PTC_CTSCTRLB_CTSLP          (0x1u << PTC_CTSCTRLB_CTSLP_Pos)
#define PTC_CTSCTRLB_SCF_Pos        3            /**< \brief (PTC_CTSCTRLB) Self Cap Fix */
#define PTC_CTSCTRLB_SCF            (0x1u << PTC_CTSCTRLB_SCF_Pos)
#define PTC_CTSCTRLB_CTSM_Pos       4            /**< \brief (PTC_CTSCTRLB) Capacitive Touch Sensing Mode */
#define PTC_CTSCTRLB_CTSM_Msk       (0xFu << PTC_CTSCTRLB_CTSM_Pos)
#define PTC_CTSCTRLB_CTSM(value)    ((PTC_CTSCTRLB_CTSM_Msk & ((value) << PTC_CTSCTRLB_CTSM_Pos)))
#define   PTC_CTSCTRLB_CTSM_0_Val         0x0u   /**< \brief (PTC_CTSCTRLB) Disabled (When CTS is Disabled, the ADC will still work, if ENABLE bit in the CTRL register is set) */
#define   PTC_CTSCTRLB_CTSM_8_Val         0x8u   /**< \brief (PTC_CTSCTRLB) Mutual Capacitance, Differential Integration */
#define   PTC_CTSCTRLB_CTSM_9_Val         0x9u   /**< \brief (PTC_CTSCTRLB) Mutual Capacitance, Differential Integration -inverted polarity */
#define   PTC_CTSCTRLB_CTSM_10_Val        0xAu   /**< \brief (PTC_CTSCTRLB) Self Capacitance, Differential Integration */
#define   PTC_CTSCTRLB_CTSM_11_Val        0xBu   /**< \brief (PTC_CTSCTRLB) Self Capacitance, Differential Integration -inverted polarity */
#define   PTC_CTSCTRLB_CTSM_12_Val        0xCu   /**< \brief (PTC_CTSCTRLB) Mutual Capacitance, Single-ended Integration */
#define   PTC_CTSCTRLB_CTSM_13_Val        0xDu   /**< \brief (PTC_CTSCTRLB) Mutual Capacitance, Single-ended Integration -inverted polarity */
#define   PTC_CTSCTRLB_CTSM_14_Val        0xEu   /**< \brief (PTC_CTSCTRLB) Self Capacitance, Single-ended Integration */
#define   PTC_CTSCTRLB_CTSM_15_Val        0xFu   /**< \brief (PTC_CTSCTRLB) Self Capacitance, Single-ended Integration -inverted polarity */
#define PTC_CTSCTRLB_CTSM_0         (PTC_CTSCTRLB_CTSM_0_Val       << PTC_CTSCTRLB_CTSM_Pos)
#define PTC_CTSCTRLB_CTSM_8         (PTC_CTSCTRLB_CTSM_8_Val       << PTC_CTSCTRLB_CTSM_Pos)
#define PTC_CTSCTRLB_CTSM_9         (PTC_CTSCTRLB_CTSM_9_Val       << PTC_CTSCTRLB_CTSM_Pos)
#define PTC_CTSCTRLB_CTSM_10        (PTC_CTSCTRLB_CTSM_10_Val      << PTC_CTSCTRLB_CTSM_Pos)
#define PTC_CTSCTRLB_CTSM_11        (PTC_CTSCTRLB_CTSM_11_Val      << PTC_CTSCTRLB_CTSM_Pos)
#define PTC_CTSCTRLB_CTSM_12        (PTC_CTSCTRLB_CTSM_12_Val      << PTC_CTSCTRLB_CTSM_Pos)
#define PTC_CTSCTRLB_CTSM_13        (PTC_CTSCTRLB_CTSM_13_Val      << PTC_CTSCTRLB_CTSM_Pos)
#define PTC_CTSCTRLB_CTSM_14        (PTC_CTSCTRLB_CTSM_14_Val      << PTC_CTSCTRLB_CTSM_Pos)
#define PTC_CTSCTRLB_CTSM_15        (PTC_CTSCTRLB_CTSM_15_Val      << PTC_CTSCTRLB_CTSM_Pos)
#define PTC_CTSCTRLB_MASK           0xFCu        /**< \brief (PTC_CTSCTRLB) Register Bits Mask */

/* -------- PTC_WINCCTRL : (PTC Offset: 0x21) (R/W  8) Window Comparator Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  WINCM:3;          /*!< bit:  0.. 2  Window Comparator Mode             */
    uint8_t  :5;               /*!< bit:  3.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_WINCCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

