zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define RFCTRL_FECFG_F0CFG_Pos      0            /**< \brief (RFCTRL_FECFG) Front-end control signal 0 configuration */
#define RFCTRL_FECFG_F0CFG_Msk      (0x3u << RFCTRL_FECFG_F0CFG_Pos)
#define RFCTRL_FECFG_F0CFG(value)   ((RFCTRL_FECFG_F0CFG_Msk & ((value) << RFCTRL_FECFG_F0CFG_Pos)))
#define RFCTRL_FECFG_F1CFG_Pos      2            /**< \brief (RFCTRL_FECFG) Front-end control signal 1 configuration */
#define RFCTRL_FECFG_F1CFG_Msk      (0x3u << RFCTRL_FECFG_F1CFG_Pos)
#define RFCTRL_FECFG_F1CFG(value)   ((RFCTRL_FECFG_F1CFG_Msk & ((value) << RFCTRL_FECFG_F1CFG_Pos)))
#define RFCTRL_FECFG_F2CFG_Pos      4            /**< \brief (RFCTRL_FECFG) Front-end control signal 2 configuration */
#define RFCTRL_FECFG_F2CFG_Msk      (0x3u << RFCTRL_FECFG_F2CFG_Pos)
#define RFCTRL_FECFG_F2CFG(value)   ((RFCTRL_FECFG_F2CFG_Msk & ((value) << RFCTRL_FECFG_F2CFG_Pos)))
#define RFCTRL_FECFG_F3CFG_Pos      6            /**< \brief (RFCTRL_FECFG) Front-end control signal 3 configuration */
#define RFCTRL_FECFG_F3CFG_Msk      (0x3u << RFCTRL_FECFG_F3CFG_Pos)
#define RFCTRL_FECFG_F3CFG(value)   ((RFCTRL_FECFG_F3CFG_Msk & ((value) << RFCTRL_FECFG_F3CFG_Pos)))
#define RFCTRL_FECFG_F4CFG_Pos      8            /**< \brief (RFCTRL_FECFG) Front-end control signal 4 configuration */
#define RFCTRL_FECFG_F4CFG_Msk      (0x3u << RFCTRL_FECFG_F4CFG_Pos)
#define RFCTRL_FECFG_F4CFG(value)   ((RFCTRL_FECFG_F4CFG_Msk & ((value) << RFCTRL_FECFG_F4CFG_Pos)))
#define RFCTRL_FECFG_F5CFG_Pos      10           /**< \brief (RFCTRL_FECFG) Front-end control signal 5 configuration */
#define RFCTRL_FECFG_F5CFG_Msk      (0x3u << RFCTRL_FECFG_F5CFG_Pos)
#define RFCTRL_FECFG_F5CFG(value)   ((RFCTRL_FECFG_F5CFG_Msk & ((value) << RFCTRL_FECFG_F5CFG_Pos)))
#define RFCTRL_FECFG_MASK           0x0FFFu      /**< \brief (RFCTRL_FECFG) Register Bits Mask */

/* -------- RFCTRL_TEST : (RFCTRL Offset: 0x4) (R/W 16) Test -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t TEN:1;            /*!< bit:      0  Transparent Test Enable            */
    uint16_t :1;               /*!< bit:      1  Reserved                           */
    uint16_t DIG1CFG:2;        /*!< bit:  2.. 3  DIG1 Direction during test         */
    uint16_t DIG2CFG:2;        /*!< bit:  4.. 5  DIG2 Direction during test         */
    uint16_t DIG3CFG:2;        /*!< bit:  6.. 7  DIG3/TSTIP Direction during test   */
    uint16_t DIG4CFG:2;        /*!< bit:  8.. 9  DIG4/TSTIN Direction during test   */
    uint16_t TSTOPCFG:2;       /*!< bit: 10..11  TSTOP Direction during test        */
    uint16_t TSTONCFG:2;       /*!< bit: 12..13  TSTON Direction during test        */
    uint16_t :2;               /*!< bit: 14..15  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} RFCTRL_TEST_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RFCTRL_TEST_OFFSET          0x4          /**< \brief (RFCTRL_TEST offset) Test */
#define RFCTRL_TEST_RESETVALUE      0x0000       /**< \brief (RFCTRL_TEST reset_value) Test */

#define RFCTRL_TEST_TEN_Pos         0            /**< \brief (RFCTRL_TEST) Transparent Test Enable */
#define RFCTRL_TEST_TEN             (0x1u << RFCTRL_TEST_TEN_Pos)
#define RFCTRL_TEST_DIG1CFG_Pos     2            /**< \brief (RFCTRL_TEST) DIG1 Direction during test */
#define RFCTRL_TEST_DIG1CFG_Msk     (0x3u << RFCTRL_TEST_DIG1CFG_Pos)
#define RFCTRL_TEST_DIG1CFG(value)  ((RFCTRL_TEST_DIG1CFG_Msk & ((value) << RFCTRL_TEST_DIG1CFG_Pos)))
#define RFCTRL_TEST_DIG2CFG_Pos     4            /**< \brief (RFCTRL_TEST) DIG2 Direction during test */
#define RFCTRL_TEST_DIG2CFG_Msk     (0x3u << RFCTRL_TEST_DIG2CFG_Pos)
#define RFCTRL_TEST_DIG2CFG(value)  ((RFCTRL_TEST_DIG2CFG_Msk & ((value) << RFCTRL_TEST_DIG2CFG_Pos)))
#define RFCTRL_TEST_DIG3CFG_Pos     6            /**< \brief (RFCTRL_TEST) DIG3/TSTIP Direction during test */
#define RFCTRL_TEST_DIG3CFG_Msk     (0x3u << RFCTRL_TEST_DIG3CFG_Pos)
#define RFCTRL_TEST_DIG3CFG(value)  ((RFCTRL_TEST_DIG3CFG_Msk & ((value) << RFCTRL_TEST_DIG3CFG_Pos)))
#define RFCTRL_TEST_DIG4CFG_Pos     8            /**< \brief (RFCTRL_TEST) DIG4/TSTIN Direction during test */
#define RFCTRL_TEST_DIG4CFG_Msk     (0x3u << RFCTRL_TEST_DIG4CFG_Pos)
#define RFCTRL_TEST_DIG4CFG(value)  ((RFCTRL_TEST_DIG4CFG_Msk & ((value) << RFCTRL_TEST_DIG4CFG_Pos)))
#define RFCTRL_TEST_TSTOPCFG_Pos    10           /**< \brief (RFCTRL_TEST) TSTOP Direction during test */
#define RFCTRL_TEST_TSTOPCFG_Msk    (0x3u << RFCTRL_TEST_TSTOPCFG_Pos)
#define RFCTRL_TEST_TSTOPCFG(value) ((RFCTRL_TEST_TSTOPCFG_Msk & ((value) << RFCTRL_TEST_TSTOPCFG_Pos)))
#define RFCTRL_TEST_TSTONCFG_Pos    12           /**< \brief (RFCTRL_TEST) TSTON Direction during test */
#define RFCTRL_TEST_TSTONCFG_Msk    (0x3u << RFCTRL_TEST_TSTONCFG_Pos)
#define RFCTRL_TEST_TSTONCFG(value) ((RFCTRL_TEST_TSTONCFG_Msk & ((value) << RFCTRL_TEST_TSTONCFG_Pos)))
#define RFCTRL_TEST_MASK            0x3FFDu      /**< \brief (RFCTRL_TEST) Register Bits Mask */

/** \brief RFCTRL hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  __IO RFCTRL_FECFG_Type         FECFG;       /**< \brief Offset: 0x0 (R/W 16) Front-end control bus configuration */
       RoReg8                    Reserved1[0x2];
  __IO RFCTRL_TEST_Type          TEST;        /**< \brief Offset: 0x4 (R/W 16) Test */
} Rfctrl;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR RSTC */
/* ========================================================================== */
/** \addtogroup U3005_RSTC Reset Controller */
/*@{*/

#define RSTC_U2239
#define REV_RSTC                    0x100

/* -------- RSTC_RCAUSE : (RSTC Offset: 0x00) (R/   8) Reset Cause -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  POR:1;            /*!< bit:      0  Power On Reset                     */
    uint8_t  BOD12:1;          /*!< bit:      1  Brown Out 12 Detector Reset        */
    uint8_t  BOD33:1;          /*!< bit:      2  Brown Out 33 Detector Reset        */
    uint8_t  :1;               /*!< bit:      3  Reserved                           */
    uint8_t  EXT:1;            /*!< bit:      4  External Reset                     */
    uint8_t  WDT:1;            /*!< bit:      5  Watchdog Reset                     */
    uint8_t  SYST:1;           /*!< bit:      6  System Reset Request               */
    uint8_t  BACKUP:1;         /*!< bit:      7  Backup Reset                       */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} RSTC_RCAUSE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RSTC_RCAUSE_OFFSET          0x00         /**< \brief (RSTC_RCAUSE offset) Reset Cause */

#define RSTC_RCAUSE_POR_Pos         0            /**< \brief (RSTC_RCAUSE) Power On Reset */
#define RSTC_RCAUSE_POR             (0x1u << RSTC_RCAUSE_POR_Pos)
#define RSTC_RCAUSE_BOD12_Pos       1            /**< \brief (RSTC_RCAUSE) Brown Out 12 Detector Reset */
#define RSTC_RCAUSE_BOD12           (0x1u << RSTC_RCAUSE_BOD12_Pos)
#define RSTC_RCAUSE_BOD33_Pos       2            /**< \brief (RSTC_RCAUSE) Brown Out 33 Detector Reset */
#define RSTC_RCAUSE_BOD33           (0x1u << RSTC_RCAUSE_BOD33_Pos)
#define RSTC_RCAUSE_EXT_Pos         4            /**< \brief (RSTC_RCAUSE) External Reset */
#define RSTC_RCAUSE_EXT             (0x1u << RSTC_RCAUSE_EXT_Pos)
#define RSTC_RCAUSE_WDT_Pos         5            /**< \brief (RSTC_RCAUSE) Watchdog Reset */
#define RSTC_RCAUSE_WDT             (0x1u << RSTC_RCAUSE_WDT_Pos)
#define RSTC_RCAUSE_SYST_Pos        6            /**< \brief (RSTC_RCAUSE) System Reset Request */
#define RSTC_RCAUSE_SYST            (0x1u << RSTC_RCAUSE_SYST_Pos)
#define RSTC_RCAUSE_BACKUP_Pos      7            /**< \brief (RSTC_RCAUSE) Backup Reset */
#define RSTC_RCAUSE_BACKUP          (0x1u << RSTC_RCAUSE_BACKUP_Pos)
#define RSTC_RCAUSE_MASK            0xF7u        /**< \brief (RSTC_RCAUSE) Register Bits Mask */

