zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
/* -------- SUPC_BKOUT : (SUPC Offset: 0x24) (R/W 32) Backup Output Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t EN:2;             /*!< bit:  0.. 1  Enable Output                      */
    uint32_t :6;               /*!< bit:  2.. 7  Reserved                           */
    uint32_t CLR:2;            /*!< bit:  8.. 9  Clear Output                       */
    uint32_t :6;               /*!< bit: 10..15  Reserved                           */
    uint32_t SET:2;            /*!< bit: 16..17  Set Output                         */
    uint32_t :6;               /*!< bit: 18..23  Reserved                           */
    uint32_t RTCTGL:2;         /*!< bit: 24..25  RTC Toggle Output                  */
    uint32_t :6;               /*!< bit: 26..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SUPC_BKOUT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SUPC_BKOUT_OFFSET           0x24         /**< \brief (SUPC_BKOUT offset) Backup Output Control */
#define SUPC_BKOUT_RESETVALUE       0x00000000   /**< \brief (SUPC_BKOUT reset_value) Backup Output Control */

#define SUPC_BKOUT_EN_Pos           0            /**< \brief (SUPC_BKOUT) Enable Output */
#define SUPC_BKOUT_EN_Msk           (0x3u << SUPC_BKOUT_EN_Pos)
#define SUPC_BKOUT_EN(value)        ((SUPC_BKOUT_EN_Msk & ((value) << SUPC_BKOUT_EN_Pos)))
#define SUPC_BKOUT_CLR_Pos          8            /**< \brief (SUPC_BKOUT) Clear Output */
#define SUPC_BKOUT_CLR_Msk          (0x3u << SUPC_BKOUT_CLR_Pos)
#define SUPC_BKOUT_CLR(value)       ((SUPC_BKOUT_CLR_Msk & ((value) << SUPC_BKOUT_CLR_Pos)))
#define SUPC_BKOUT_SET_Pos          16           /**< \brief (SUPC_BKOUT) Set Output */
#define SUPC_BKOUT_SET_Msk          (0x3u << SUPC_BKOUT_SET_Pos)
#define SUPC_BKOUT_SET(value)       ((SUPC_BKOUT_SET_Msk & ((value) << SUPC_BKOUT_SET_Pos)))
#define SUPC_BKOUT_RTCTGL_Pos       24           /**< \brief (SUPC_BKOUT) RTC Toggle Output */
#define SUPC_BKOUT_RTCTGL_Msk       (0x3u << SUPC_BKOUT_RTCTGL_Pos)
#define SUPC_BKOUT_RTCTGL(value)    ((SUPC_BKOUT_RTCTGL_Msk & ((value) << SUPC_BKOUT_RTCTGL_Pos)))
#define SUPC_BKOUT_MASK             0x03030303u  /**< \brief (SUPC_BKOUT) Register Bits Mask */

/* -------- SUPC_BKIN : (SUPC Offset: 0x28) (R/  32) Backup Input Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t BKIN:8;           /*!< bit:  0.. 7  Backup Input Value                 */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SUPC_BKIN_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SUPC_BKIN_OFFSET            0x28         /**< \brief (SUPC_BKIN offset) Backup Input Control */
#define SUPC_BKIN_RESETVALUE        0x00000000   /**< \brief (SUPC_BKIN reset_value) Backup Input Control */

#define SUPC_BKIN_BKIN_Pos          0            /**< \brief (SUPC_BKIN) Backup Input Value */
#define SUPC_BKIN_BKIN_Msk          (0xFFu << SUPC_BKIN_BKIN_Pos)
#define SUPC_BKIN_BKIN(value)       ((SUPC_BKIN_BKIN_Msk & ((value) << SUPC_BKIN_BKIN_Pos)))
#define SUPC_BKIN_MASK              0x000000FFu  /**< \brief (SUPC_BKIN) Register Bits Mask */

/* -------- SUPC_BUVREGCAL : (SUPC Offset: 0x30) (R/W 32) VREG Calibration -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t BKUP:4;           /*!< bit:  0.. 3  Calibration of backup VREG in backup mode */
    uint32_t :4;               /*!< bit:  4.. 7  Reserved                           */
    uint32_t NOTINBKUP:4;      /*!< bit:  8..11  Calibration of backup VREG in all modes except backup mode */
    uint32_t :20;              /*!< bit: 12..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SUPC_BUVREGCAL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SUPC_BUVREGCAL_OFFSET       0x30         /**< \brief (SUPC_BUVREGCAL offset) VREG Calibration */
#define SUPC_BUVREGCAL_RESETVALUE   0x00000000   /**< \brief (SUPC_BUVREGCAL reset_value) VREG Calibration */

#define SUPC_BUVREGCAL_BKUP_Pos     0            /**< \brief (SUPC_BUVREGCAL) Calibration of backup VREG in backup mode */
#define SUPC_BUVREGCAL_BKUP_Msk     (0xFu << SUPC_BUVREGCAL_BKUP_Pos)
#define SUPC_BUVREGCAL_BKUP(value)  ((SUPC_BUVREGCAL_BKUP_Msk & ((value) << SUPC_BUVREGCAL_BKUP_Pos)))
#define SUPC_BUVREGCAL_NOTINBKUP_Pos 8            /**< \brief (SUPC_BUVREGCAL) Calibration of backup VREG in all modes except backup mode */
#define SUPC_BUVREGCAL_NOTINBKUP_Msk (0xFu << SUPC_BUVREGCAL_NOTINBKUP_Pos)
#define SUPC_BUVREGCAL_NOTINBKUP(value) ((SUPC_BUVREGCAL_NOTINBKUP_Msk & ((value) << SUPC_BUVREGCAL_NOTINBKUP_Pos)))
#define SUPC_BUVREGCAL_MASK         0x00000F0Fu  /**< \brief (SUPC_BUVREGCAL) Register Bits Mask */

/* -------- SUPC_MVREGCAL : (SUPC Offset: 0x34) (R/W 32) Main VREG Calibration -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t PL0:8;            /*!< bit:  0.. 7  PL0 Voltage                        */
    uint32_t PL1:8;            /*!< bit:  8..15  PL1 Voltage                        */
    uint32_t PL2:8;            /*!< bit: 16..23  PL2 Voltage                        */
    uint32_t PL3:8;            /*!< bit: 24..31  PL3 Voltage                        */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SUPC_MVREGCAL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

