zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define SUPC_MVREGCAL_OFFSET        0x34         /**< \brief (SUPC_MVREGCAL offset) Main VREG Calibration */

#define SUPC_MVREGCAL_PL0_Pos       0            /**< \brief (SUPC_MVREGCAL) PL0 Voltage */
#define SUPC_MVREGCAL_PL0_Msk       (0xFFu << SUPC_MVREGCAL_PL0_Pos)
#define SUPC_MVREGCAL_PL0(value)    ((SUPC_MVREGCAL_PL0_Msk & ((value) << SUPC_MVREGCAL_PL0_Pos)))
#define SUPC_MVREGCAL_PL1_Pos       8            /**< \brief (SUPC_MVREGCAL) PL1 Voltage */
#define SUPC_MVREGCAL_PL1_Msk       (0xFFu << SUPC_MVREGCAL_PL1_Pos)
#define SUPC_MVREGCAL_PL1(value)    ((SUPC_MVREGCAL_PL1_Msk & ((value) << SUPC_MVREGCAL_PL1_Pos)))
#define SUPC_MVREGCAL_PL2_Pos       16           /**< \brief (SUPC_MVREGCAL) PL2 Voltage */
#define SUPC_MVREGCAL_PL2_Msk       (0xFFu << SUPC_MVREGCAL_PL2_Pos)
#define SUPC_MVREGCAL_PL2(value)    ((SUPC_MVREGCAL_PL2_Msk & ((value) << SUPC_MVREGCAL_PL2_Pos)))
#define SUPC_MVREGCAL_PL3_Pos       24           /**< \brief (SUPC_MVREGCAL) PL3 Voltage */
#define SUPC_MVREGCAL_PL3_Msk       (0xFFu << SUPC_MVREGCAL_PL3_Pos)
#define SUPC_MVREGCAL_PL3(value)    ((SUPC_MVREGCAL_PL3_Msk & ((value) << SUPC_MVREGCAL_PL3_Pos)))
#define SUPC_MVREGCAL_MASK          0xFFFFFFFFu  /**< \brief (SUPC_MVREGCAL) Register Bits Mask */

/* -------- SUPC_VREFCAL : (SUPC Offset: 0x38) (R/W 32) VREF Calibration -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TEMP:4;           /*!< bit:  0.. 3  Temperature Calibration of VREF    */
    uint32_t :4;               /*!< bit:  4.. 7  Reserved                           */
    uint32_t VREFVREG:8;       /*!< bit:  8..15  Calibration of VREF of Main VREG   */
    uint32_t VREF0:8;          /*!< bit: 16..23  Calibration of VREF0               */
    uint32_t VREF1:8;          /*!< bit: 24..31  Calibration of VREF1               */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SUPC_VREFCAL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SUPC_VREFCAL_OFFSET         0x38         /**< \brief (SUPC_VREFCAL offset) VREF Calibration */
#define SUPC_VREFCAL_RESETVALUE     0x00000000   /**< \brief (SUPC_VREFCAL reset_value) VREF Calibration */

#define SUPC_VREFCAL_TEMP_Pos       0            /**< \brief (SUPC_VREFCAL) Temperature Calibration of VREF */
#define SUPC_VREFCAL_TEMP_Msk       (0xFu << SUPC_VREFCAL_TEMP_Pos)
#define SUPC_VREFCAL_TEMP(value)    ((SUPC_VREFCAL_TEMP_Msk & ((value) << SUPC_VREFCAL_TEMP_Pos)))
#define SUPC_VREFCAL_VREFVREG_Pos   8            /**< \brief (SUPC_VREFCAL) Calibration of VREF of Main VREG */
#define SUPC_VREFCAL_VREFVREG_Msk   (0xFFu << SUPC_VREFCAL_VREFVREG_Pos)
#define SUPC_VREFCAL_VREFVREG(value) ((SUPC_VREFCAL_VREFVREG_Msk & ((value) << SUPC_VREFCAL_VREFVREG_Pos)))
#define SUPC_VREFCAL_VREF0_Pos      16           /**< \brief (SUPC_VREFCAL) Calibration of VREF0 */
#define SUPC_VREFCAL_VREF0_Msk      (0xFFu << SUPC_VREFCAL_VREF0_Pos)
#define SUPC_VREFCAL_VREF0(value)   ((SUPC_VREFCAL_VREF0_Msk & ((value) << SUPC_VREFCAL_VREF0_Pos)))
#define SUPC_VREFCAL_VREF1_Pos      24           /**< \brief (SUPC_VREFCAL) Calibration of VREF1 */
#define SUPC_VREFCAL_VREF1_Msk      (0xFFu << SUPC_VREFCAL_VREF1_Pos)
#define SUPC_VREFCAL_VREF1(value)   ((SUPC_VREFCAL_VREF1_Msk & ((value) << SUPC_VREFCAL_VREF1_Pos)))
#define SUPC_VREFCAL_MASK           0xFFFFFF0Fu  /**< \brief (SUPC_VREFCAL) Register Bits Mask */

/* -------- SUPC_VREGTEST : (SUPC Offset: 0x3C) (R/W 32) VREG Test -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t LDOEN:1;          /*!< bit:      0  LDO VREG Enable                    */
    uint32_t BUCKEN:1;         /*!< bit:      1  BUCK VREG Enable                   */
    uint32_t VREGREF:1;        /*!< bit:      2  VREG selection of VREF             */
    uint32_t COMPCLKEN:1;      /*!< bit:      3  BUCK Comparator Clock Output Enable */
    uint32_t BUCKTESTEN:1;     /*!< bit:      4  Buck Test Enable                   */
    uint32_t :3;               /*!< bit:  5.. 7  Reserved                           */
    uint32_t SCEN:1;           /*!< bit:      8  SC VREG Enable                     */
    uint32_t :7;               /*!< bit:  9..15  Reserved                           */
    uint32_t LDORDY:1;         /*!< bit:     16  LDO VREG ready                     */
    uint32_t BUCKRDY:1;        /*!< bit:     17  BUCK VREG ready                    */
    uint32_t SCRDY:1;          /*!< bit:     18  SC VREG Ready                      */
    uint32_t :5;               /*!< bit: 19..23  Reserved                           */
    uint32_t APWSBOOST:1;      /*!< bit:     24  utomatic Power Switch Boost        */
    uint32_t :5;               /*!< bit: 25..29  Reserved                           */
    uint32_t FVREFVREG:1;      /*!< bit:     30  Force VREF of Main VREG to VREFVREG */
    uint32_t TESTEN:1;         /*!< bit:     31  TEST Enable                        */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SUPC_VREGTEST_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SUPC_VREGTEST_OFFSET        0x3C         /**< \brief (SUPC_VREGTEST offset) VREG Test */
#define SUPC_VREGTEST_RESETVALUE    0x00000000   /**< \brief (SUPC_VREGTEST reset_value) VREG Test */

#define SUPC_VREGTEST_LDOEN_Pos     0            /**< \brief (SUPC_VREGTEST) LDO VREG Enable */
#define SUPC_VREGTEST_LDOEN         (0x1u << SUPC_VREGTEST_LDOEN_Pos)
#define SUPC_VREGTEST_BUCKEN_Pos    1            /**< \brief (SUPC_VREGTEST) BUCK VREG Enable */
#define SUPC_VREGTEST_BUCKEN        (0x1u << SUPC_VREGTEST_BUCKEN_Pos)
#define SUPC_VREGTEST_VREGREF_Pos   2            /**< \brief (SUPC_VREGTEST) VREG selection of VREF */
#define SUPC_VREGTEST_VREGREF       (0x1u << SUPC_VREGTEST_VREGREF_Pos)
#define SUPC_VREGTEST_COMPCLKEN_Pos 3            /**< \brief (SUPC_VREGTEST) BUCK Comparator Clock Output Enable */
#define SUPC_VREGTEST_COMPCLKEN     (0x1u << SUPC_VREGTEST_COMPCLKEN_Pos)
#define SUPC_VREGTEST_BUCKTESTEN_Pos 4            /**< \brief (SUPC_VREGTEST) Buck Test Enable */
#define SUPC_VREGTEST_BUCKTESTEN    (0x1u << SUPC_VREGTEST_BUCKTESTEN_Pos)
#define SUPC_VREGTEST_SCEN_Pos      8            /**< \brief (SUPC_VREGTEST) SC VREG Enable */
#define SUPC_VREGTEST_SCEN          (0x1u << SUPC_VREGTEST_SCEN_Pos)
#define SUPC_VREGTEST_LDORDY_Pos    16           /**< \brief (SUPC_VREGTEST) LDO VREG ready */
#define SUPC_VREGTEST_LDORDY        (0x1u << SUPC_VREGTEST_LDORDY_Pos)
#define SUPC_VREGTEST_BUCKRDY_Pos   17           /**< \brief (SUPC_VREGTEST) BUCK VREG ready */
#define SUPC_VREGTEST_BUCKRDY       (0x1u << SUPC_VREGTEST_BUCKRDY_Pos)
#define SUPC_VREGTEST_SCRDY_Pos     18           /**< \brief (SUPC_VREGTEST) SC VREG Ready */
#define SUPC_VREGTEST_SCRDY         (0x1u << SUPC_VREGTEST_SCRDY_Pos)
#define SUPC_VREGTEST_APWSBOOST_Pos 24           /**< \brief (SUPC_VREGTEST) utomatic Power Switch Boost */
#define SUPC_VREGTEST_APWSBOOST     (0x1u << SUPC_VREGTEST_APWSBOOST_Pos)
#define SUPC_VREGTEST_FVREFVREG_Pos 30           /**< \brief (SUPC_VREGTEST) Force VREF of Main VREG to VREFVREG */
#define SUPC_VREGTEST_FVREFVREG     (0x1u << SUPC_VREGTEST_FVREFVREG_Pos)
#define SUPC_VREGTEST_TESTEN_Pos    31           /**< \brief (SUPC_VREGTEST) TEST Enable */
#define SUPC_VREGTEST_TESTEN        (0x1u << SUPC_VREGTEST_TESTEN_Pos)
#define SUPC_VREGTEST_MASK          0xC107011Fu  /**< \brief (SUPC_VREGTEST) Register Bits Mask */

/* -------- SUPC_VREFTEST : (SUPC Offset: 0x40) (R/W 32) VREF Test -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t BIASEN:1;         /*!< bit:      0  Enable of Bias                     */
    uint32_t VREFEN:3;         /*!< bit:  1.. 3  Enable of VREF                     */
    uint32_t BUFRREN:1;        /*!< bit:      4  Enable Rail to Rail Buffer         */
    uint32_t BGBUF_ADCSHORT:1; /*!< bit:      5  BGBUFRR output connected to ADC VREF */
    uint32_t BGBUFBOOST:1;     /*!< bit:      6  Boost Enable of VREF buffers       */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t BUFRRSEL:3;       /*!< bit:  8..10  Rail-to-Rail Buffer Input Select   */
    uint32_t BGBUFEN:5;        /*!< bit: 11..15  VREF Buffer Enable                 */
    uint32_t BIASRDY:1;        /*!< bit:     16  Bias Ready                         */
    uint32_t VREFRDY:3;        /*!< bit: 17..19  VREF Ready                         */
    uint32_t :4;               /*!< bit: 20..23  Reserved                           */
    uint32_t BGBUFRDY:5;       /*!< bit: 24..28  VREF Buffers Ready                 */
    uint32_t BUFRRRDY:1;       /*!< bit:     29  Rail to rail buffer Ready          */
    uint32_t :1;               /*!< bit:     30  Reserved                           */
    uint32_t TESTEN:1;         /*!< bit:     31  Test Enable                        */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SUPC_VREFTEST_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

