zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define SUPC_VREFTEST_OFFSET        0x40         /**< \brief (SUPC_VREFTEST offset) VREF Test */
#define SUPC_VREFTEST_RESETVALUE    0x00000000   /**< \brief (SUPC_VREFTEST reset_value) VREF Test */

#define SUPC_VREFTEST_BIASEN_Pos    0            /**< \brief (SUPC_VREFTEST) Enable of Bias */
#define SUPC_VREFTEST_BIASEN        (0x1u << SUPC_VREFTEST_BIASEN_Pos)
#define SUPC_VREFTEST_VREFEN_Pos    1            /**< \brief (SUPC_VREFTEST) Enable of VREF */
#define SUPC_VREFTEST_VREFEN_Msk    (0x7u << SUPC_VREFTEST_VREFEN_Pos)
#define SUPC_VREFTEST_VREFEN(value) ((SUPC_VREFTEST_VREFEN_Msk & ((value) << SUPC_VREFTEST_VREFEN_Pos)))
#define SUPC_VREFTEST_BUFRREN_Pos   4            /**< \brief (SUPC_VREFTEST) Enable Rail to Rail Buffer */
#define SUPC_VREFTEST_BUFRREN       (0x1u << SUPC_VREFTEST_BUFRREN_Pos)
#define SUPC_VREFTEST_BGBUF_ADCSHORT_Pos 5            /**< \brief (SUPC_VREFTEST) BGBUFRR output connected to ADC VREF */
#define SUPC_VREFTEST_BGBUF_ADCSHORT (0x1u << SUPC_VREFTEST_BGBUF_ADCSHORT_Pos)
#define SUPC_VREFTEST_BGBUFBOOST_Pos 6            /**< \brief (SUPC_VREFTEST) Boost Enable of VREF buffers */
#define SUPC_VREFTEST_BGBUFBOOST    (0x1u << SUPC_VREFTEST_BGBUFBOOST_Pos)
#define SUPC_VREFTEST_BUFRRSEL_Pos  8            /**< \brief (SUPC_VREFTEST) Rail-to-Rail Buffer Input Select */
#define SUPC_VREFTEST_BUFRRSEL_Msk  (0x7u << SUPC_VREFTEST_BUFRRSEL_Pos)
#define SUPC_VREFTEST_BUFRRSEL(value) ((SUPC_VREFTEST_BUFRRSEL_Msk & ((value) << SUPC_VREFTEST_BUFRRSEL_Pos)))
#define SUPC_VREFTEST_BGBUFEN_Pos   11           /**< \brief (SUPC_VREFTEST) VREF Buffer Enable */
#define SUPC_VREFTEST_BGBUFEN_Msk   (0x1Fu << SUPC_VREFTEST_BGBUFEN_Pos)
#define SUPC_VREFTEST_BGBUFEN(value) ((SUPC_VREFTEST_BGBUFEN_Msk & ((value) << SUPC_VREFTEST_BGBUFEN_Pos)))
#define SUPC_VREFTEST_BIASRDY_Pos   16           /**< \brief (SUPC_VREFTEST) Bias Ready */
#define SUPC_VREFTEST_BIASRDY       (0x1u << SUPC_VREFTEST_BIASRDY_Pos)
#define SUPC_VREFTEST_VREFRDY_Pos   17           /**< \brief (SUPC_VREFTEST) VREF Ready */
#define SUPC_VREFTEST_VREFRDY_Msk   (0x7u << SUPC_VREFTEST_VREFRDY_Pos)
#define SUPC_VREFTEST_VREFRDY(value) ((SUPC_VREFTEST_VREFRDY_Msk & ((value) << SUPC_VREFTEST_VREFRDY_Pos)))
#define SUPC_VREFTEST_BGBUFRDY_Pos  24           /**< \brief (SUPC_VREFTEST) VREF Buffers Ready */
#define SUPC_VREFTEST_BGBUFRDY_Msk  (0x1Fu << SUPC_VREFTEST_BGBUFRDY_Pos)
#define SUPC_VREFTEST_BGBUFRDY(value) ((SUPC_VREFTEST_BGBUFRDY_Msk & ((value) << SUPC_VREFTEST_BGBUFRDY_Pos)))
#define SUPC_VREFTEST_BUFRRRDY_Pos  29           /**< \brief (SUPC_VREFTEST) Rail to rail buffer Ready */
#define SUPC_VREFTEST_BUFRRRDY      (0x1u << SUPC_VREFTEST_BUFRRRDY_Pos)
#define SUPC_VREFTEST_TESTEN_Pos    31           /**< \brief (SUPC_VREFTEST) Test Enable */
#define SUPC_VREFTEST_TESTEN        (0x1u << SUPC_VREFTEST_TESTEN_Pos)
#define SUPC_VREFTEST_MASK          0xBF0FFF7Fu  /**< \brief (SUPC_VREFTEST) Register Bits Mask */

/* -------- SUPC_TESTMODE : (SUPC Offset: 0x44) (R/W 32) Test Mode -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t VREG:1;           /*!< bit:      0  VREG (LDO/BUCK/SC) Test Mode Enable */
    uint32_t VREGFOBS:1;       /*!< bit:      1  VREG/VREF observability            */
    uint32_t :1;               /*!< bit:      2  Reserved                           */
    uint32_t VREF:1;           /*!< bit:      3  VREF Test Mode Enable              */
    uint32_t BOD12:1;          /*!< bit:      4  BOD12 Test Mode Enable             */
    uint32_t BOD33:1;          /*!< bit:      5  BOD33 Test Mode Enable             */
    uint32_t APWS:1;           /*!< bit:      6  Automatic Power Switch Test Mode Enable */
    uint32_t POR33:1;          /*!< bit:      7  POR33s Test Mode Enable            */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SUPC_TESTMODE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SUPC_TESTMODE_OFFSET        0x44         /**< \brief (SUPC_TESTMODE offset) Test Mode */
#define SUPC_TESTMODE_RESETVALUE    0x00000000   /**< \brief (SUPC_TESTMODE reset_value) Test Mode */

#define SUPC_TESTMODE_VREG_Pos      0            /**< \brief (SUPC_TESTMODE) VREG (LDO/BUCK/SC) Test Mode Enable */
#define SUPC_TESTMODE_VREG          (0x1u << SUPC_TESTMODE_VREG_Pos)
#define SUPC_TESTMODE_VREGFOBS_Pos  1            /**< \brief (SUPC_TESTMODE) VREG/VREF observability */
#define SUPC_TESTMODE_VREGFOBS      (0x1u << SUPC_TESTMODE_VREGFOBS_Pos)
#define SUPC_TESTMODE_VREF_Pos      3            /**< \brief (SUPC_TESTMODE) VREF Test Mode Enable */
#define SUPC_TESTMODE_VREF          (0x1u << SUPC_TESTMODE_VREF_Pos)
#define SUPC_TESTMODE_BOD12_Pos     4            /**< \brief (SUPC_TESTMODE) BOD12 Test Mode Enable */
#define SUPC_TESTMODE_BOD12         (0x1u << SUPC_TESTMODE_BOD12_Pos)
#define SUPC_TESTMODE_BOD33_Pos     5            /**< \brief (SUPC_TESTMODE) BOD33 Test Mode Enable */
#define SUPC_TESTMODE_BOD33         (0x1u << SUPC_TESTMODE_BOD33_Pos)
#define SUPC_TESTMODE_APWS_Pos      6            /**< \brief (SUPC_TESTMODE) Automatic Power Switch Test Mode Enable */
#define SUPC_TESTMODE_APWS          (0x1u << SUPC_TESTMODE_APWS_Pos)
#define SUPC_TESTMODE_POR33_Pos     7            /**< \brief (SUPC_TESTMODE) POR33s Test Mode Enable */
#define SUPC_TESTMODE_POR33         (0x1u << SUPC_TESTMODE_POR33_Pos)
#define SUPC_TESTMODE_MASK          0x000000FBu  /**< \brief (SUPC_TESTMODE) Register Bits Mask */

/** \brief SUPC hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  __IO SUPC_INTENCLR_Type        INTENCLR;    /**< \brief Offset: 0x00 (R/W 32) Interrupt Enable Clear */
  __IO SUPC_INTENSET_Type        INTENSET;    /**< \brief Offset: 0x04 (R/W 32) Interrupt Enable Set */
  __IO SUPC_INTFLAG_Type         INTFLAG;     /**< \brief Offset: 0x08 (R/W 32) Interrupt Flag Status and Clear */
  __I  SUPC_STATUS_Type          STATUS;      /**< \brief Offset: 0x0C (R/  32) Power and Clocks Status */
  __IO SUPC_BOD33_Type           BOD33;       /**< \brief Offset: 0x10 (R/W 32) BOD33 Control */
  __IO SUPC_BOD12_Type           BOD12;       /**< \brief Offset: 0x14 (R/W 32) BOD12 Control */
  __IO SUPC_VREG_Type            VREG;        /**< \brief Offset: 0x18 (R/W 32) VREG Control */
  __IO SUPC_VREF_Type            VREF;        /**< \brief Offset: 0x1C (R/W 32) VREF Control */
  __IO SUPC_BBPS_Type            BBPS;        /**< \brief Offset: 0x20 (R/W 32) Battery Backup Power Switch */
  __IO SUPC_BKOUT_Type           BKOUT;       /**< \brief Offset: 0x24 (R/W 32) Backup Output Control */
  __I  SUPC_BKIN_Type            BKIN;        /**< \brief Offset: 0x28 (R/  32) Backup Input Control */
       RoReg8                    Reserved1[0x4];
  __IO SUPC_BUVREGCAL_Type       BUVREGCAL;   /**< \brief Offset: 0x30 (R/W 32) VREG Calibration */
  __IO SUPC_MVREGCAL_Type        MVREGCAL;    /**< \brief Offset: 0x34 (R/W 32) Main VREG Calibration */
  __IO SUPC_VREFCAL_Type         VREFCAL;     /**< \brief Offset: 0x38 (R/W 32) VREF Calibration */
  __IO SUPC_VREGTEST_Type        VREGTEST;    /**< \brief Offset: 0x3C (R/W 32) VREG Test */
  __IO SUPC_VREFTEST_Type        VREFTEST;    /**< \brief Offset: 0x40 (R/W 32) VREF Test */
  __IO SUPC_TESTMODE_Type        TESTMODE;    /**< \brief Offset: 0x44 (R/W 32) Test Mode */
} Supc;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR TAL */
/* ========================================================================== */
/** \addtogroup U3005_TAL Trigger Allocator */
/*@{*/

#define TAL_U2253
#define REV_TAL                     0x100

