zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define USB_DESCADD_OFFSET          0x024        /**< \brief (USB_DESCADD offset) Descriptor Address */
#define USB_DESCADD_RESETVALUE      0x00000000   /**< \brief (USB_DESCADD reset_value) Descriptor Address */

#define USB_DESCADD_DESCADD_Pos     0            /**< \brief (USB_DESCADD) Descriptor Address Value */
#define USB_DESCADD_DESCADD_Msk     (0xFFFFFFFFu << USB_DESCADD_DESCADD_Pos)
#define USB_DESCADD_DESCADD(value)  ((USB_DESCADD_DESCADD_Msk & ((value) << USB_DESCADD_DESCADD_Pos)))
#define USB_DESCADD_MASK            0xFFFFFFFFu  /**< \brief (USB_DESCADD) Register Bits Mask */

/* -------- USB_PADCAL : (USB Offset: 0x028) (R/W 16) USB PAD Calibration -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t TRANSP:5;         /*!< bit:  0.. 4  USB Pad Transp calibration         */
    uint16_t :1;               /*!< bit:      5  Reserved                           */
    uint16_t TRANSN:5;         /*!< bit:  6..10  USB Pad Transn calibration         */
    uint16_t :1;               /*!< bit:     11  Reserved                           */
    uint16_t TRIM:3;           /*!< bit: 12..14  USB Pad Trim calibration           */
    uint16_t :1;               /*!< bit:     15  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} USB_PADCAL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USB_PADCAL_OFFSET           0x028        /**< \brief (USB_PADCAL offset) USB PAD Calibration */
#define USB_PADCAL_RESETVALUE       0x0000       /**< \brief (USB_PADCAL reset_value) USB PAD Calibration */

#define USB_PADCAL_TRANSP_Pos       0            /**< \brief (USB_PADCAL) USB Pad Transp calibration */
#define USB_PADCAL_TRANSP_Msk       (0x1Fu << USB_PADCAL_TRANSP_Pos)
#define USB_PADCAL_TRANSP(value)    ((USB_PADCAL_TRANSP_Msk & ((value) << USB_PADCAL_TRANSP_Pos)))
#define USB_PADCAL_TRANSN_Pos       6            /**< \brief (USB_PADCAL) USB Pad Transn calibration */
#define USB_PADCAL_TRANSN_Msk       (0x1Fu << USB_PADCAL_TRANSN_Pos)
#define USB_PADCAL_TRANSN(value)    ((USB_PADCAL_TRANSN_Msk & ((value) << USB_PADCAL_TRANSN_Pos)))
#define USB_PADCAL_TRIM_Pos         12           /**< \brief (USB_PADCAL) USB Pad Trim calibration */
#define USB_PADCAL_TRIM_Msk         (0x7u << USB_PADCAL_TRIM_Pos)
#define USB_PADCAL_TRIM(value)      ((USB_PADCAL_TRIM_Msk & ((value) << USB_PADCAL_TRIM_Pos)))
#define USB_PADCAL_MASK             0x77DFu      /**< \brief (USB_PADCAL) Register Bits Mask */

/* -------- USB_TESTC : (USB Offset: 0x048) (R/W 16) Test C, allow to overwrite USB pad values -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t PADTEST:1;        /*!< bit:      0  usb pad test mode                  */
    uint16_t LOW_PIN_COUNT:1;  /*!< bit:      1  low pin count enable               */
    uint16_t FS:1;             /*!< bit:      2  fast speed                         */
    uint16_t ONN:1;            /*!< bit:      3  onn                                */
    uint16_t PDONDP:1;         /*!< bit:      4  pdondp                             */
    uint16_t PDONDM:1;         /*!< bit:      5  pdondm                             */
    uint16_t PUON:1;           /*!< bit:      6  puon                               */
    uint16_t PUIDLE:1;         /*!< bit:      7  puidle                             */
    uint16_t EOPN:1;           /*!< bit:      8  eopn                               */
    uint16_t OEN:1;            /*!< bit:      9  eon                                */
    uint16_t TXD:1;            /*!< bit:     10  txd                                */
    uint16_t BYPASS_DPLL:1;    /*!< bit:     11  Bypass USB DPLL                    */
    uint16_t :1;               /*!< bit:     12  Reserved                           */
    uint16_t RXD:1;            /*!< bit:     13  rxd                                */
    uint16_t RXDP:1;           /*!< bit:     14  rxdp                               */
    uint16_t RXDM:1;           /*!< bit:     15  rxdm                               */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} USB_TESTC_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USB_TESTC_OFFSET            0x048        /**< \brief (USB_TESTC offset) Test C, allow to overwrite USB pad values */
#define USB_TESTC_RESETVALUE        0x0000       /**< \brief (USB_TESTC reset_value) Test C, allow to overwrite USB pad values */

#define USB_TESTC_PADTEST_Pos       0            /**< \brief (USB_TESTC) usb pad test mode */
#define USB_TESTC_PADTEST           (0x1u << USB_TESTC_PADTEST_Pos)
#define USB_TESTC_LOW_PIN_COUNT_Pos 1            /**< \brief (USB_TESTC) low pin count enable */
#define USB_TESTC_LOW_PIN_COUNT     (0x1u << USB_TESTC_LOW_PIN_COUNT_Pos)
#define USB_TESTC_FS_Pos            2            /**< \brief (USB_TESTC) fast speed */
#define USB_TESTC_FS                (0x1u << USB_TESTC_FS_Pos)
#define USB_TESTC_ONN_Pos           3            /**< \brief (USB_TESTC) onn */
#define USB_TESTC_ONN               (0x1u << USB_TESTC_ONN_Pos)
#define USB_TESTC_PDONDP_Pos        4            /**< \brief (USB_TESTC) pdondp */
#define USB_TESTC_PDONDP            (0x1u << USB_TESTC_PDONDP_Pos)
#define USB_TESTC_PDONDM_Pos        5            /**< \brief (USB_TESTC) pdondm */
#define USB_TESTC_PDONDM            (0x1u << USB_TESTC_PDONDM_Pos)
#define USB_TESTC_PUON_Pos          6            /**< \brief (USB_TESTC) puon */
#define USB_TESTC_PUON              (0x1u << USB_TESTC_PUON_Pos)
#define USB_TESTC_PUIDLE_Pos        7            /**< \brief (USB_TESTC) puidle */
#define USB_TESTC_PUIDLE            (0x1u << USB_TESTC_PUIDLE_Pos)
#define USB_TESTC_EOPN_Pos          8            /**< \brief (USB_TESTC) eopn */
#define USB_TESTC_EOPN              (0x1u << USB_TESTC_EOPN_Pos)
#define USB_TESTC_OEN_Pos           9            /**< \brief (USB_TESTC) eon */
#define USB_TESTC_OEN               (0x1u << USB_TESTC_OEN_Pos)
#define USB_TESTC_TXD_Pos           10           /**< \brief (USB_TESTC) txd */
#define USB_TESTC_TXD               (0x1u << USB_TESTC_TXD_Pos)
#define USB_TESTC_BYPASS_DPLL_Pos   11           /**< \brief (USB_TESTC) Bypass USB DPLL */
#define USB_TESTC_BYPASS_DPLL       (0x1u << USB_TESTC_BYPASS_DPLL_Pos)
#define USB_TESTC_RXD_Pos           13           /**< \brief (USB_TESTC) rxd */
#define USB_TESTC_RXD               (0x1u << USB_TESTC_RXD_Pos)
#define USB_TESTC_RXDP_Pos          14           /**< \brief (USB_TESTC) rxdp */
#define USB_TESTC_RXDP              (0x1u << USB_TESTC_RXDP_Pos)
#define USB_TESTC_RXDM_Pos          15           /**< \brief (USB_TESTC) rxdm */
#define USB_TESTC_RXDM              (0x1u << USB_TESTC_RXDM_Pos)
#define USB_TESTC_MASK              0xEFFFu      /**< \brief (USB_TESTC) Register Bits Mask */

/* -------- USB_DEVICE_EPCFG : (USB Offset: 0x100) (R/W  8) DEVICE_ENDPOINT End Point Configuration -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  EPTYPE0:3;        /*!< bit:  0.. 2  End Point Type0                    */
    uint8_t  :1;               /*!< bit:      3  Reserved                           */
    uint8_t  EPTYPE1:3;        /*!< bit:  4.. 6  End Point Type1                    */
    uint8_t  NYETDIS:1;        /*!< bit:      7  NYET Token Disable                 */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} USB_DEVICE_EPCFG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USB_DEVICE_EPCFG_OFFSET     0x100        /**< \brief (USB_DEVICE_EPCFG offset) DEVICE_ENDPOINT End Point Configuration */
#define USB_DEVICE_EPCFG_RESETVALUE 0x00         /**< \brief (USB_DEVICE_EPCFG reset_value) DEVICE_ENDPOINT End Point Configuration */

#define USB_DEVICE_EPCFG_EPTYPE0_Pos 0            /**< \brief (USB_DEVICE_EPCFG) End Point Type0 */
#define USB_DEVICE_EPCFG_EPTYPE0_Msk (0x7u << USB_DEVICE_EPCFG_EPTYPE0_Pos)
#define USB_DEVICE_EPCFG_EPTYPE0(value) ((USB_DEVICE_EPCFG_EPTYPE0_Msk & ((value) << USB_DEVICE_EPCFG_EPTYPE0_Pos)))
#define USB_DEVICE_EPCFG_EPTYPE1_Pos 4            /**< \brief (USB_DEVICE_EPCFG) End Point Type1 */
#define USB_DEVICE_EPCFG_EPTYPE1_Msk (0x7u << USB_DEVICE_EPCFG_EPTYPE1_Pos)
#define USB_DEVICE_EPCFG_EPTYPE1(value) ((USB_DEVICE_EPCFG_EPTYPE1_Msk & ((value) << USB_DEVICE_EPCFG_EPTYPE1_Pos)))
#define USB_DEVICE_EPCFG_NYETDIS_Pos 7            /**< \brief (USB_DEVICE_EPCFG) NYET Token Disable */
#define USB_DEVICE_EPCFG_NYETDIS    (0x1u << USB_DEVICE_EPCFG_NYETDIS_Pos)
#define USB_DEVICE_EPCFG_MASK       0xF7u        /**< \brief (USB_DEVICE_EPCFG) Register Bits Mask */

/* -------- USB_HOST_PCFG : (USB Offset: 0x100) (R/W  8) HOST_PIPE End Point Configuration -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  PTOKEN:2;         /*!< bit:  0.. 1  Pipe Token                         */
    uint8_t  BK:1;             /*!< bit:      2  Pipe Bank                          */
    uint8_t  PTYPE:3;          /*!< bit:  3.. 5  Pipe Type                          */
    uint8_t  :2;               /*!< bit:  6.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} USB_HOST_PCFG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USB_HOST_PCFG_OFFSET        0x100        /**< \brief (USB_HOST_PCFG offset) HOST_PIPE End Point Configuration */
#define USB_HOST_PCFG_RESETVALUE    0x00         /**< \brief (USB_HOST_PCFG reset_value) HOST_PIPE End Point Configuration */

#define USB_HOST_PCFG_PTOKEN_Pos    0            /**< \brief (USB_HOST_PCFG) Pipe Token */
#define USB_HOST_PCFG_PTOKEN_Msk    (0x3u << USB_HOST_PCFG_PTOKEN_Pos)
#define USB_HOST_PCFG_PTOKEN(value) ((USB_HOST_PCFG_PTOKEN_Msk & ((value) << USB_HOST_PCFG_PTOKEN_Pos)))
#define USB_HOST_PCFG_BK_Pos        2            /**< \brief (USB_HOST_PCFG) Pipe Bank */
#define USB_HOST_PCFG_BK            (0x1u << USB_HOST_PCFG_BK_Pos)
#define USB_HOST_PCFG_PTYPE_Pos     3            /**< \brief (USB_HOST_PCFG) Pipe Type */
#define USB_HOST_PCFG_PTYPE_Msk     (0x7u << USB_HOST_PCFG_PTYPE_Pos)
#define USB_HOST_PCFG_PTYPE(value)  ((USB_HOST_PCFG_PTYPE_Msk & ((value) << USB_HOST_PCFG_PTYPE_Pos)))
#define USB_HOST_PCFG_MASK          0x3Fu        /**< \brief (USB_HOST_PCFG) Register Bits Mask */

/* -------- USB_HOST_BINTERVAL : (USB Offset: 0x103) (R/W  8) HOST_PIPE Bus Access Period of Pipe -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  BITINTERVAL:8;    /*!< bit:  0.. 7  Bit Interval                       */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} USB_HOST_BINTERVAL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USB_HOST_BINTERVAL_OFFSET   0x103        /**< \brief (USB_HOST_BINTERVAL offset) HOST_PIPE Bus Access Period of Pipe */
#define USB_HOST_BINTERVAL_RESETVALUE 0x00         /**< \brief (USB_HOST_BINTERVAL reset_value) HOST_PIPE Bus Access Period of Pipe */

