zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define REG_ADC_REFCTRL                       (0x43000C02U) /**< \brief (ADC) Reference Control */
#define REG_ADC_EVCTRL                        (0x43000C03U) /**< \brief (ADC) Event Control */
#define REG_ADC_INTENCLR                      (0x43000C04U) /**< \brief (ADC) Interrupt Enable Clear */
#define REG_ADC_INTENSET                      (0x43000C05U) /**< \brief (ADC) Interrupt Enable Set */
#define REG_ADC_INTFLAG                       (0x43000C06U) /**< \brief (ADC) Interrupt Flag Status and Clear */
#define REG_ADC_SEQSTATUS                     (0x43000C07U) /**< \brief (ADC) Sequence Status */
#define REG_ADC_INPUTCTRL                     (0x43000C08U) /**< \brief (ADC) Input Control */
#define REG_ADC_CTRLC                         (0x43000C0AU) /**< \brief (ADC) Control C */
#define REG_ADC_AVGCTRL                       (0x43000C0CU) /**< \brief (ADC) Average Control */
#define REG_ADC_SAMPCTRL                      (0x43000C0DU) /**< \brief (ADC) Sample Time Control */
#define REG_ADC_WINLT                         (0x43000C0EU) /**< \brief (ADC) Window Monitor Lower Threshold */
#define REG_ADC_WINUT                         (0x43000C10U) /**< \brief (ADC) Window Monitor Upper Threshold */
#define REG_ADC_GAINCORR                      (0x43000C12U) /**< \brief (ADC) Gain Correction */
#define REG_ADC_OFFSETCORR                    (0x43000C14U) /**< \brief (ADC) Offset Correction */
#define REG_ADC_SWTRIG                        (0x43000C18U) /**< \brief (ADC) Software Trigger */
#define REG_ADC_DBGCTRL                       (0x43000C1CU) /**< \brief (ADC) Debug Control */
#define REG_ADC_SYNCBUSY                      (0x43000C20U) /**< \brief (ADC) Synchronization Busy */
#define REG_ADC_RESULT                        (0x43000C24U) /**< \brief (ADC) Result */
#define REG_ADC_SEQCTRL                       (0x43000C28U) /**< \brief (ADC) Sequence Control */
#define REG_ADC_CALIB                         (0x43000C2CU) /**< \brief (ADC) Calibration */
#define REG_ADC_TEST                          (0x43000C2EU) /**< \brief (ADC) Test Modes */
#else
#define REG_ADC_CTRLA              (*(RwReg8 *)0x43000C00U) /**< \brief (ADC) Control A */
#define REG_ADC_CTRLB              (*(RwReg8 *)0x43000C01U) /**< \brief (ADC) Control B */
#define REG_ADC_REFCTRL            (*(RwReg8 *)0x43000C02U) /**< \brief (ADC) Reference Control */
#define REG_ADC_EVCTRL             (*(RwReg8 *)0x43000C03U) /**< \brief (ADC) Event Control */
#define REG_ADC_INTENCLR           (*(RwReg8 *)0x43000C04U) /**< \brief (ADC) Interrupt Enable Clear */
#define REG_ADC_INTENSET           (*(RwReg8 *)0x43000C05U) /**< \brief (ADC) Interrupt Enable Set */
#define REG_ADC_INTFLAG            (*(RwReg8 *)0x43000C06U) /**< \brief (ADC) Interrupt Flag Status and Clear */
#define REG_ADC_SEQSTATUS          (*(RoReg8 *)0x43000C07U) /**< \brief (ADC) Sequence Status */
#define REG_ADC_INPUTCTRL          (*(RwReg16*)0x43000C08U) /**< \brief (ADC) Input Control */
#define REG_ADC_CTRLC              (*(RwReg16*)0x43000C0AU) /**< \brief (ADC) Control C */
#define REG_ADC_AVGCTRL            (*(RwReg8 *)0x43000C0CU) /**< \brief (ADC) Average Control */
#define REG_ADC_SAMPCTRL           (*(RwReg8 *)0x43000C0DU) /**< \brief (ADC) Sample Time Control */
#define REG_ADC_WINLT              (*(RwReg16*)0x43000C0EU) /**< \brief (ADC) Window Monitor Lower Threshold */
#define REG_ADC_WINUT              (*(RwReg16*)0x43000C10U) /**< \brief (ADC) Window Monitor Upper Threshold */
#define REG_ADC_GAINCORR           (*(RwReg16*)0x43000C12U) /**< \brief (ADC) Gain Correction */
#define REG_ADC_OFFSETCORR         (*(RwReg16*)0x43000C14U) /**< \brief (ADC) Offset Correction */
#define REG_ADC_SWTRIG             (*(RwReg8 *)0x43000C18U) /**< \brief (ADC) Software Trigger */
#define REG_ADC_DBGCTRL            (*(RwReg8 *)0x43000C1CU) /**< \brief (ADC) Debug Control */
#define REG_ADC_SYNCBUSY           (*(RoReg16*)0x43000C20U) /**< \brief (ADC) Synchronization Busy */
#define REG_ADC_RESULT             (*(RoReg16*)0x43000C24U) /**< \brief (ADC) Result */
#define REG_ADC_SEQCTRL            (*(RwReg  *)0x43000C28U) /**< \brief (ADC) Sequence Control */
#define REG_ADC_CALIB              (*(RwReg16*)0x43000C2CU) /**< \brief (ADC) Calibration */
#define REG_ADC_TEST               (*(RwReg8 *)0x43000C2EU) /**< \brief (ADC) Test Modes */
#endif /* (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
/* ========== Register definition for AC peripheral ========== */
#if defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)
#define REG_AC_CTRLA                          (0x43001000U) /**< \brief (AC) Control A */
#define REG_AC_CTRLB                          (0x43001001U) /**< \brief (AC) Control B */
#define REG_AC_EVCTRL                         (0x43001002U) /**< \brief (AC) Event Control */
#define REG_AC_INTENCLR                       (0x43001004U) /**< \brief (AC) Interrupt Enable Clear */
#define REG_AC_INTENSET                       (0x43001005U) /**< \brief (AC) Interrupt Enable Set */
#define REG_AC_INTFLAG                        (0x43001006U) /**< \brief (AC) Interrupt Flag Status and Clear */
#define REG_AC_STATUSA                        (0x43001007U) /**< \brief (AC) Status A */
#define REG_AC_STATUSB                        (0x43001008U) /**< \brief (AC) Status B */
#define REG_AC_DBGCTRL                        (0x43001009U) /**< \brief (AC) Debug Control */
#define REG_AC_WINCTRL                        (0x4300100AU) /**< \brief (AC) Window Control */
#define REG_AC_SCALER0                        (0x4300100CU) /**< \brief (AC) Scaler 0 */
#define REG_AC_SCALER1                        (0x4300100DU) /**< \brief (AC) Scaler 1 */
#define REG_AC_COMPCTRL0                      (0x43001010U) /**< \brief (AC) Comparator Control 0 */
#define REG_AC_COMPCTRL1                      (0x43001014U) /**< \brief (AC) Comparator Control 1 */
#define REG_AC_SYNCBUSY                       (0x43001020U) /**< \brief (AC) Synchronization Busy */
#define REG_AC_TEST                           (0x43001024U) /**< \brief (AC) Test */
#else
#define REG_AC_CTRLA               (*(RwReg8 *)0x43001000U) /**< \brief (AC) Control A */
#define REG_AC_CTRLB               (*(WoReg8 *)0x43001001U) /**< \brief (AC) Control B */
#define REG_AC_EVCTRL              (*(RwReg16*)0x43001002U) /**< \brief (AC) Event Control */
#define REG_AC_INTENCLR            (*(RwReg8 *)0x43001004U) /**< \brief (AC) Interrupt Enable Clear */
#define REG_AC_INTENSET            (*(RwReg8 *)0x43001005U) /**< \brief (AC) Interrupt Enable Set */
#define REG_AC_INTFLAG             (*(RwReg8 *)0x43001006U) /**< \brief (AC) Interrupt Flag Status and Clear */
#define REG_AC_STATUSA             (*(RoReg8 *)0x43001007U) /**< \brief (AC) Status A */
#define REG_AC_STATUSB             (*(RoReg8 *)0x43001008U) /**< \brief (AC) Status B */
#define REG_AC_DBGCTRL             (*(RwReg8 *)0x43001009U) /**< \brief (AC) Debug Control */
#define REG_AC_WINCTRL             (*(RwReg8 *)0x4300100AU) /**< \brief (AC) Window Control */
#define REG_AC_SCALER0             (*(RwReg8 *)0x4300100CU) /**< \brief (AC) Scaler 0 */
#define REG_AC_SCALER1             (*(RwReg8 *)0x4300100DU) /**< \brief (AC) Scaler 1 */
#define REG_AC_COMPCTRL0           (*(RwReg  *)0x43001010U) /**< \brief (AC) Comparator Control 0 */
#define REG_AC_COMPCTRL1           (*(RwReg  *)0x43001014U) /**< \brief (AC) Comparator Control 1 */
#define REG_AC_SYNCBUSY            (*(RoReg  *)0x43001020U) /**< \brief (AC) Synchronization Busy */
#define REG_AC_TEST                (*(RwReg16*)0x43001024U) /**< \brief (AC) Test */
#endif /* (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
/* ========== Register definition for PTC peripheral ========== */
#if defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)
#define REG_PTC_CTRLA                         (0x43001400U) /**< \brief (PTC) Control A */
#define REG_PTC_STATUS                        (0x43001401U) /**< \brief (PTC) Status */
#define REG_PTC_CTRLB                         (0x43001404U) /**< \brief (PTC) Control B */
#define REG_PTC_EVCTRL                        (0x43001405U) /**< \brief (PTC) Event Control */
#define REG_PTC_INTENCLR                      (0x43001408U) /**< \brief (PTC) Interrupt Enable Clear */
#define REG_PTC_INTENSET                      (0x43001409U) /**< \brief (PTC) Interrupt Enable Set */
#define REG_PTC_INTFLAG                       (0x4300140AU) /**< \brief (PTC) Interrupt Flag Status and Clear */
#define REG_PTC_CTSCTRLA                      (0x4300140CU) /**< \brief (PTC) Capacitive Touch Sensing Control A */
#define REG_PTC_CTSCTRLC                      (0x4300140DU) /**< \brief (PTC) CTS Control C */
#define REG_PTC_YSEL                          (0x43001410U) /**< \brief (PTC) Y-Line Selection */
#define REG_PTC_XSEL                          (0x43001412U) /**< \brief (PTC) X-Line Selection */
#define REG_PTC_YEN                           (0x43001414U) /**< \brief (PTC) Y-Line Enable */
#define REG_PTC_XEN                           (0x43001416U) /**< \brief (PTC) X-Line Enable */
#define REG_PTC_CCCAL                         (0x43001418U) /**< \brief (PTC) CTS Compensation Capacitor Calibration */
#define REG_PTC_CICAL                         (0x4300141AU) /**< \brief (PTC) Integration Capacitor (CI) Calibration */
#define REG_PTC_CTSRS                         (0x4300141BU) /**< \brief (PTC) CTS Resistor Selection */
#define REG_PTC_RESULT                        (0x4300141CU) /**< \brief (PTC) Result */
#define REG_PTC_CTSCTRLB                      (0x43001420U) /**< \brief (PTC) Capacitive Touch Sensing Control B */
#define REG_PTC_WINCCTRL                      (0x43001421U) /**< \brief (PTC) Window Comparator Control */
#define REG_PTC_WCHT                          (0x43001424U) /**< \brief (PTC) Window Comparator High Threshold */
#define REG_PTC_WCLT                          (0x43001426U) /**< \brief (PTC) Window Comparator Low Threshold */
#else
#define REG_PTC_CTRLA              (*(RwReg8 *)0x43001400U) /**< \brief (PTC) Control A */
#define REG_PTC_STATUS             (*(RoReg8 *)0x43001401U) /**< \brief (PTC) Status */
#define REG_PTC_CTRLB              (*(RwReg8 *)0x43001404U) /**< \brief (PTC) Control B */
#define REG_PTC_EVCTRL             (*(RwReg8 *)0x43001405U) /**< \brief (PTC) Event Control */
#define REG_PTC_INTENCLR           (*(RwReg8 *)0x43001408U) /**< \brief (PTC) Interrupt Enable Clear */
#define REG_PTC_INTENSET           (*(RwReg8 *)0x43001409U) /**< \brief (PTC) Interrupt Enable Set */
#define REG_PTC_INTFLAG            (*(RwReg8 *)0x4300140AU) /**< \brief (PTC) Interrupt Flag Status and Clear */
#define REG_PTC_CTSCTRLA           (*(RwReg8 *)0x4300140CU) /**< \brief (PTC) Capacitive Touch Sensing Control A */
#define REG_PTC_CTSCTRLC           (*(RwReg8 *)0x4300140DU) /**< \brief (PTC) CTS Control C */
#define REG_PTC_YSEL               (*(RwReg16*)0x43001410U) /**< \brief (PTC) Y-Line Selection */
#define REG_PTC_XSEL               (*(RwReg16*)0x43001412U) /**< \brief (PTC) X-Line Selection */
#define REG_PTC_YEN                (*(RwReg16*)0x43001414U) /**< \brief (PTC) Y-Line Enable */
#define REG_PTC_XEN                (*(RwReg16*)0x43001416U) /**< \brief (PTC) X-Line Enable */
#define REG_PTC_CCCAL              (*(RwReg16*)0x43001418U) /**< \brief (PTC) CTS Compensation Capacitor Calibration */
#define REG_PTC_CICAL              (*(RwReg8 *)0x4300141AU) /**< \brief (PTC) Integration Capacitor (CI) Calibration */
#define REG_PTC_CTSRS              (*(RwReg8 *)0x4300141BU) /**< \brief (PTC) CTS Resistor Selection */
#define REG_PTC_RESULT             (*(RoReg16*)0x4300141CU) /**< \brief (PTC) Result */
#define REG_PTC_CTSCTRLB           (*(RwReg8 *)0x43001420U) /**< \brief (PTC) Capacitive Touch Sensing Control B */
#define REG_PTC_WINCCTRL           (*(RwReg8 *)0x43001421U) /**< \brief (PTC) Window Comparator Control */
#define REG_PTC_WCHT               (*(RwReg16*)0x43001424U) /**< \brief (PTC) Window Comparator High Threshold */
#define REG_PTC_WCLT               (*(RwReg16*)0x43001426U) /**< \brief (PTC) Window Comparator Low Threshold */
#endif /* (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
/* ========== Register definition for OPAMP peripheral ========== */
#if defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)
#define REG_OPAMP_CTRLA                       (0x43001800U) /**< \brief (OPAMP) Control A */
#define REG_OPAMP_STATUS                      (0x43001802U) /**< \brief (OPAMP) Status */
#define REG_OPAMP_OPAMPCTRL0                  (0x43001804U) /**< \brief (OPAMP) OPAMP Control 0 */
#define REG_OPAMP_OPAMPCTRL1                  (0x43001808U) /**< \brief (OPAMP) OPAMP Control 1 */
#define REG_OPAMP_OPAMPCTRL2                  (0x4300180CU) /**< \brief (OPAMP) OPAMP Control 2 */
#define REG_OPAMP_TEST                        (0x43001810U) /**< \brief (OPAMP) Test Control */
#else
#define REG_OPAMP_CTRLA            (*(RwReg8 *)0x43001800U) /**< \brief (OPAMP) Control A */
#define REG_OPAMP_STATUS           (*(RoReg8 *)0x43001802U) /**< \brief (OPAMP) Status */
#define REG_OPAMP_OPAMPCTRL0       (*(RwReg  *)0x43001804U) /**< \brief (OPAMP) OPAMP Control 0 */
#define REG_OPAMP_OPAMPCTRL1       (*(RwReg  *)0x43001808U) /**< \brief (OPAMP) OPAMP Control 1 */
#define REG_OPAMP_OPAMPCTRL2       (*(RwReg  *)0x4300180CU) /**< \brief (OPAMP) OPAMP Control 2 */
#define REG_OPAMP_TEST             (*(RwReg8 *)0x43001810U) /**< \brief (OPAMP) Test Control */
#endif /* (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
/* ========== Register definition for CCL peripheral ========== */
#if defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)
#define REG_CCL_CTRL                          (0x43001C00U) /**< \brief (CCL) Control */
#define REG_CCL_SEQCTRL0                      (0x43001C04U) /**< \brief (CCL) SEQ Control x 0 */
#define REG_CCL_SEQCTRL1                      (0x43001C05U) /**< \brief (CCL) SEQ Control x 1 */
#define REG_CCL_LUTCTRL0                      (0x43001C08U) /**< \brief (CCL) LUT Control x 0 */
#define REG_CCL_LUTCTRL1                      (0x43001C0CU) /**< \brief (CCL) LUT Control x 1 */
#define REG_CCL_LUTCTRL2                      (0x43001C10U) /**< \brief (CCL) LUT Control x 2 */
#define REG_CCL_LUTCTRL3                      (0x43001C14U) /**< \brief (CCL) LUT Control x 3 */
#else
#define REG_CCL_CTRL               (*(RwReg8 *)0x43001C00U) /**< \brief (CCL) Control */
#define REG_CCL_SEQCTRL0           (*(RwReg8 *)0x43001C04U) /**< \brief (CCL) SEQ Control x 0 */
#define REG_CCL_SEQCTRL1           (*(RwReg8 *)0x43001C05U) /**< \brief (CCL) SEQ Control x 1 */
#define REG_CCL_LUTCTRL0           (*(RwReg  *)0x43001C08U) /**< \brief (CCL) LUT Control x 0 */
#define REG_CCL_LUTCTRL1           (*(RwReg  *)0x43001C0CU) /**< \brief (CCL) LUT Control x 1 */
#define REG_CCL_LUTCTRL2           (*(RwReg  *)0x43001C10U) /**< \brief (CCL) LUT Control x 2 */
#define REG_CCL_LUTCTRL3           (*(RwReg  *)0x43001C14U) /**< \brief (CCL) LUT Control x 3 */
#endif /* (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
/* ========== Register definition for PAC peripheral ========== */
#if defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)
#define REG_PAC_WRCTRL                        (0x44000000U) /**< \brief (PAC) Write control */
#define REG_PAC_EVCTRL                        (0x44000004U) /**< \brief (PAC) Event control */
#define REG_PAC_INTENCLR                      (0x44000008U) /**< \brief (PAC) Interrupt enable clear */
#define REG_PAC_INTENSET                      (0x44000009U) /**< \brief (PAC) Interrupt enable set */
#define REG_PAC_INTFLAGAHB                    (0x44000010U) /**< \brief (PAC) Bridge interrupt flag status */
#define REG_PAC_INTFLAGA                      (0x44000014U) /**< \brief (PAC) Peripheral interrupt flag status - Bridge A */
#define REG_PAC_INTFLAGB                      (0x44000018U) /**< \brief (PAC) Peripheral interrupt flag status - Bridge B */
#define REG_PAC_INTFLAGC                      (0x4400001CU) /**< \brief (PAC) Peripheral interrupt flag status - Bridge C */
#define REG_PAC_INTFLAGD                      (0x44000020U) /**< \brief (PAC) Peripheral interrupt flag status - Bridge D */
#define REG_PAC_INTFLAGE                      (0x44000024U) /**< \brief (PAC) Peripheral interrupt flag status - Bridge E */
#define REG_PAC_STATUSA                       (0x44000034U) /**< \brief (PAC) Peripheral write protection status - Bridge A */
#define REG_PAC_STATUSB                       (0x44000038U) /**< \brief (PAC) Peripheral write protection status - Bridge B */
#define REG_PAC_STATUSC                       (0x4400003CU) /**< \brief (PAC) Peripheral write protection status - Bridge C */
#define REG_PAC_STATUSD                       (0x44000040U) /**< \brief (PAC) Peripheral write protection status - Bridge D */
#define REG_PAC_STATUSE                       (0x44000044U) /**< \brief (PAC) Peripheral write protection status - Bridge E */
#else
#define REG_PAC_WRCTRL             (*(RwReg  *)0x44000000U) /**< \brief (PAC) Write control */
#define REG_PAC_EVCTRL             (*(RwReg8 *)0x44000004U) /**< \brief (PAC) Event control */
#define REG_PAC_INTENCLR           (*(RwReg8 *)0x44000008U) /**< \brief (PAC) Interrupt enable clear */
#define REG_PAC_INTENSET           (*(RwReg8 *)0x44000009U) /**< \brief (PAC) Interrupt enable set */
#define REG_PAC_INTFLAGAHB         (*(RwReg  *)0x44000010U) /**< \brief (PAC) Bridge interrupt flag status */
#define REG_PAC_INTFLAGA           (*(RwReg  *)0x44000014U) /**< \brief (PAC) Peripheral interrupt flag status - Bridge A */
#define REG_PAC_INTFLAGB           (*(RwReg  *)0x44000018U) /**< \brief (PAC) Peripheral interrupt flag status - Bridge B */
#define REG_PAC_INTFLAGC           (*(RwReg  *)0x4400001CU) /**< \brief (PAC) Peripheral interrupt flag status - Bridge C */
#define REG_PAC_INTFLAGD           (*(RwReg  *)0x44000020U) /**< \brief (PAC) Peripheral interrupt flag status - Bridge D */
#define REG_PAC_INTFLAGE           (*(RwReg  *)0x44000024U) /**< \brief (PAC) Peripheral interrupt flag status - Bridge E */
#define REG_PAC_STATUSA            (*(RoReg  *)0x44000034U) /**< \brief (PAC) Peripheral write protection status - Bridge A */
#define REG_PAC_STATUSB            (*(RoReg  *)0x44000038U) /**< \brief (PAC) Peripheral write protection status - Bridge B */
#define REG_PAC_STATUSC            (*(RoReg  *)0x4400003CU) /**< \brief (PAC) Peripheral write protection status - Bridge C */
#define REG_PAC_STATUSD            (*(RoReg  *)0x44000040U) /**< \brief (PAC) Peripheral write protection status - Bridge D */
#define REG_PAC_STATUSE            (*(RoReg  *)0x44000044U) /**< \brief (PAC) Peripheral write protection status - Bridge E */
#endif /* (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
/* ========== Register definition for DMAC peripheral ========== */
#if defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)
#define REG_DMAC_CTRL                         (0x44000400U) /**< \brief (DMAC) Control */
#define REG_DMAC_CRCCTRL                      (0x44000402U) /**< \brief (DMAC) CRC Control */
#define REG_DMAC_CRCDATAIN                    (0x44000404U) /**< \brief (DMAC) CRC Data Input */
#define REG_DMAC_CRCCHKSUM                    (0x44000408U) /**< \brief (DMAC) CRC Checksum */
#define REG_DMAC_CRCSTATUS                    (0x4400040CU) /**< \brief (DMAC) CRC Status */
#define REG_DMAC_DBGCTRL                      (0x4400040DU) /**< \brief (DMAC) Debug Control */
#define REG_DMAC_QOSCTRL                      (0x4400040EU) /**< \brief (DMAC) QOS Control */
#define REG_DMAC_SWTRIGCTRL                   (0x44000410U) /**< \brief (DMAC) Software Trigger Control */
#define REG_DMAC_PRICTRL0                     (0x44000414U) /**< \brief (DMAC) Priority Control 0 */
#define REG_DMAC_INTPEND                      (0x44000420U) /**< \brief (DMAC) Interrupt Pending */
#define REG_DMAC_INTSTATUS                    (0x44000424U) /**< \brief (DMAC) Interrupt Status */
#define REG_DMAC_BUSYCH                       (0x44000428U) /**< \brief (DMAC) Busy Channels */
#define REG_DMAC_PENDCH                       (0x4400042CU) /**< \brief (DMAC) Pending Channels */
#define REG_DMAC_ACTIVE                       (0x44000430U) /**< \brief (DMAC) Active Channel and Levels */
#define REG_DMAC_BASEADDR                     (0x44000434U) /**< \brief (DMAC) Descriptor Memory Section Base Address */
#define REG_DMAC_WRBADDR                      (0x44000438U) /**< \brief (DMAC) Write-Back Memory Section Base Address */
#define REG_DMAC_CHID                         (0x4400043FU) /**< \brief (DMAC) Channel ID */
#define REG_DMAC_CHCTRLA                      (0x44000440U) /**< \brief (DMAC) Channel Control A */
#define REG_DMAC_CHCTRLB                      (0x44000444U) /**< \brief (DMAC) Channel Control B */
#define REG_DMAC_CHINTENCLR                   (0x4400044CU) /**< \brief (DMAC) Channel Interrupt Enable Clear */
#define REG_DMAC_CHINTENSET                   (0x4400044DU) /**< \brief (DMAC) Channel Interrupt Enable Set */
#define REG_DMAC_CHINTFLAG                    (0x4400044EU) /**< \brief (DMAC) Channel Interrupt Flag Status and Clear */
#define REG_DMAC_CHSTATUS                     (0x4400044FU) /**< \brief (DMAC) Channel Status */
#else
#define REG_DMAC_CTRL              (*(RwReg16*)0x44000400U) /**< \brief (DMAC) Control */
#define REG_DMAC_CRCCTRL           (*(RwReg16*)0x44000402U) /**< \brief (DMAC) CRC Control */
#define REG_DMAC_CRCDATAIN         (*(RwReg  *)0x44000404U) /**< \brief (DMAC) CRC Data Input */
#define REG_DMAC_CRCCHKSUM         (*(RwReg  *)0x44000408U) /**< \brief (DMAC) CRC Checksum */
#define REG_DMAC_CRCSTATUS         (*(RwReg8 *)0x4400040CU) /**< \brief (DMAC) CRC Status */
#define REG_DMAC_DBGCTRL           (*(RwReg8 *)0x4400040DU) /**< \brief (DMAC) Debug Control */
#define REG_DMAC_QOSCTRL           (*(RwReg8 *)0x4400040EU) /**< \brief (DMAC) QOS Control */
#define REG_DMAC_SWTRIGCTRL        (*(RwReg  *)0x44000410U) /**< \brief (DMAC) Software Trigger Control */
#define REG_DMAC_PRICTRL0          (*(RwReg  *)0x44000414U) /**< \brief (DMAC) Priority Control 0 */
#define REG_DMAC_INTPEND           (*(RwReg16*)0x44000420U) /**< \brief (DMAC) Interrupt Pending */
#define REG_DMAC_INTSTATUS         (*(RoReg  *)0x44000424U) /**< \brief (DMAC) Interrupt Status */
#define REG_DMAC_BUSYCH            (*(RoReg  *)0x44000428U) /**< \brief (DMAC) Busy Channels */
#define REG_DMAC_PENDCH            (*(RoReg  *)0x4400042CU) /**< \brief (DMAC) Pending Channels */
#define REG_DMAC_ACTIVE            (*(RoReg  *)0x44000430U) /**< \brief (DMAC) Active Channel and Levels */
#define REG_DMAC_BASEADDR          (*(RwReg  *)0x44000434U) /**< \brief (DMAC) Descriptor Memory Section Base Address */
#define REG_DMAC_WRBADDR           (*(RwReg  *)0x44000438U) /**< \brief (DMAC) Write-Back Memory Section Base Address */
#define REG_DMAC_CHID              (*(RwReg8 *)0x4400043FU) /**< \brief (DMAC) Channel ID */
#define REG_DMAC_CHCTRLA           (*(RwReg8 *)0x44000440U) /**< \brief (DMAC) Channel Control A */
#define REG_DMAC_CHCTRLB           (*(RwReg  *)0x44000444U) /**< \brief (DMAC) Channel Control B */
#define REG_DMAC_CHINTENCLR        (*(RwReg8 *)0x4400044CU) /**< \brief (DMAC) Channel Interrupt Enable Clear */
#define REG_DMAC_CHINTENSET        (*(RwReg8 *)0x4400044DU) /**< \brief (DMAC) Channel Interrupt Enable Set */
#define REG_DMAC_CHINTFLAG         (*(RwReg8 *)0x4400044EU) /**< \brief (DMAC) Channel Interrupt Flag Status and Clear */
#define REG_DMAC_CHSTATUS          (*(RoReg8 *)0x4400044FU) /**< \brief (DMAC) Channel Status */
#endif /* (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
/* ========== Register definition for HMATRIXLP peripheral ========== */
#if defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)
#define REG_HMATRIXLP_MCFG0                   (0x44000800U) /**< \brief (HMATRIXLP) Master Configuration 0 */
