zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define REG_HMATRIXLP_MCFG1                   (0x44000804U) /**< \brief (HMATRIXLP) Master Configuration 1 */
#define REG_HMATRIXLP_MCFG2                   (0x44000808U) /**< \brief (HMATRIXLP) Master Configuration 2 */
#define REG_HMATRIXLP_MCFG3                   (0x4400080CU) /**< \brief (HMATRIXLP) Master Configuration 3 */
#define REG_HMATRIXLP_MCFG4                   (0x44000810U) /**< \brief (HMATRIXLP) Master Configuration 4 */
#define REG_HMATRIXLP_MCFG5                   (0x44000814U) /**< \brief (HMATRIXLP) Master Configuration 5 */
#define REG_HMATRIXLP_MCFG6                   (0x44000818U) /**< \brief (HMATRIXLP) Master Configuration 6 */
#define REG_HMATRIXLP_MCFG7                   (0x4400081CU) /**< \brief (HMATRIXLP) Master Configuration 7 */
#define REG_HMATRIXLP_MCFG8                   (0x44000820U) /**< \brief (HMATRIXLP) Master Configuration 8 */
#define REG_HMATRIXLP_MCFG9                   (0x44000824U) /**< \brief (HMATRIXLP) Master Configuration 9 */
#define REG_HMATRIXLP_MCFG10                  (0x44000828U) /**< \brief (HMATRIXLP) Master Configuration 10 */
#define REG_HMATRIXLP_MCFG11                  (0x4400082CU) /**< \brief (HMATRIXLP) Master Configuration 11 */
#define REG_HMATRIXLP_MCFG12                  (0x44000830U) /**< \brief (HMATRIXLP) Master Configuration 12 */
#define REG_HMATRIXLP_MCFG13                  (0x44000834U) /**< \brief (HMATRIXLP) Master Configuration 13 */
#define REG_HMATRIXLP_MCFG14                  (0x44000838U) /**< \brief (HMATRIXLP) Master Configuration 14 */
#define REG_HMATRIXLP_MCFG15                  (0x4400083CU) /**< \brief (HMATRIXLP) Master Configuration 15 */
#define REG_HMATRIXLP_SCFG0                   (0x44000840U) /**< \brief (HMATRIXLP) Slave Configuration 0 */
#define REG_HMATRIXLP_SCFG1                   (0x44000844U) /**< \brief (HMATRIXLP) Slave Configuration 1 */
#define REG_HMATRIXLP_SCFG2                   (0x44000848U) /**< \brief (HMATRIXLP) Slave Configuration 2 */
#define REG_HMATRIXLP_SCFG3                   (0x4400084CU) /**< \brief (HMATRIXLP) Slave Configuration 3 */
#define REG_HMATRIXLP_SCFG4                   (0x44000850U) /**< \brief (HMATRIXLP) Slave Configuration 4 */
#define REG_HMATRIXLP_SCFG5                   (0x44000854U) /**< \brief (HMATRIXLP) Slave Configuration 5 */
#define REG_HMATRIXLP_SCFG6                   (0x44000858U) /**< \brief (HMATRIXLP) Slave Configuration 6 */
#define REG_HMATRIXLP_SCFG7                   (0x4400085CU) /**< \brief (HMATRIXLP) Slave Configuration 7 */
#define REG_HMATRIXLP_SCFG8                   (0x44000860U) /**< \brief (HMATRIXLP) Slave Configuration 8 */
#define REG_HMATRIXLP_SCFG9                   (0x44000864U) /**< \brief (HMATRIXLP) Slave Configuration 9 */
#define REG_HMATRIXLP_SCFG10                  (0x44000868U) /**< \brief (HMATRIXLP) Slave Configuration 10 */
#define REG_HMATRIXLP_SCFG11                  (0x4400086CU) /**< \brief (HMATRIXLP) Slave Configuration 11 */
#define REG_HMATRIXLP_SCFG12                  (0x44000870U) /**< \brief (HMATRIXLP) Slave Configuration 12 */
#define REG_HMATRIXLP_SCFG13                  (0x44000874U) /**< \brief (HMATRIXLP) Slave Configuration 13 */
#define REG_HMATRIXLP_SCFG14                  (0x44000878U) /**< \brief (HMATRIXLP) Slave Configuration 14 */
#define REG_HMATRIXLP_SCFG15                  (0x4400087CU) /**< \brief (HMATRIXLP) Slave Configuration 15 */
#define REG_HMATRIXLP_PRAS0                   (0x44000880U) /**< \brief (HMATRIXLP) Priority A for Slave 0 */
#define REG_HMATRIXLP_PRBS0                   (0x44000884U) /**< \brief (HMATRIXLP) Priority B for Slave 0 */
#define REG_HMATRIXLP_PRAS1                   (0x44000888U) /**< \brief (HMATRIXLP) Priority A for Slave 1 */
#define REG_HMATRIXLP_PRBS1                   (0x4400088CU) /**< \brief (HMATRIXLP) Priority B for Slave 1 */
#define REG_HMATRIXLP_PRAS2                   (0x44000890U) /**< \brief (HMATRIXLP) Priority A for Slave 2 */
#define REG_HMATRIXLP_PRBS2                   (0x44000894U) /**< \brief (HMATRIXLP) Priority B for Slave 2 */
#define REG_HMATRIXLP_PRAS3                   (0x44000898U) /**< \brief (HMATRIXLP) Priority A for Slave 3 */
#define REG_HMATRIXLP_PRBS3                   (0x4400089CU) /**< \brief (HMATRIXLP) Priority B for Slave 3 */
#define REG_HMATRIXLP_PRAS4                   (0x440008A0U) /**< \brief (HMATRIXLP) Priority A for Slave 4 */
#define REG_HMATRIXLP_PRBS4                   (0x440008A4U) /**< \brief (HMATRIXLP) Priority B for Slave 4 */
#define REG_HMATRIXLP_PRAS5                   (0x440008A8U) /**< \brief (HMATRIXLP) Priority A for Slave 5 */
#define REG_HMATRIXLP_PRBS5                   (0x440008ACU) /**< \brief (HMATRIXLP) Priority B for Slave 5 */
#define REG_HMATRIXLP_PRAS6                   (0x440008B0U) /**< \brief (HMATRIXLP) Priority A for Slave 6 */
#define REG_HMATRIXLP_PRBS6                   (0x440008B4U) /**< \brief (HMATRIXLP) Priority B for Slave 6 */
#define REG_HMATRIXLP_MRCR                    (0x44000900U) /**< \brief (HMATRIXLP) Master Remap Control */
#define REG_HMATRIXLP_SFR0                    (0x44000910U) /**< \brief (HMATRIXLP) Special Function 0 */
#define REG_HMATRIXLP_SFR1                    (0x44000914U) /**< \brief (HMATRIXLP) Special Function 1 */
#define REG_HMATRIXLP_SFR2                    (0x44000918U) /**< \brief (HMATRIXLP) Special Function 2 */
#define REG_HMATRIXLP_SFR3                    (0x4400091CU) /**< \brief (HMATRIXLP) Special Function 3 */
#define REG_HMATRIXLP_SFR4                    (0x44000920U) /**< \brief (HMATRIXLP) Special Function 4 */
#define REG_HMATRIXLP_SFR5                    (0x44000924U) /**< \brief (HMATRIXLP) Special Function 5 */
#define REG_HMATRIXLP_SFR6                    (0x44000928U) /**< \brief (HMATRIXLP) Special Function 6 */
#define REG_HMATRIXLP_SFR7                    (0x4400092CU) /**< \brief (HMATRIXLP) Special Function 7 */
#define REG_HMATRIXLP_SFR8                    (0x44000930U) /**< \brief (HMATRIXLP) Special Function 8 */
#define REG_HMATRIXLP_SFR9                    (0x44000934U) /**< \brief (HMATRIXLP) Special Function 9 */
#define REG_HMATRIXLP_SFR10                   (0x44000938U) /**< \brief (HMATRIXLP) Special Function 10 */
#define REG_HMATRIXLP_SFR11                   (0x4400093CU) /**< \brief (HMATRIXLP) Special Function 11 */
#define REG_HMATRIXLP_SFR12                   (0x44000940U) /**< \brief (HMATRIXLP) Special Function 12 */
#define REG_HMATRIXLP_SFR13                   (0x44000944U) /**< \brief (HMATRIXLP) Special Function 13 */
#define REG_HMATRIXLP_SFR14                   (0x44000948U) /**< \brief (HMATRIXLP) Special Function 14 */
#define REG_HMATRIXLP_SFR15                   (0x4400094CU) /**< \brief (HMATRIXLP) Special Function 15 */
#else
#define REG_HMATRIXLP_MCFG0        (*(RwReg  *)0x44000800U) /**< \brief (HMATRIXLP) Master Configuration 0 */
#define REG_HMATRIXLP_MCFG1        (*(RwReg  *)0x44000804U) /**< \brief (HMATRIXLP) Master Configuration 1 */
#define REG_HMATRIXLP_MCFG2        (*(RwReg  *)0x44000808U) /**< \brief (HMATRIXLP) Master Configuration 2 */
#define REG_HMATRIXLP_MCFG3        (*(RwReg  *)0x4400080CU) /**< \brief (HMATRIXLP) Master Configuration 3 */
#define REG_HMATRIXLP_MCFG4        (*(RwReg  *)0x44000810U) /**< \brief (HMATRIXLP) Master Configuration 4 */
#define REG_HMATRIXLP_MCFG5        (*(RwReg  *)0x44000814U) /**< \brief (HMATRIXLP) Master Configuration 5 */
#define REG_HMATRIXLP_MCFG6        (*(RwReg  *)0x44000818U) /**< \brief (HMATRIXLP) Master Configuration 6 */
#define REG_HMATRIXLP_MCFG7        (*(RwReg  *)0x4400081CU) /**< \brief (HMATRIXLP) Master Configuration 7 */
#define REG_HMATRIXLP_MCFG8        (*(RwReg  *)0x44000820U) /**< \brief (HMATRIXLP) Master Configuration 8 */
#define REG_HMATRIXLP_MCFG9        (*(RwReg  *)0x44000824U) /**< \brief (HMATRIXLP) Master Configuration 9 */
#define REG_HMATRIXLP_MCFG10       (*(RwReg  *)0x44000828U) /**< \brief (HMATRIXLP) Master Configuration 10 */
#define REG_HMATRIXLP_MCFG11       (*(RwReg  *)0x4400082CU) /**< \brief (HMATRIXLP) Master Configuration 11 */
#define REG_HMATRIXLP_MCFG12       (*(RwReg  *)0x44000830U) /**< \brief (HMATRIXLP) Master Configuration 12 */
#define REG_HMATRIXLP_MCFG13       (*(RwReg  *)0x44000834U) /**< \brief (HMATRIXLP) Master Configuration 13 */
#define REG_HMATRIXLP_MCFG14       (*(RwReg  *)0x44000838U) /**< \brief (HMATRIXLP) Master Configuration 14 */
#define REG_HMATRIXLP_MCFG15       (*(RwReg  *)0x4400083CU) /**< \brief (HMATRIXLP) Master Configuration 15 */
#define REG_HMATRIXLP_SCFG0        (*(RwReg  *)0x44000840U) /**< \brief (HMATRIXLP) Slave Configuration 0 */
#define REG_HMATRIXLP_SCFG1        (*(RwReg  *)0x44000844U) /**< \brief (HMATRIXLP) Slave Configuration 1 */
#define REG_HMATRIXLP_SCFG2        (*(RwReg  *)0x44000848U) /**< \brief (HMATRIXLP) Slave Configuration 2 */
#define REG_HMATRIXLP_SCFG3        (*(RwReg  *)0x4400084CU) /**< \brief (HMATRIXLP) Slave Configuration 3 */
#define REG_HMATRIXLP_SCFG4        (*(RwReg  *)0x44000850U) /**< \brief (HMATRIXLP) Slave Configuration 4 */
#define REG_HMATRIXLP_SCFG5        (*(RwReg  *)0x44000854U) /**< \brief (HMATRIXLP) Slave Configuration 5 */
#define REG_HMATRIXLP_SCFG6        (*(RwReg  *)0x44000858U) /**< \brief (HMATRIXLP) Slave Configuration 6 */
#define REG_HMATRIXLP_SCFG7        (*(RwReg  *)0x4400085CU) /**< \brief (HMATRIXLP) Slave Configuration 7 */
#define REG_HMATRIXLP_SCFG8        (*(RwReg  *)0x44000860U) /**< \brief (HMATRIXLP) Slave Configuration 8 */
#define REG_HMATRIXLP_SCFG9        (*(RwReg  *)0x44000864U) /**< \brief (HMATRIXLP) Slave Configuration 9 */
#define REG_HMATRIXLP_SCFG10       (*(RwReg  *)0x44000868U) /**< \brief (HMATRIXLP) Slave Configuration 10 */
#define REG_HMATRIXLP_SCFG11       (*(RwReg  *)0x4400086CU) /**< \brief (HMATRIXLP) Slave Configuration 11 */
#define REG_HMATRIXLP_SCFG12       (*(RwReg  *)0x44000870U) /**< \brief (HMATRIXLP) Slave Configuration 12 */
#define REG_HMATRIXLP_SCFG13       (*(RwReg  *)0x44000874U) /**< \brief (HMATRIXLP) Slave Configuration 13 */
#define REG_HMATRIXLP_SCFG14       (*(RwReg  *)0x44000878U) /**< \brief (HMATRIXLP) Slave Configuration 14 */
#define REG_HMATRIXLP_SCFG15       (*(RwReg  *)0x4400087CU) /**< \brief (HMATRIXLP) Slave Configuration 15 */
#define REG_HMATRIXLP_PRAS0        (*(RwReg  *)0x44000880U) /**< \brief (HMATRIXLP) Priority A for Slave 0 */
#define REG_HMATRIXLP_PRBS0        (*(RwReg  *)0x44000884U) /**< \brief (HMATRIXLP) Priority B for Slave 0 */
#define REG_HMATRIXLP_PRAS1        (*(RwReg  *)0x44000888U) /**< \brief (HMATRIXLP) Priority A for Slave 1 */
#define REG_HMATRIXLP_PRBS1        (*(RwReg  *)0x4400088CU) /**< \brief (HMATRIXLP) Priority B for Slave 1 */
#define REG_HMATRIXLP_PRAS2        (*(RwReg  *)0x44000890U) /**< \brief (HMATRIXLP) Priority A for Slave 2 */
#define REG_HMATRIXLP_PRBS2        (*(RwReg  *)0x44000894U) /**< \brief (HMATRIXLP) Priority B for Slave 2 */
#define REG_HMATRIXLP_PRAS3        (*(RwReg  *)0x44000898U) /**< \brief (HMATRIXLP) Priority A for Slave 3 */
#define REG_HMATRIXLP_PRBS3        (*(RwReg  *)0x4400089CU) /**< \brief (HMATRIXLP) Priority B for Slave 3 */
#define REG_HMATRIXLP_PRAS4        (*(RwReg  *)0x440008A0U) /**< \brief (HMATRIXLP) Priority A for Slave 4 */
#define REG_HMATRIXLP_PRBS4        (*(RwReg  *)0x440008A4U) /**< \brief (HMATRIXLP) Priority B for Slave 4 */
#define REG_HMATRIXLP_PRAS5        (*(RwReg  *)0x440008A8U) /**< \brief (HMATRIXLP) Priority A for Slave 5 */
#define REG_HMATRIXLP_PRBS5        (*(RwReg  *)0x440008ACU) /**< \brief (HMATRIXLP) Priority B for Slave 5 */
#define REG_HMATRIXLP_PRAS6        (*(RwReg  *)0x440008B0U) /**< \brief (HMATRIXLP) Priority A for Slave 6 */
#define REG_HMATRIXLP_PRBS6        (*(RwReg  *)0x440008B4U) /**< \brief (HMATRIXLP) Priority B for Slave 6 */
#define REG_HMATRIXLP_MRCR         (*(RwReg  *)0x44000900U) /**< \brief (HMATRIXLP) Master Remap Control */
#define REG_HMATRIXLP_SFR0         (*(RwReg  *)0x44000910U) /**< \brief (HMATRIXLP) Special Function 0 */
#define REG_HMATRIXLP_SFR1         (*(RwReg  *)0x44000914U) /**< \brief (HMATRIXLP) Special Function 1 */
#define REG_HMATRIXLP_SFR2         (*(RwReg  *)0x44000918U) /**< \brief (HMATRIXLP) Special Function 2 */
#define REG_HMATRIXLP_SFR3         (*(RwReg  *)0x4400091CU) /**< \brief (HMATRIXLP) Special Function 3 */
#define REG_HMATRIXLP_SFR4         (*(RwReg  *)0x44000920U) /**< \brief (HMATRIXLP) Special Function 4 */
#define REG_HMATRIXLP_SFR5         (*(RwReg  *)0x44000924U) /**< \brief (HMATRIXLP) Special Function 5 */
#define REG_HMATRIXLP_SFR6         (*(RwReg  *)0x44000928U) /**< \brief (HMATRIXLP) Special Function 6 */
#define REG_HMATRIXLP_SFR7         (*(RwReg  *)0x4400092CU) /**< \brief (HMATRIXLP) Special Function 7 */
#define REG_HMATRIXLP_SFR8         (*(RwReg  *)0x44000930U) /**< \brief (HMATRIXLP) Special Function 8 */
#define REG_HMATRIXLP_SFR9         (*(RwReg  *)0x44000934U) /**< \brief (HMATRIXLP) Special Function 9 */
#define REG_HMATRIXLP_SFR10        (*(RwReg  *)0x44000938U) /**< \brief (HMATRIXLP) Special Function 10 */
#define REG_HMATRIXLP_SFR11        (*(RwReg  *)0x4400093CU) /**< \brief (HMATRIXLP) Special Function 11 */
#define REG_HMATRIXLP_SFR12        (*(RwReg  *)0x44000940U) /**< \brief (HMATRIXLP) Special Function 12 */
#define REG_HMATRIXLP_SFR13        (*(RwReg  *)0x44000944U) /**< \brief (HMATRIXLP) Special Function 13 */
#define REG_HMATRIXLP_SFR14        (*(RwReg  *)0x44000948U) /**< \brief (HMATRIXLP) Special Function 14 */
#define REG_HMATRIXLP_SFR15        (*(RwReg  *)0x4400094CU) /**< \brief (HMATRIXLP) Special Function 15 */
#endif /* (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
/* ========== Register definition for PICOP peripheral ========== */
#if defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)
#define REG_PICOP_ID0                         (0x44000C00U) /**< \brief (PICOP) ID 0 */
#define REG_PICOP_ID1                         (0x44000C04U) /**< \brief (PICOP) ID 1 */
#define REG_PICOP_ID2                         (0x44000C08U) /**< \brief (PICOP) ID 2 */
#define REG_PICOP_ID3                         (0x44000C0CU) /**< \brief (PICOP) ID 3 */
#define REG_PICOP_ID4                         (0x44000C10U) /**< \brief (PICOP) ID 4 */
#define REG_PICOP_ID5                         (0x44000C14U) /**< \brief (PICOP) ID 5 */
#define REG_PICOP_ID6                         (0x44000C18U) /**< \brief (PICOP) ID 6 */
#define REG_PICOP_ID7                         (0x44000C1CU) /**< \brief (PICOP) ID 7 */
#define REG_PICOP_CONFIG                      (0x44000C20U) /**< \brief (PICOP) Configuration */
#define REG_PICOP_CTRL                        (0x44000C24U) /**< \brief (PICOP) Control */
#define REG_PICOP_CMD                         (0x44000C28U) /**< \brief (PICOP) Command */
#define REG_PICOP_PC                          (0x44000C2CU) /**< \brief (PICOP) Program Counter */
#define REG_PICOP_HF                          (0x44000C30U) /**< \brief (PICOP) Host Flags */
#define REG_PICOP_HFCTRL                      (0x44000C34U) /**< \brief (PICOP) Host Flag Control */
#define REG_PICOP_HFSETCLR0                   (0x44000C38U) /**< \brief (PICOP) Host Flags Set/Clr */
#define REG_PICOP_HFSETCLR1                   (0x44000C3CU) /**< \brief (PICOP) Host Flags Set/Clr */
#define REG_PICOP_OCDCONFIG                   (0x44000C50U) /**< \brief (PICOP) OCD Configuration */
#define REG_PICOP_OCDCONTROL                  (0x44000C54U) /**< \brief (PICOP) OCD Control */
#define REG_PICOP_OCDSTATUS                   (0x44000C58U) /**< \brief (PICOP) OCD Status and Command */
#define REG_PICOP_OCDPC                       (0x44000C5CU) /**< \brief (PICOP) ODC Program Counter */
#define REG_PICOP_OCDFEAT                     (0x44000C60U) /**< \brief (PICOP) OCD Features */
#define REG_PICOP_OCDCCNT                     (0x44000C68U) /**< \brief (PICOP) OCD Cycle Counter */
#define REG_PICOP_OCDBPGEN0                   (0x44000C70U) /**< \brief (PICOP) OCD Breakpoint Generator 0 */
#define REG_PICOP_OCDBPGEN1                   (0x44000C74U) /**< \brief (PICOP) OCD Breakpoint Generator 1 */
#define REG_PICOP_OCDBPGEN2                   (0x44000C78U) /**< \brief (PICOP) OCD Breakpoint Generator 2 */
#define REG_PICOP_OCDBPGEN3                   (0x44000C7CU) /**< \brief (PICOP) OCD Breakpoint Generator 3 */
#define REG_PICOP_R3R0                        (0x44000C80U) /**< \brief (PICOP) R3 to 0 */
#define REG_PICOP_R7R4                        (0x44000C84U) /**< \brief (PICOP) R7 to 4 */
#define REG_PICOP_R11R8                       (0x44000C88U) /**< \brief (PICOP) R11 to 8 */
#define REG_PICOP_R15R12                      (0x44000C8CU) /**< \brief (PICOP) R15 to 12 */
#define REG_PICOP_R19R16                      (0x44000C90U) /**< \brief (PICOP) R19 to 16 */
#define REG_PICOP_R23R20                      (0x44000C94U) /**< \brief (PICOP) R23 to 20 */
#define REG_PICOP_R27R24                      (0x44000C98U) /**< \brief (PICOP) R27 to 24: XH, XL, R25, R24 */
#define REG_PICOP_R31R28                      (0x44000C9CU) /**< \brief (PICOP) R31 to 28: ZH, ZL, YH, YL */
#define REG_PICOP_S1S0                        (0x44000CA0U) /**< \brief (PICOP) System Regs 1 to 0: SR */
#define REG_PICOP_S3S2                        (0x44000CA4U) /**< \brief (PICOP) System Regs 3 to 2: CTRL */
#define REG_PICOP_S5S4                        (0x44000CA8U) /**< \brief (PICOP) System Regs 5 to 4: SREG, CCR */
#define REG_PICOP_S11S10                      (0x44000CB4U) /**< \brief (PICOP) System Regs 11 to 10: Immediate */
#define REG_PICOP_LINK                        (0x44000CB8U) /**< \brief (PICOP) Link */
#define REG_PICOP_SP                          (0x44000CBCU) /**< \brief (PICOP) Stack Pointer */
#define REG_PICOP_MMUFLASH                    (0x44000D00U) /**< \brief (PICOP) MMU mapping for flash */
#define REG_PICOP_MMU0                        (0x44000D18U) /**< \brief (PICOP) MMU mapping user 0 */
#define REG_PICOP_MMU1                        (0x44000D1CU) /**< \brief (PICOP) MMU mapping user 1 */
#define REG_PICOP_MMUCTRL                     (0x44000D20U) /**< \brief (PICOP) MMU Control */
#define REG_PICOP_ICACHE                      (0x44000D80U) /**< \brief (PICOP) Instruction Cache Control */
#define REG_PICOP_ICACHELRU                   (0x44000D84U) /**< \brief (PICOP) Instruction Cache LRU */
#define REG_PICOP_QOSCTRL                     (0x44000E00U) /**< \brief (PICOP) QOS Control */
#else
#define REG_PICOP_ID0              (*(RwReg  *)0x44000C00U) /**< \brief (PICOP) ID 0 */
#define REG_PICOP_ID1              (*(RwReg  *)0x44000C04U) /**< \brief (PICOP) ID 1 */
#define REG_PICOP_ID2              (*(RwReg  *)0x44000C08U) /**< \brief (PICOP) ID 2 */
#define REG_PICOP_ID3              (*(RwReg  *)0x44000C0CU) /**< \brief (PICOP) ID 3 */
#define REG_PICOP_ID4              (*(RwReg  *)0x44000C10U) /**< \brief (PICOP) ID 4 */
#define REG_PICOP_ID5              (*(RwReg  *)0x44000C14U) /**< \brief (PICOP) ID 5 */
#define REG_PICOP_ID6              (*(RwReg  *)0x44000C18U) /**< \brief (PICOP) ID 6 */
#define REG_PICOP_ID7              (*(RwReg  *)0x44000C1CU) /**< \brief (PICOP) ID 7 */
#define REG_PICOP_CONFIG           (*(RwReg  *)0x44000C20U) /**< \brief (PICOP) Configuration */
#define REG_PICOP_CTRL             (*(RwReg  *)0x44000C24U) /**< \brief (PICOP) Control */
#define REG_PICOP_CMD              (*(RwReg  *)0x44000C28U) /**< \brief (PICOP) Command */
#define REG_PICOP_PC               (*(RwReg  *)0x44000C2CU) /**< \brief (PICOP) Program Counter */
#define REG_PICOP_HF               (*(RwReg  *)0x44000C30U) /**< \brief (PICOP) Host Flags */
#define REG_PICOP_HFCTRL           (*(RwReg  *)0x44000C34U) /**< \brief (PICOP) Host Flag Control */
#define REG_PICOP_HFSETCLR0        (*(RwReg  *)0x44000C38U) /**< \brief (PICOP) Host Flags Set/Clr */
#define REG_PICOP_HFSETCLR1        (*(RwReg  *)0x44000C3CU) /**< \brief (PICOP) Host Flags Set/Clr */
#define REG_PICOP_OCDCONFIG        (*(RwReg  *)0x44000C50U) /**< \brief (PICOP) OCD Configuration */
#define REG_PICOP_OCDCONTROL       (*(RwReg  *)0x44000C54U) /**< \brief (PICOP) OCD Control */
#define REG_PICOP_OCDSTATUS        (*(RwReg  *)0x44000C58U) /**< \brief (PICOP) OCD Status and Command */
#define REG_PICOP_OCDPC            (*(RwReg  *)0x44000C5CU) /**< \brief (PICOP) ODC Program Counter */
#define REG_PICOP_OCDFEAT          (*(RwReg  *)0x44000C60U) /**< \brief (PICOP) OCD Features */
#define REG_PICOP_OCDCCNT          (*(RwReg  *)0x44000C68U) /**< \brief (PICOP) OCD Cycle Counter */
#define REG_PICOP_OCDBPGEN0        (*(RwReg  *)0x44000C70U) /**< \brief (PICOP) OCD Breakpoint Generator 0 */
#define REG_PICOP_OCDBPGEN1        (*(RwReg  *)0x44000C74U) /**< \brief (PICOP) OCD Breakpoint Generator 1 */
#define REG_PICOP_OCDBPGEN2        (*(RwReg  *)0x44000C78U) /**< \brief (PICOP) OCD Breakpoint Generator 2 */
#define REG_PICOP_OCDBPGEN3        (*(RwReg  *)0x44000C7CU) /**< \brief (PICOP) OCD Breakpoint Generator 3 */
#define REG_PICOP_R3R0             (*(RwReg  *)0x44000C80U) /**< \brief (PICOP) R3 to 0 */
#define REG_PICOP_R7R4             (*(RwReg  *)0x44000C84U) /**< \brief (PICOP) R7 to 4 */
#define REG_PICOP_R11R8            (*(RwReg  *)0x44000C88U) /**< \brief (PICOP) R11 to 8 */
#define REG_PICOP_R15R12           (*(RwReg  *)0x44000C8CU) /**< \brief (PICOP) R15 to 12 */
#define REG_PICOP_R19R16           (*(RwReg  *)0x44000C90U) /**< \brief (PICOP) R19 to 16 */
#define REG_PICOP_R23R20           (*(RwReg  *)0x44000C94U) /**< \brief (PICOP) R23 to 20 */
#define REG_PICOP_R27R24           (*(RwReg  *)0x44000C98U) /**< \brief (PICOP) R27 to 24: XH, XL, R25, R24 */
#define REG_PICOP_R31R28           (*(RwReg  *)0x44000C9CU) /**< \brief (PICOP) R31 to 28: ZH, ZL, YH, YL */
#define REG_PICOP_S1S0             (*(RwReg  *)0x44000CA0U) /**< \brief (PICOP) System Regs 1 to 0: SR */
#define REG_PICOP_S3S2             (*(RwReg  *)0x44000CA4U) /**< \brief (PICOP) System Regs 3 to 2: CTRL */
#define REG_PICOP_S5S4             (*(RwReg  *)0x44000CA8U) /**< \brief (PICOP) System Regs 5 to 4: SREG, CCR */
#define REG_PICOP_S11S10           (*(RwReg  *)0x44000CB4U) /**< \brief (PICOP) System Regs 11 to 10: Immediate */
#define REG_PICOP_LINK             (*(RwReg  *)0x44000CB8U) /**< \brief (PICOP) Link */
#define REG_PICOP_SP               (*(RwReg  *)0x44000CBCU) /**< \brief (PICOP) Stack Pointer */
#define REG_PICOP_MMUFLASH         (*(RwReg  *)0x44000D00U) /**< \brief (PICOP) MMU mapping for flash */
#define REG_PICOP_MMU0             (*(RwReg  *)0x44000D18U) /**< \brief (PICOP) MMU mapping user 0 */
#define REG_PICOP_MMU1             (*(RwReg  *)0x44000D1CU) /**< \brief (PICOP) MMU mapping user 1 */
#define REG_PICOP_MMUCTRL          (*(RwReg  *)0x44000D20U) /**< \brief (PICOP) MMU Control */
#define REG_PICOP_ICACHE           (*(RwReg  *)0x44000D80U) /**< \brief (PICOP) Instruction Cache Control */
#define REG_PICOP_ICACHELRU        (*(RwReg  *)0x44000D84U) /**< \brief (PICOP) Instruction Cache LRU */
#define REG_PICOP_QOSCTRL          (*(RwReg  *)0x44000E00U) /**< \brief (PICOP) QOS Control */
#endif /* (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

/* ************************************************************************** */
/**  PERIPHERAL ID DEFINITIONS FOR U3005 */
/* ************************************************************************** */
/** \addtogroup U3005_id Peripheral Ids Definitions */
/*@{*/

