zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
// Peripheral instances on HPB0 bridge
#define ID_PM             0 /**< \brief Power Manager (PM) */
#define ID_MCLK           1 /**< \brief Main Clock (MCLK) */
#define ID_RSTC           2 /**< \brief Reset Controller (RSTC) */
#define ID_OSCCTRL        3 /**< \brief Oscillators Control (OSCCTRL) */
#define ID_OSC32KCTRL     4 /**< \brief 32k Oscillators Control (OSC32KCTRL) */
#define ID_SUPC           5 /**< \brief Supply Controller (SUPC) */
#define ID_GCLK           6 /**< \brief Generic Clock Generator (GCLK) */
#define ID_WDT            7 /**< \brief Watchdog Timer (WDT) */
#define ID_RTC            8 /**< \brief Real-Time Counter (RTC) */
#define ID_EIC            9 /**< \brief External Interrupt Controller (EIC) */
#define ID_PORT          10 /**< \brief Port Module (PORT) */
#define ID_TAL           11 /**< \brief Trigger Allocator (TAL) */
#define ID_DSUSTANDBY    12 /**< \brief Device Service Unit (DSUSTANDBY) */

// Peripheral instances on HPB1 bridge
#define ID_USB           32 /**< \brief Universal Serial Bus (USB) */
#define ID_DSU           33 /**< \brief Device Service Unit (DSU) */
#define ID_NVMCTRL       34 /**< \brief Non-Volatile Memory Controller (NVMCTRL) */
#define ID_MTB           35 /**< \brief Cortex-M0+ Micro-Trace Buffer (MTB) */
#define ID_HMATRIXHS     36 /**< \brief HSB Matrix HMATRIXH (HMATRIXHS) */
#define ID_ATW           37 /**< \brief Analog Test Wire Controller (ATW) */

// Peripheral instances on HPB2 bridge
#define ID_SERCOM0       64 /**< \brief Serial Communication Interface SERCOM (SERCOM0) */
#define ID_SERCOM1       65 /**< \brief Serial Communication Interface SERCOM (SERCOM1) */
#define ID_SERCOM2       66 /**< \brief Serial Communication Interface SERCOM (SERCOM2) */
#define ID_SERCOM3       67 /**< \brief Serial Communication Interface SERCOM (SERCOM3) */
#define ID_SERCOM4       68 /**< \brief Serial Communication Interface SERCOM (SERCOM4) */
#define ID_TCC0          69 /**< \brief Timer Counter Control TCC (TCC0) */
#define ID_TCC1          70 /**< \brief Timer Counter Control TCC (TCC1) */
#define ID_TCC2          71 /**< \brief Timer Counter Control TCC (TCC2) */
#define ID_TC0           72 /**< \brief Basic Timer Counter TC (TC0) */
#define ID_TC1           73 /**< \brief Basic Timer Counter TC (TC1) */
#define ID_TC2           74 /**< \brief Basic Timer Counter TC (TC2) */
#define ID_TC3           75 /**< \brief Basic Timer Counter TC (TC3) */
#define ID_DAC           76 /**< \brief Digital-to-Analog Converter (DAC) */
#define ID_AES           77 /**< \brief Advanced Encryption Standard (AES) */
#define ID_TRNG          78 /**< \brief True Random Generator (TRNG) */
#define ID_RFCTRL        79 /**< \brief RF233 control module (RFCTRL) */

// Peripheral instances on HPB3 bridge
#define ID_EVSYS         96 /**< \brief Event System Interface (EVSYS) */
#define ID_SERCOM5       97 /**< \brief Serial Communication Interface SERCOM (SERCOM5) */
#define ID_TC4           98 /**< \brief Basic Timer Counter TC (TC4) */
#define ID_ADC           99 /**< \brief Analog Digital Converter (ADC) */
#define ID_AC           100 /**< \brief Analog Comparators (AC) */
#define ID_PTC          101 /**< \brief Peripheral Touch Controller (PTC) */
#define ID_OPAMP        102 /**< \brief Operational Amplifier (OPAMP) */
#define ID_CCL          103 /**< \brief Configurable Custom Logic (CCL) */

// Peripheral instances on HPB4 bridge
#define ID_PAC          128 /**< \brief Peripheral Access Controller (PAC) */
#define ID_DMAC         129 /**< \brief Direct Memory Access Controller (DMAC) */
#define ID_HMATRIXLP    130 /**< \brief HSB Matrix HMATRIXL (HMATRIXLP) */
#define ID_PICOP        131 /**< \brief PicoProcessor (PICOP) */

#define ID_PERIPH_COUNT 132 /**< \brief Number of peripheral IDs */
/*@}*/

/* ************************************************************************** */
/**  BASE ADDRESS DEFINITIONS FOR U3005 */
/* ************************************************************************** */
/** \addtogroup U3005_base Peripheral Base Address Definitions */
/*@{*/

#if defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)
#define AC                              (0x43001000U) /**< \brief (AC) APB Base Address */
#define ADC                             (0x43000C00U) /**< \brief (ADC) APB Base Address */
#define AES                             (0x42003400U) /**< \brief (AES) APB Base Address */
#define ATW                             (0x4100A000U) /**< \brief (ATW) APB Base Address */
#define CCL                             (0x43001C00U) /**< \brief (CCL) APB Base Address */
#define DAC                             (0x42003000U) /**< \brief (DAC) APB Base Address */
#define DMAC                            (0x44000400U) /**< \brief (DMAC) APB Base Address */
#define DSU                             (0x41002000U) /**< \brief (DSU) APB Base Address */
#define DSUSTANDBY                      (0x40003000U) /**< \brief (DSUSTANDBY) APB Base Address */
#define EIC                             (0x40002400U) /**< \brief (EIC) APB Base Address */
#define EVSYS                           (0x43000000U) /**< \brief (EVSYS) APB Base Address */
#define GCLK                            (0x40001800U) /**< \brief (GCLK) APB Base Address */
#define HMATRIXHS                       (0x41008000U) /**< \brief (HMATRIXHS) APB Base Address */
#define HMATRIXLP                       (0x44000800U) /**< \brief (HMATRIXLP) APB Base Address */
#define MCLK                            (0x40000400U) /**< \brief (MCLK) APB Base Address */
#define MTB                             (0x41006000U) /**< \brief (MTB) APB Base Address */
#define NVMCTRL                         (0x41004000U) /**< \brief (NVMCTRL) APB Base Address */
#define NVMCTRL_CAL                     (0x00800000U) /**< \brief (NVMCTRL) CAL Base Address */
#define NVMCTRL_LOCKBIT                 (0x00802000U) /**< \brief (NVMCTRL) LOCKBIT Base Address */
#define NVMCTRL_OTP1                    (0x00806000U) /**< \brief (NVMCTRL) OTP1 Base Address */
#define NVMCTRL_OTP2                    (0x00806008U) /**< \brief (NVMCTRL) OTP2 Base Address */
#define NVMCTRL_OTP3                    (0x00806010U) /**< \brief (NVMCTRL) OTP3 Base Address */
#define NVMCTRL_OTP4                    (0x00806018U) /**< \brief (NVMCTRL) OTP4 Base Address */
#define NVMCTRL_OTP5                    (0x00806020U) /**< \brief (NVMCTRL) OTP5 Base Address */
#define NVMCTRL_TEMP_LOG                (0x00806030U) /**< \brief (NVMCTRL) TEMP_LOG Base Address */
#define NVMCTRL_USER                    (0x00804000U) /**< \brief (NVMCTRL) USER Base Address */
#define OPAMP                           (0x43001800U) /**< \brief (OPAMP) APB Base Address */
#define OSCCTRL                         (0x40000C00U) /**< \brief (OSCCTRL) APB Base Address */
#define OSC32KCTRL                      (0x40001000U) /**< \brief (OSC32KCTRL) APB Base Address */
#define PAC                             (0x44000000U) /**< \brief (PAC) APB Base Address */
#define PICOP                           (0x44000C00U) /**< \brief (PICOP) APB Base Address */
#define PM                              (0x40000000U) /**< \brief (PM) APB Base Address */
#define PORT                            (0x40002800U) /**< \brief (PORT) APB Base Address */
#define PORT_IOBUS                      (0x60000000U) /**< \brief (PORT) IOBUS Base Address */
#define PTC                             (0x43001400U) /**< \brief (PTC) APB Base Address */
#define RFCTRL                          (0x42003C00U) /**< \brief (RFCTRL) APB Base Address */
#define RSTC                            (0x40000800U) /**< \brief (RSTC) APB Base Address */
#define RTC                             (0x40002000U) /**< \brief (RTC) APB Base Address */
#define SERCOM0                         (0x42000000U) /**< \brief (SERCOM0) APB Base Address */
#define SERCOM1                         (0x42000400U) /**< \brief (SERCOM1) APB Base Address */
#define SERCOM2                         (0x42000800U) /**< \brief (SERCOM2) APB Base Address */
#define SERCOM3                         (0x42000C00U) /**< \brief (SERCOM3) APB Base Address */
#define SERCOM4                         (0x42001000U) /**< \brief (SERCOM4) APB Base Address */
#define SERCOM5                         (0x43000400U) /**< \brief (SERCOM5) APB Base Address */
#define SUPC                            (0x40001400U) /**< \brief (SUPC) APB Base Address */
#define TAL                             (0x40002C00U) /**< \brief (TAL) APB Base Address */
#define TC0                             (0x42002000U) /**< \brief (TC0) APB Base Address */
#define TC1                             (0x42002400U) /**< \brief (TC1) APB Base Address */
#define TC2                             (0x42002800U) /**< \brief (TC2) APB Base Address */
#define TC3                             (0x42002C00U) /**< \brief (TC3) APB Base Address */
#define TC4                             (0x43000800U) /**< \brief (TC4) APB Base Address */
#define TCC0                            (0x42001400U) /**< \brief (TCC0) APB Base Address */
#define TCC1                            (0x42001800U) /**< \brief (TCC1) APB Base Address */
#define TCC2                            (0x42001C00U) /**< \brief (TCC2) APB Base Address */
#define TRNG                            (0x42003800U) /**< \brief (TRNG) APB Base Address */
#define USB                             (0x41000000U) /**< \brief (USB) APB Base Address */
#define WDT                             (0x40001C00U) /**< \brief (WDT) APB Base Address */
#else
#define AC_ADDR                         (0x43001000U) /**< \brief (AC) APB Base Address */
#define AC                ((Ac         *)0x43001000U) /**< \brief (AC) APB Base Address */
#define AC_INST_NUM       1                           /**< \brief (AC) Number of instances */
#define AC_INSTS          { AC }                      /**< \brief (AC) Instances List */

#define ADC_ADDR                        (0x43000C00U) /**< \brief (ADC) APB Base Address */
#define ADC               ((Adc        *)0x43000C00U) /**< \brief (ADC) APB Base Address */
#define ADC_INST_NUM      1                           /**< \brief (ADC) Number of instances */
#define ADC_INSTS         { ADC }                     /**< \brief (ADC) Instances List */

#define AES_ADDR                        (0x42003400U) /**< \brief (AES) APB Base Address */
#define AES               ((Aes        *)0x42003400U) /**< \brief (AES) APB Base Address */
#define AES_INST_NUM      1                           /**< \brief (AES) Number of instances */
#define AES_INSTS         { AES }                     /**< \brief (AES) Instances List */

#define ATW_ADDR                        (0x4100A000U) /**< \brief (ATW) APB Base Address */
#define ATW               ((Atw        *)0x4100A000U) /**< \brief (ATW) APB Base Address */
#define ATW_INST_NUM      1                           /**< \brief (ATW) Number of instances */
#define ATW_INSTS         { ATW }                     /**< \brief (ATW) Instances List */

#define CCL_ADDR                        (0x43001C00U) /**< \brief (CCL) APB Base Address */
#define CCL               ((Ccl        *)0x43001C00U) /**< \brief (CCL) APB Base Address */
#define CCL_INST_NUM      1                           /**< \brief (CCL) Number of instances */
#define CCL_INSTS         { CCL }                     /**< \brief (CCL) Instances List */

#define DAC_ADDR                        (0x42003000U) /**< \brief (DAC) APB Base Address */
#define DAC               ((Dac        *)0x42003000U) /**< \brief (DAC) APB Base Address */
#define DAC_INST_NUM      1                           /**< \brief (DAC) Number of instances */
#define DAC_INSTS         { DAC }                     /**< \brief (DAC) Instances List */

