zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define DMAC_ADDR                       (0x44000400U) /**< \brief (DMAC) APB Base Address */
#define DMAC              ((Dmac       *)0x44000400U) /**< \brief (DMAC) APB Base Address */
#define DMAC_INST_NUM     1                           /**< \brief (DMAC) Number of instances */
#define DMAC_INSTS        { DMAC }                    /**< \brief (DMAC) Instances List */

#define DSU_ADDR                        (0x41002000U) /**< \brief (DSU) APB Base Address */
#define DSU               ((Dsu        *)0x41002000U) /**< \brief (DSU) APB Base Address */
#define DSU_INST_NUM      1                           /**< \brief (DSU) Number of instances */
#define DSU_INSTS         { DSU }                     /**< \brief (DSU) Instances List */

#define DSUSTANDBY_ADDR                 (0x40003000U) /**< \brief (DSUSTANDBY) APB Base Address */
#define DSUSTANDBY        ((Dsustandby *)0x40003000U) /**< \brief (DSUSTANDBY) APB Base Address */
#define DSUSTANDBY_INST_NUM 1                           /**< \brief (DSUSTANDBY) Number of instances */
#define DSUSTANDBY_INSTS  { DSUSTANDBY }              /**< \brief (DSUSTANDBY) Instances List */

#define EIC_ADDR                        (0x40002400U) /**< \brief (EIC) APB Base Address */
#define EIC               ((Eic        *)0x40002400U) /**< \brief (EIC) APB Base Address */
#define EIC_INST_NUM      1                           /**< \brief (EIC) Number of instances */
#define EIC_INSTS         { EIC }                     /**< \brief (EIC) Instances List */

#define EVSYS_ADDR                      (0x43000000U) /**< \brief (EVSYS) APB Base Address */
#define EVSYS             ((Evsys      *)0x43000000U) /**< \brief (EVSYS) APB Base Address */
#define EVSYS_INST_NUM    1                           /**< \brief (EVSYS) Number of instances */
#define EVSYS_INSTS       { EVSYS }                   /**< \brief (EVSYS) Instances List */

#define GCLK_ADDR                       (0x40001800U) /**< \brief (GCLK) APB Base Address */
#define GCLK              ((Gclk       *)0x40001800U) /**< \brief (GCLK) APB Base Address */
#define GCLK_INST_NUM     1                           /**< \brief (GCLK) Number of instances */
#define GCLK_INSTS        { GCLK }                    /**< \brief (GCLK) Instances List */

#define HMATRIXHS_ADDR                  (0x41008000U) /**< \brief (HMATRIXHS) APB Base Address */
#define HMATRIXHS         ((Hmatrixb   *)0x41008000U) /**< \brief (HMATRIXHS) APB Base Address */
#define HMATRIXLP_ADDR                  (0x44000800U) /**< \brief (HMATRIXLP) APB Base Address */
#define HMATRIXLP         ((Hmatrixb   *)0x44000800U) /**< \brief (HMATRIXLP) APB Base Address */
#define HMATRIXB_INST_NUM 2                           /**< \brief (HMATRIXB) Number of instances */
#define HMATRIXB_INSTS    { HMATRIXHS, HMATRIXLP }    /**< \brief (HMATRIXB) Instances List */

#define MCLK_ADDR                       (0x40000400U) /**< \brief (MCLK) APB Base Address */
#define MCLK              ((Mclk       *)0x40000400U) /**< \brief (MCLK) APB Base Address */
#define MCLK_INST_NUM     1                           /**< \brief (MCLK) Number of instances */
#define MCLK_INSTS        { MCLK }                    /**< \brief (MCLK) Instances List */

#define MTB_ADDR                        (0x41006000U) /**< \brief (MTB) APB Base Address */
#define MTB               ((Mtb        *)0x41006000U) /**< \brief (MTB) APB Base Address */
#define MTB_INST_NUM      1                           /**< \brief (MTB) Number of instances */
#define MTB_INSTS         { MTB }                     /**< \brief (MTB) Instances List */

#define NVMCTRL_ADDR                    (0x41004000U) /**< \brief (NVMCTRL) APB Base Address */
#define NVMCTRL           ((Nvmctrl    *)0x41004000U) /**< \brief (NVMCTRL) APB Base Address */
#define NVMCTRL_CAL_ADDR                (0x00800000U) /**< \brief (NVMCTRL) CAL Base Address */
#define NVMCTRL_CAL                     (0x00800000U) /**< \brief (NVMCTRL) CAL Base Address */
#define NVMCTRL_LOCKBIT_ADDR            (0x00802000U) /**< \brief (NVMCTRL) LOCKBIT Base Address */
#define NVMCTRL_LOCKBIT                 (0x00802000U) /**< \brief (NVMCTRL) LOCKBIT Base Address */
#define NVMCTRL_OTP1_ADDR               (0x00806000U) /**< \brief (NVMCTRL) OTP1 Base Address */
#define NVMCTRL_OTP1                    (0x00806000U) /**< \brief (NVMCTRL) OTP1 Base Address */
#define NVMCTRL_OTP2_ADDR               (0x00806008U) /**< \brief (NVMCTRL) OTP2 Base Address */
#define NVMCTRL_OTP2                    (0x00806008U) /**< \brief (NVMCTRL) OTP2 Base Address */
#define NVMCTRL_OTP3_ADDR               (0x00806010U) /**< \brief (NVMCTRL) OTP3 Base Address */
#define NVMCTRL_OTP3                    (0x00806010U) /**< \brief (NVMCTRL) OTP3 Base Address */
#define NVMCTRL_OTP4_ADDR               (0x00806018U) /**< \brief (NVMCTRL) OTP4 Base Address */
#define NVMCTRL_OTP4                    (0x00806018U) /**< \brief (NVMCTRL) OTP4 Base Address */
#define NVMCTRL_OTP5_ADDR               (0x00806020U) /**< \brief (NVMCTRL) OTP5 Base Address */
#define NVMCTRL_OTP5                    (0x00806020U) /**< \brief (NVMCTRL) OTP5 Base Address */
#define NVMCTRL_TEMP_LOG_ADDR           (0x00806030U) /**< \brief (NVMCTRL) TEMP_LOG Base Address */
#define NVMCTRL_TEMP_LOG                (0x00806030U) /**< \brief (NVMCTRL) TEMP_LOG Base Address */
#define NVMCTRL_USER_ADDR               (0x00804000U) /**< \brief (NVMCTRL) USER Base Address */
#define NVMCTRL_USER                    (0x00804000U) /**< \brief (NVMCTRL) USER Base Address */
#define NVMCTRL_INST_NUM  1                           /**< \brief (NVMCTRL) Number of instances */
#define NVMCTRL_INSTS     { NVMCTRL }                 /**< \brief (NVMCTRL) Instances List */

#define OPAMP_ADDR                      (0x43001800U) /**< \brief (OPAMP) APB Base Address */
#define OPAMP             ((Opamp      *)0x43001800U) /**< \brief (OPAMP) APB Base Address */
#define OPAMP_INST_NUM    1                           /**< \brief (OPAMP) Number of instances */
#define OPAMP_INSTS       { OPAMP }                   /**< \brief (OPAMP) Instances List */

