zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define OSCCTRL_ADDR                    (0x40000C00U) /**< \brief (OSCCTRL) APB Base Address */
#define OSCCTRL           ((Oscctrl    *)0x40000C00U) /**< \brief (OSCCTRL) APB Base Address */
#define OSCCTRL_INST_NUM  1                           /**< \brief (OSCCTRL) Number of instances */
#define OSCCTRL_INSTS     { OSCCTRL }                 /**< \brief (OSCCTRL) Instances List */

#define OSC32KCTRL_ADDR                 (0x40001000U) /**< \brief (OSC32KCTRL) APB Base Address */
#define OSC32KCTRL        ((Osc32kctrl *)0x40001000U) /**< \brief (OSC32KCTRL) APB Base Address */
#define OSC32KCTRL_INST_NUM 1                           /**< \brief (OSC32KCTRL) Number of instances */
#define OSC32KCTRL_INSTS  { OSC32KCTRL }              /**< \brief (OSC32KCTRL) Instances List */

#define PAC_ADDR                        (0x44000000U) /**< \brief (PAC) APB Base Address */
#define PAC               ((Pac        *)0x44000000U) /**< \brief (PAC) APB Base Address */
#define PAC_INST_NUM      1                           /**< \brief (PAC) Number of instances */
#define PAC_INSTS         { PAC }                     /**< \brief (PAC) Instances List */

#define PICOP_ADDR                      (0x44000C00U) /**< \brief (PICOP) APB Base Address */
#define PICOP             ((Picop      *)0x44000C00U) /**< \brief (PICOP) APB Base Address */
#define PICOP_INST_NUM    1                           /**< \brief (PICOP) Number of instances */
#define PICOP_INSTS       { PICOP }                   /**< \brief (PICOP) Instances List */

#define PM_ADDR                         (0x40000000U) /**< \brief (PM) APB Base Address */
#define PM                ((Pm         *)0x40000000U) /**< \brief (PM) APB Base Address */
#define PM_INST_NUM       1                           /**< \brief (PM) Number of instances */
#define PM_INSTS          { PM }                      /**< \brief (PM) Instances List */

#define PORT_ADDR                       (0x40002800U) /**< \brief (PORT) APB Base Address */
#define PORT              ((Port       *)0x40002800U) /**< \brief (PORT) APB Base Address */
#define PORT_IOBUS_ADDR                 (0x60000000U) /**< \brief (PORT) IOBUS Base Address */
#define PORT_IOBUS        ((Port       *)0x60000000U) /**< \brief (PORT) IOBUS Base Address */
#define PORT_INST_NUM     1                           /**< \brief (PORT) Number of instances */
#define PORT_INSTS        { PORT }                    /**< \brief (PORT) Instances List */

#define PTC_ADDR                        (0x43001400U) /**< \brief (PTC) APB Base Address */
#define PTC               ((Ptc        *)0x43001400U) /**< \brief (PTC) APB Base Address */
#define PTC_INST_NUM      1                           /**< \brief (PTC) Number of instances */
#define PTC_INSTS         { PTC }                     /**< \brief (PTC) Instances List */

#define RFCTRL_ADDR                     (0x42003C00U) /**< \brief (RFCTRL) APB Base Address */
#define RFCTRL            ((Rfctrl     *)0x42003C00U) /**< \brief (RFCTRL) APB Base Address */
#define RFCTRL_INST_NUM   1                           /**< \brief (RFCTRL) Number of instances */
#define RFCTRL_INSTS      { RFCTRL }                  /**< \brief (RFCTRL) Instances List */

#define RSTC_ADDR                       (0x40000800U) /**< \brief (RSTC) APB Base Address */
#define RSTC              ((Rstc       *)0x40000800U) /**< \brief (RSTC) APB Base Address */
#define RSTC_INST_NUM     1                           /**< \brief (RSTC) Number of instances */
#define RSTC_INSTS        { RSTC }                    /**< \brief (RSTC) Instances List */

#define RTC_ADDR                        (0x40002000U) /**< \brief (RTC) APB Base Address */
#define RTC               ((Rtc        *)0x40002000U) /**< \brief (RTC) APB Base Address */
#define RTC_INST_NUM      1                           /**< \brief (RTC) Number of instances */
#define RTC_INSTS         { RTC }                     /**< \brief (RTC) Instances List */

#define SERCOM0_ADDR                    (0x42000000U) /**< \brief (SERCOM0) APB Base Address */
#define SERCOM0           ((Sercom     *)0x42000000U) /**< \brief (SERCOM0) APB Base Address */
#define SERCOM1_ADDR                    (0x42000400U) /**< \brief (SERCOM1) APB Base Address */
#define SERCOM1           ((Sercom     *)0x42000400U) /**< \brief (SERCOM1) APB Base Address */
#define SERCOM2_ADDR                    (0x42000800U) /**< \brief (SERCOM2) APB Base Address */
#define SERCOM2           ((Sercom     *)0x42000800U) /**< \brief (SERCOM2) APB Base Address */
#define SERCOM3_ADDR                    (0x42000C00U) /**< \brief (SERCOM3) APB Base Address */
#define SERCOM3           ((Sercom     *)0x42000C00U) /**< \brief (SERCOM3) APB Base Address */
#define SERCOM4_ADDR                    (0x42001000U) /**< \brief (SERCOM4) APB Base Address */
#define SERCOM4           ((Sercom     *)0x42001000U) /**< \brief (SERCOM4) APB Base Address */
#define SERCOM5_ADDR                    (0x43000400U) /**< \brief (SERCOM5) APB Base Address */
#define SERCOM5           ((Sercom     *)0x43000400U) /**< \brief (SERCOM5) APB Base Address */
#define SERCOM_INST_NUM   6                           /**< \brief (SERCOM) Number of instances */
#define SERCOM_INSTS      { SERCOM0, SERCOM1, SERCOM2, SERCOM3, SERCOM4, SERCOM5 } /**< \brief (SERCOM) Instances List */

#define SUPC_ADDR                       (0x40001400U) /**< \brief (SUPC) APB Base Address */
#define SUPC              ((Supc       *)0x40001400U) /**< \brief (SUPC) APB Base Address */
#define SUPC_INST_NUM     1                           /**< \brief (SUPC) Number of instances */
#define SUPC_INSTS        { SUPC }                    /**< \brief (SUPC) Instances List */

#define TAL_ADDR                        (0x40002C00U) /**< \brief (TAL) APB Base Address */
#define TAL               ((Tal        *)0x40002C00U) /**< \brief (TAL) APB Base Address */
#define TAL_INST_NUM      1                           /**< \brief (TAL) Number of instances */
#define TAL_INSTS         { TAL }                     /**< \brief (TAL) Instances List */

