zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define PIN_PA00                           0  /**< \brief Pin Number for PA00 */
#define PORT_PA00                  (1u <<  0) /**< \brief PORT Mask  for PA00 */
#define PIN_PA01                           1  /**< \brief Pin Number for PA01 */
#define PORT_PA01                  (1u <<  1) /**< \brief PORT Mask  for PA01 */
#define PIN_PA02                           2  /**< \brief Pin Number for PA02 */
#define PORT_PA02                  (1u <<  2) /**< \brief PORT Mask  for PA02 */
#define PIN_PA03                           3  /**< \brief Pin Number for PA03 */
#define PORT_PA03                  (1u <<  3) /**< \brief PORT Mask  for PA03 */
#define PIN_PA04                           4  /**< \brief Pin Number for PA04 */
#define PORT_PA04                  (1u <<  4) /**< \brief PORT Mask  for PA04 */
#define PIN_PA05                           5  /**< \brief Pin Number for PA05 */
#define PORT_PA05                  (1u <<  5) /**< \brief PORT Mask  for PA05 */
#define PIN_PA06                           6  /**< \brief Pin Number for PA06 */
#define PORT_PA06                  (1u <<  6) /**< \brief PORT Mask  for PA06 */
#define PIN_PA07                           7  /**< \brief Pin Number for PA07 */
#define PORT_PA07                  (1u <<  7) /**< \brief PORT Mask  for PA07 */
#define PIN_PA08                           8  /**< \brief Pin Number for PA08 */
#define PORT_PA08                  (1u <<  8) /**< \brief PORT Mask  for PA08 */
#define PIN_PA09                           9  /**< \brief Pin Number for PA09 */
#define PORT_PA09                  (1u <<  9) /**< \brief PORT Mask  for PA09 */
#define PIN_PA10                          10  /**< \brief Pin Number for PA10 */
#define PORT_PA10                  (1u << 10) /**< \brief PORT Mask  for PA10 */
#define PIN_PA11                          11  /**< \brief Pin Number for PA11 */
#define PORT_PA11                  (1u << 11) /**< \brief PORT Mask  for PA11 */
#define PIN_PA12                          12  /**< \brief Pin Number for PA12 */
#define PORT_PA12                  (1u << 12) /**< \brief PORT Mask  for PA12 */
#define PIN_PA13                          13  /**< \brief Pin Number for PA13 */
#define PORT_PA13                  (1u << 13) /**< \brief PORT Mask  for PA13 */
#define PIN_PA14                          14  /**< \brief Pin Number for PA14 */
#define PORT_PA14                  (1u << 14) /**< \brief PORT Mask  for PA14 */
#define PIN_PA15                          15  /**< \brief Pin Number for PA15 */
#define PORT_PA15                  (1u << 15) /**< \brief PORT Mask  for PA15 */
#define PIN_PA16                          16  /**< \brief Pin Number for PA16 */
#define PORT_PA16                  (1u << 16) /**< \brief PORT Mask  for PA16 */
#define PIN_PA17                          17  /**< \brief Pin Number for PA17 */
#define PORT_PA17                  (1u << 17) /**< \brief PORT Mask  for PA17 */
#define PIN_PA18                          18  /**< \brief Pin Number for PA18 */
#define PORT_PA18                  (1u << 18) /**< \brief PORT Mask  for PA18 */
#define PIN_PA19                          19  /**< \brief Pin Number for PA19 */
#define PORT_PA19                  (1u << 19) /**< \brief PORT Mask  for PA19 */
#define PIN_PA20                          20  /**< \brief Pin Number for PA20 */
#define PORT_PA20                  (1u << 20) /**< \brief PORT Mask  for PA20 */
#define PIN_PA21                          21  /**< \brief Pin Number for PA21 */
#define PORT_PA21                  (1u << 21) /**< \brief PORT Mask  for PA21 */
#define PIN_PA22                          22  /**< \brief Pin Number for PA22 */
#define PORT_PA22                  (1u << 22) /**< \brief PORT Mask  for PA22 */
#define PIN_PA23                          23  /**< \brief Pin Number for PA23 */
#define PORT_PA23                  (1u << 23) /**< \brief PORT Mask  for PA23 */
#define PIN_PA24                          24  /**< \brief Pin Number for PA24 */
#define PORT_PA24                  (1u << 24) /**< \brief PORT Mask  for PA24 */
#define PIN_PA25                          25  /**< \brief Pin Number for PA25 */
#define PORT_PA25                  (1u << 25) /**< \brief PORT Mask  for PA25 */
#define PIN_PA27                          27  /**< \brief Pin Number for PA27 */
#define PORT_PA27                  (1u << 27) /**< \brief PORT Mask  for PA27 */
#define PIN_PA28                          28  /**< \brief Pin Number for PA28 */
#define PORT_PA28                  (1u << 28) /**< \brief PORT Mask  for PA28 */
#define PIN_PA30                          30  /**< \brief Pin Number for PA30 */
#define PORT_PA30                  (1u << 30) /**< \brief PORT Mask  for PA30 */
#define PIN_PA31                          31  /**< \brief Pin Number for PA31 */
#define PORT_PA31                  (1u << 31) /**< \brief PORT Mask  for PA31 */
#define PIN_PB00                          32  /**< \brief Pin Number for PB00 */
#define PORT_PB00                  (1u <<  0) /**< \brief PORT Mask  for PB00 */
#define PIN_PB01                          33  /**< \brief Pin Number for PB01 */
#define PORT_PB01                  (1u <<  1) /**< \brief PORT Mask  for PB01 */
#define PIN_PB02                          34  /**< \brief Pin Number for PB02 */
#define PORT_PB02                  (1u <<  2) /**< \brief PORT Mask  for PB02 */
#define PIN_PB03                          35  /**< \brief Pin Number for PB03 */
#define PORT_PB03                  (1u <<  3) /**< \brief PORT Mask  for PB03 */
#define PIN_PB04                          36  /**< \brief Pin Number for PB04 */
#define PORT_PB04                  (1u <<  4) /**< \brief PORT Mask  for PB04 */
#define PIN_PB05                          37  /**< \brief Pin Number for PB05 */
#define PORT_PB05                  (1u <<  5) /**< \brief PORT Mask  for PB05 */
#define PIN_PB06                          38  /**< \brief Pin Number for PB06 */
#define PORT_PB06                  (1u <<  6) /**< \brief PORT Mask  for PB06 */
#define PIN_PB07                          39  /**< \brief Pin Number for PB07 */
#define PORT_PB07                  (1u <<  7) /**< \brief PORT Mask  for PB07 */
#define PIN_PB08                          40  /**< \brief Pin Number for PB08 */
#define PORT_PB08                  (1u <<  8) /**< \brief PORT Mask  for PB08 */
#define PIN_PB09                          41  /**< \brief Pin Number for PB09 */
#define PORT_PB09                  (1u <<  9) /**< \brief PORT Mask  for PB09 */
#define PIN_PB10                          42  /**< \brief Pin Number for PB10 */
#define PORT_PB10                  (1u << 10) /**< \brief PORT Mask  for PB10 */
#define PIN_PB11                          43  /**< \brief Pin Number for PB11 */
#define PORT_PB11                  (1u << 11) /**< \brief PORT Mask  for PB11 */
#define PIN_PB12                          44  /**< \brief Pin Number for PB12 */
#define PORT_PB12                  (1u << 12) /**< \brief PORT Mask  for PB12 */
#define PIN_PB13                          45  /**< \brief Pin Number for PB13 */
#define PORT_PB13                  (1u << 13) /**< \brief PORT Mask  for PB13 */
#define PIN_PB14                          46  /**< \brief Pin Number for PB14 */
#define PORT_PB14                  (1u << 14) /**< \brief PORT Mask  for PB14 */
#define PIN_PB15                          47  /**< \brief Pin Number for PB15 */
#define PORT_PB15                  (1u << 15) /**< \brief PORT Mask  for PB15 */
#define PIN_PB16                          48  /**< \brief Pin Number for PB16 */
#define PORT_PB16                  (1u << 16) /**< \brief PORT Mask  for PB16 */
#define PIN_PB17                          49  /**< \brief Pin Number for PB17 */
#define PORT_PB17                  (1u << 17) /**< \brief PORT Mask  for PB17 */
#define PIN_PB22                          54  /**< \brief Pin Number for PB22 */
#define PORT_PB22                  (1u << 22) /**< \brief PORT Mask  for PB22 */
#define PIN_PB23                          55  /**< \brief Pin Number for PB23 */
#define PORT_PB23                  (1u << 23) /**< \brief PORT Mask  for PB23 */
#define PIN_PB30                          62  /**< \brief Pin Number for PB30 */
#define PORT_PB30                  (1u << 30) /**< \brief PORT Mask  for PB30 */
#define PIN_PB31                          63  /**< \brief Pin Number for PB31 */
#define PORT_PB31                  (1u << 31) /**< \brief PORT Mask  for PB31 */
#define PIN_PC16                          80  /**< \brief Pin Number for PC16 */
#define PORT_PC16                  (1u << 16) /**< \brief PORT Mask  for PC16 */
#define PIN_PC18                          82  /**< \brief Pin Number for PC18 */
#define PORT_PC18                  (1u << 18) /**< \brief PORT Mask  for PC18 */
#define PIN_PC19                          83  /**< \brief Pin Number for PC19 */
#define PORT_PC19                  (1u << 19) /**< \brief PORT Mask  for PC19 */
/* ========== PORT definition for AC peripheral ========== */
#define PIN_AC_AIN0_PA04B                  4  /**< \brief AC signal: AIN0 on PA04 mux B */
#define MUX_AC_AIN0_PA04B                  1
#define PINMUX_AC_AIN0_PA04B       ((PIN_AC_AIN0_PA04B << 16) | MUX_AC_AIN0_PA04B)
#define PORT_AC_AIN0_PA04B         (1u <<  4)
#define PIN_AC_AIN1_PA05B                  5  /**< \brief AC signal: AIN1 on PA05 mux B */
#define MUX_AC_AIN1_PA05B                  1
#define PINMUX_AC_AIN1_PA05B       ((PIN_AC_AIN1_PA05B << 16) | MUX_AC_AIN1_PA05B)
#define PORT_AC_AIN1_PA05B         (1u <<  5)
#define PIN_AC_AIN2_PA06B                  6  /**< \brief AC signal: AIN2 on PA06 mux B */
#define MUX_AC_AIN2_PA06B                  1
#define PINMUX_AC_AIN2_PA06B       ((PIN_AC_AIN2_PA06B << 16) | MUX_AC_AIN2_PA06B)
#define PORT_AC_AIN2_PA06B         (1u <<  6)
#define PIN_AC_AIN3_PA07B                  7  /**< \brief AC signal: AIN3 on PA07 mux B */
#define MUX_AC_AIN3_PA07B                  1
#define PINMUX_AC_AIN3_PA07B       ((PIN_AC_AIN3_PA07B << 16) | MUX_AC_AIN3_PA07B)
#define PORT_AC_AIN3_PA07B         (1u <<  7)
#define PIN_AC_CMP0_PA12H                 12  /**< \brief AC signal: CMP0 on PA12 mux H */
#define MUX_AC_CMP0_PA12H                  7
#define PINMUX_AC_CMP0_PA12H       ((PIN_AC_CMP0_PA12H << 16) | MUX_AC_CMP0_PA12H)
#define PORT_AC_CMP0_PA12H         (1u << 12)
#define PIN_AC_CMP0_PA18H                 18  /**< \brief AC signal: CMP0 on PA18 mux H */
#define MUX_AC_CMP0_PA18H                  7
#define PINMUX_AC_CMP0_PA18H       ((PIN_AC_CMP0_PA18H << 16) | MUX_AC_CMP0_PA18H)
#define PORT_AC_CMP0_PA18H         (1u << 18)
#define PIN_AC_CMP1_PA13H                 13  /**< \brief AC signal: CMP1 on PA13 mux H */
#define MUX_AC_CMP1_PA13H                  7
#define PINMUX_AC_CMP1_PA13H       ((PIN_AC_CMP1_PA13H << 16) | MUX_AC_CMP1_PA13H)
#define PORT_AC_CMP1_PA13H         (1u << 13)
#define PIN_AC_CMP1_PA19H                 19  /**< \brief AC signal: CMP1 on PA19 mux H */
#define MUX_AC_CMP1_PA19H                  7
#define PINMUX_AC_CMP1_PA19H       ((PIN_AC_CMP1_PA19H << 16) | MUX_AC_CMP1_PA19H)
#define PORT_AC_CMP1_PA19H         (1u << 19)
/* ========== PORT definition for ADC peripheral ========== */
#define PIN_ADC_AIN0_PA02B                 2  /**< \brief ADC signal: AIN0 on PA02 mux B */
#define MUX_ADC_AIN0_PA02B                 1
#define PINMUX_ADC_AIN0_PA02B      ((PIN_ADC_AIN0_PA02B << 16) | MUX_ADC_AIN0_PA02B)
#define PORT_ADC_AIN0_PA02B        (1u <<  2)
#define PIN_ADC_AIN1_PA03B                 3  /**< \brief ADC signal: AIN1 on PA03 mux B */
#define MUX_ADC_AIN1_PA03B                 1
#define PINMUX_ADC_AIN1_PA03B      ((PIN_ADC_AIN1_PA03B << 16) | MUX_ADC_AIN1_PA03B)
#define PORT_ADC_AIN1_PA03B        (1u <<  3)
#define PIN_ADC_AIN2_PB08B                40  /**< \brief ADC signal: AIN2 on PB08 mux B */
#define MUX_ADC_AIN2_PB08B                 1
#define PINMUX_ADC_AIN2_PB08B      ((PIN_ADC_AIN2_PB08B << 16) | MUX_ADC_AIN2_PB08B)
#define PORT_ADC_AIN2_PB08B        (1u <<  8)
#define PIN_ADC_AIN3_PB09B                41  /**< \brief ADC signal: AIN3 on PB09 mux B */
#define MUX_ADC_AIN3_PB09B                 1
#define PINMUX_ADC_AIN3_PB09B      ((PIN_ADC_AIN3_PB09B << 16) | MUX_ADC_AIN3_PB09B)
#define PORT_ADC_AIN3_PB09B        (1u <<  9)
#define PIN_ADC_AIN4_PA04B                 4  /**< \brief ADC signal: AIN4 on PA04 mux B */
#define MUX_ADC_AIN4_PA04B                 1
#define PINMUX_ADC_AIN4_PA04B      ((PIN_ADC_AIN4_PA04B << 16) | MUX_ADC_AIN4_PA04B)
#define PORT_ADC_AIN4_PA04B        (1u <<  4)
#define PIN_ADC_AIN5_PA05B                 5  /**< \brief ADC signal: AIN5 on PA05 mux B */
#define MUX_ADC_AIN5_PA05B                 1
#define PINMUX_ADC_AIN5_PA05B      ((PIN_ADC_AIN5_PA05B << 16) | MUX_ADC_AIN5_PA05B)
#define PORT_ADC_AIN5_PA05B        (1u <<  5)
#define PIN_ADC_AIN6_PA06B                 6  /**< \brief ADC signal: AIN6 on PA06 mux B */
#define MUX_ADC_AIN6_PA06B                 1
#define PINMUX_ADC_AIN6_PA06B      ((PIN_ADC_AIN6_PA06B << 16) | MUX_ADC_AIN6_PA06B)
#define PORT_ADC_AIN6_PA06B        (1u <<  6)
#define PIN_ADC_AIN7_PA07B                 7  /**< \brief ADC signal: AIN7 on PA07 mux B */
#define MUX_ADC_AIN7_PA07B                 1
#define PINMUX_ADC_AIN7_PA07B      ((PIN_ADC_AIN7_PA07B << 16) | MUX_ADC_AIN7_PA07B)
#define PORT_ADC_AIN7_PA07B        (1u <<  7)
#define PIN_ADC_AIN8_PB00B                32  /**< \brief ADC signal: AIN8 on PB00 mux B */
#define MUX_ADC_AIN8_PB00B                 1
#define PINMUX_ADC_AIN8_PB00B      ((PIN_ADC_AIN8_PB00B << 16) | MUX_ADC_AIN8_PB00B)
#define PORT_ADC_AIN8_PB00B        (1u <<  0)
#define PIN_ADC_AIN9_PB01B                33  /**< \brief ADC signal: AIN9 on PB01 mux B */
#define MUX_ADC_AIN9_PB01B                 1
#define PINMUX_ADC_AIN9_PB01B      ((PIN_ADC_AIN9_PB01B << 16) | MUX_ADC_AIN9_PB01B)
#define PORT_ADC_AIN9_PB01B        (1u <<  1)
#define PIN_ADC_AIN10_PB02B               34  /**< \brief ADC signal: AIN10 on PB02 mux B */
#define MUX_ADC_AIN10_PB02B                1
#define PINMUX_ADC_AIN10_PB02B     ((PIN_ADC_AIN10_PB02B << 16) | MUX_ADC_AIN10_PB02B)
#define PORT_ADC_AIN10_PB02B       (1u <<  2)
#define PIN_ADC_AIN11_PB03B               35  /**< \brief ADC signal: AIN11 on PB03 mux B */
#define MUX_ADC_AIN11_PB03B                1
#define PINMUX_ADC_AIN11_PB03B     ((PIN_ADC_AIN11_PB03B << 16) | MUX_ADC_AIN11_PB03B)
#define PORT_ADC_AIN11_PB03B       (1u <<  3)
#define PIN_ADC_AIN12_PB04B               36  /**< \brief ADC signal: AIN12 on PB04 mux B */
#define MUX_ADC_AIN12_PB04B                1
#define PINMUX_ADC_AIN12_PB04B     ((PIN_ADC_AIN12_PB04B << 16) | MUX_ADC_AIN12_PB04B)
#define PORT_ADC_AIN12_PB04B       (1u <<  4)
#define PIN_ADC_AIN13_PB05B               37  /**< \brief ADC signal: AIN13 on PB05 mux B */
#define MUX_ADC_AIN13_PB05B                1
#define PINMUX_ADC_AIN13_PB05B     ((PIN_ADC_AIN13_PB05B << 16) | MUX_ADC_AIN13_PB05B)
#define PORT_ADC_AIN13_PB05B       (1u <<  5)
#define PIN_ADC_AIN14_PB06B               38  /**< \brief ADC signal: AIN14 on PB06 mux B */
#define MUX_ADC_AIN14_PB06B                1
#define PINMUX_ADC_AIN14_PB06B     ((PIN_ADC_AIN14_PB06B << 16) | MUX_ADC_AIN14_PB06B)
#define PORT_ADC_AIN14_PB06B       (1u <<  6)
#define PIN_ADC_AIN15_PB07B               39  /**< \brief ADC signal: AIN15 on PB07 mux B */
#define MUX_ADC_AIN15_PB07B                1
#define PINMUX_ADC_AIN15_PB07B     ((PIN_ADC_AIN15_PB07B << 16) | MUX_ADC_AIN15_PB07B)
#define PORT_ADC_AIN15_PB07B       (1u <<  7)
#define PIN_ADC_AIN16_PA08B                8  /**< \brief ADC signal: AIN16 on PA08 mux B */
#define MUX_ADC_AIN16_PA08B                1
#define PINMUX_ADC_AIN16_PA08B     ((PIN_ADC_AIN16_PA08B << 16) | MUX_ADC_AIN16_PA08B)
#define PORT_ADC_AIN16_PA08B       (1u <<  8)
#define PIN_ADC_AIN17_PA09B                9  /**< \brief ADC signal: AIN17 on PA09 mux B */
#define MUX_ADC_AIN17_PA09B                1
#define PINMUX_ADC_AIN17_PA09B     ((PIN_ADC_AIN17_PA09B << 16) | MUX_ADC_AIN17_PA09B)
#define PORT_ADC_AIN17_PA09B       (1u <<  9)
#define PIN_ADC_AIN18_PA10B               10  /**< \brief ADC signal: AIN18 on PA10 mux B */
#define MUX_ADC_AIN18_PA10B                1
#define PINMUX_ADC_AIN18_PA10B     ((PIN_ADC_AIN18_PA10B << 16) | MUX_ADC_AIN18_PA10B)
#define PORT_ADC_AIN18_PA10B       (1u << 10)
#define PIN_ADC_AIN19_PA11B               11  /**< \brief ADC signal: AIN19 on PA11 mux B */
#define MUX_ADC_AIN19_PA11B                1
#define PINMUX_ADC_AIN19_PA11B     ((PIN_ADC_AIN19_PA11B << 16) | MUX_ADC_AIN19_PA11B)
#define PORT_ADC_AIN19_PA11B       (1u << 11)
#define PIN_ADC_VREFP_PA04B                4  /**< \brief ADC signal: VREFP on PA04 mux B */
#define MUX_ADC_VREFP_PA04B                1
#define PINMUX_ADC_VREFP_PA04B     ((PIN_ADC_VREFP_PA04B << 16) | MUX_ADC_VREFP_PA04B)
#define PORT_ADC_VREFP_PA04B       (1u <<  4)
/* ========== PORT definition for CCL peripheral ========== */
#define PIN_CCL_IN0_PA04I                  4  /**< \brief CCL signal: IN0 on PA04 mux I */
#define MUX_CCL_IN0_PA04I                  8
#define PINMUX_CCL_IN0_PA04I       ((PIN_CCL_IN0_PA04I << 16) | MUX_CCL_IN0_PA04I)
#define PORT_CCL_IN0_PA04I         (1u <<  4)
#define PIN_CCL_IN0_PA16I                 16  /**< \brief CCL signal: IN0 on PA16 mux I */
#define MUX_CCL_IN0_PA16I                  8
#define PINMUX_CCL_IN0_PA16I       ((PIN_CCL_IN0_PA16I << 16) | MUX_CCL_IN0_PA16I)
#define PORT_CCL_IN0_PA16I         (1u << 16)
#define PIN_CCL_IN0_PB22I                 54  /**< \brief CCL signal: IN0 on PB22 mux I */
#define MUX_CCL_IN0_PB22I                  8
#define PINMUX_CCL_IN0_PB22I       ((PIN_CCL_IN0_PB22I << 16) | MUX_CCL_IN0_PB22I)
#define PORT_CCL_IN0_PB22I         (1u << 22)
#define PIN_CCL_IN1_PA05I                  5  /**< \brief CCL signal: IN1 on PA05 mux I */
#define MUX_CCL_IN1_PA05I                  8
#define PINMUX_CCL_IN1_PA05I       ((PIN_CCL_IN1_PA05I << 16) | MUX_CCL_IN1_PA05I)
#define PORT_CCL_IN1_PA05I         (1u <<  5)
#define PIN_CCL_IN1_PA17I                 17  /**< \brief CCL signal: IN1 on PA17 mux I */
#define MUX_CCL_IN1_PA17I                  8
#define PINMUX_CCL_IN1_PA17I       ((PIN_CCL_IN1_PA17I << 16) | MUX_CCL_IN1_PA17I)
#define PORT_CCL_IN1_PA17I         (1u << 17)
#define PIN_CCL_IN1_PB00I                 32  /**< \brief CCL signal: IN1 on PB00 mux I */
#define MUX_CCL_IN1_PB00I                  8
#define PINMUX_CCL_IN1_PB00I       ((PIN_CCL_IN1_PB00I << 16) | MUX_CCL_IN1_PB00I)
#define PORT_CCL_IN1_PB00I         (1u <<  0)
#define PIN_CCL_IN2_PA06I                  6  /**< \brief CCL signal: IN2 on PA06 mux I */
#define MUX_CCL_IN2_PA06I                  8
#define PINMUX_CCL_IN2_PA06I       ((PIN_CCL_IN2_PA06I << 16) | MUX_CCL_IN2_PA06I)
#define PORT_CCL_IN2_PA06I         (1u <<  6)
#define PIN_CCL_IN2_PA18I                 18  /**< \brief CCL signal: IN2 on PA18 mux I */
#define MUX_CCL_IN2_PA18I                  8
#define PINMUX_CCL_IN2_PA18I       ((PIN_CCL_IN2_PA18I << 16) | MUX_CCL_IN2_PA18I)
#define PORT_CCL_IN2_PA18I         (1u << 18)
#define PIN_CCL_IN2_PB01I                 33  /**< \brief CCL signal: IN2 on PB01 mux I */
#define MUX_CCL_IN2_PB01I                  8
#define PINMUX_CCL_IN2_PB01I       ((PIN_CCL_IN2_PB01I << 16) | MUX_CCL_IN2_PB01I)
#define PORT_CCL_IN2_PB01I         (1u <<  1)
#define PIN_CCL_IN3_PA08I                  8  /**< \brief CCL signal: IN3 on PA08 mux I */
#define MUX_CCL_IN3_PA08I                  8
#define PINMUX_CCL_IN3_PA08I       ((PIN_CCL_IN3_PA08I << 16) | MUX_CCL_IN3_PA08I)
#define PORT_CCL_IN3_PA08I         (1u <<  8)
#define PIN_CCL_IN3_PA30I                 30  /**< \brief CCL signal: IN3 on PA30 mux I */
#define MUX_CCL_IN3_PA30I                  8
#define PINMUX_CCL_IN3_PA30I       ((PIN_CCL_IN3_PA30I << 16) | MUX_CCL_IN3_PA30I)
#define PORT_CCL_IN3_PA30I         (1u << 30)
#define PIN_CCL_IN4_PA09I                  9  /**< \brief CCL signal: IN4 on PA09 mux I */
#define MUX_CCL_IN4_PA09I                  8
#define PINMUX_CCL_IN4_PA09I       ((PIN_CCL_IN4_PA09I << 16) | MUX_CCL_IN4_PA09I)
#define PORT_CCL_IN4_PA09I         (1u <<  9)
#define PIN_CCL_IN5_PA10I                 10  /**< \brief CCL signal: IN5 on PA10 mux I */
#define MUX_CCL_IN5_PA10I                  8
#define PINMUX_CCL_IN5_PA10I       ((PIN_CCL_IN5_PA10I << 16) | MUX_CCL_IN5_PA10I)
#define PORT_CCL_IN5_PA10I         (1u << 10)
#define PIN_CCL_IN5_PB10I                 42  /**< \brief CCL signal: IN5 on PB10 mux I */
#define MUX_CCL_IN5_PB10I                  8
#define PINMUX_CCL_IN5_PB10I       ((PIN_CCL_IN5_PB10I << 16) | MUX_CCL_IN5_PB10I)
#define PORT_CCL_IN5_PB10I         (1u << 10)
#define PIN_CCL_IN6_PA22I                 22  /**< \brief CCL signal: IN6 on PA22 mux I */
#define MUX_CCL_IN6_PA22I                  8
#define PINMUX_CCL_IN6_PA22I       ((PIN_CCL_IN6_PA22I << 16) | MUX_CCL_IN6_PA22I)
#define PORT_CCL_IN6_PA22I         (1u << 22)
#define PIN_CCL_IN6_PB06I                 38  /**< \brief CCL signal: IN6 on PB06 mux I */
#define MUX_CCL_IN6_PB06I                  8
#define PINMUX_CCL_IN6_PB06I       ((PIN_CCL_IN6_PB06I << 16) | MUX_CCL_IN6_PB06I)
#define PORT_CCL_IN6_PB06I         (1u <<  6)
#define PIN_CCL_IN7_PA23I                 23  /**< \brief CCL signal: IN7 on PA23 mux I */
#define MUX_CCL_IN7_PA23I                  8
#define PINMUX_CCL_IN7_PA23I       ((PIN_CCL_IN7_PA23I << 16) | MUX_CCL_IN7_PA23I)
#define PORT_CCL_IN7_PA23I         (1u << 23)
#define PIN_CCL_IN7_PB07I                 39  /**< \brief CCL signal: IN7 on PB07 mux I */
#define MUX_CCL_IN7_PB07I                  8
#define PINMUX_CCL_IN7_PB07I       ((PIN_CCL_IN7_PB07I << 16) | MUX_CCL_IN7_PB07I)
#define PORT_CCL_IN7_PB07I         (1u <<  7)
#define PIN_CCL_IN8_PA24I                 24  /**< \brief CCL signal: IN8 on PA24 mux I */
#define MUX_CCL_IN8_PA24I                  8
#define PINMUX_CCL_IN8_PA24I       ((PIN_CCL_IN8_PA24I << 16) | MUX_CCL_IN8_PA24I)
#define PORT_CCL_IN8_PA24I         (1u << 24)
#define PIN_CCL_IN8_PB08I                 40  /**< \brief CCL signal: IN8 on PB08 mux I */
#define MUX_CCL_IN8_PB08I                  8
#define PINMUX_CCL_IN8_PB08I       ((PIN_CCL_IN8_PB08I << 16) | MUX_CCL_IN8_PB08I)
#define PORT_CCL_IN8_PB08I         (1u <<  8)
#define PIN_CCL_IN9_PB14I                 46  /**< \brief CCL signal: IN9 on PB14 mux I */
#define MUX_CCL_IN9_PB14I                  8
#define PINMUX_CCL_IN9_PB14I       ((PIN_CCL_IN9_PB14I << 16) | MUX_CCL_IN9_PB14I)
#define PORT_CCL_IN9_PB14I         (1u << 14)
#define PIN_CCL_IN10_PB15I                47  /**< \brief CCL signal: IN10 on PB15 mux I */
#define MUX_CCL_IN10_PB15I                 8
#define PINMUX_CCL_IN10_PB15I      ((PIN_CCL_IN10_PB15I << 16) | MUX_CCL_IN10_PB15I)
#define PORT_CCL_IN10_PB15I        (1u << 15)
#define PIN_CCL_IN11_PB16I                48  /**< \brief CCL signal: IN11 on PB16 mux I */
#define MUX_CCL_IN11_PB16I                 8
#define PINMUX_CCL_IN11_PB16I      ((PIN_CCL_IN11_PB16I << 16) | MUX_CCL_IN11_PB16I)
#define PORT_CCL_IN11_PB16I        (1u << 16)
#define PIN_CCL_OUT0_PA07I                 7  /**< \brief CCL signal: OUT0 on PA07 mux I */
#define MUX_CCL_OUT0_PA07I                 8
#define PINMUX_CCL_OUT0_PA07I      ((PIN_CCL_OUT0_PA07I << 16) | MUX_CCL_OUT0_PA07I)
#define PORT_CCL_OUT0_PA07I        (1u <<  7)
#define PIN_CCL_OUT0_PA19I                19  /**< \brief CCL signal: OUT0 on PA19 mux I */
#define MUX_CCL_OUT0_PA19I                 8
#define PINMUX_CCL_OUT0_PA19I      ((PIN_CCL_OUT0_PA19I << 16) | MUX_CCL_OUT0_PA19I)
#define PORT_CCL_OUT0_PA19I        (1u << 19)
#define PIN_CCL_OUT0_PB02I                34  /**< \brief CCL signal: OUT0 on PB02 mux I */
#define MUX_CCL_OUT0_PB02I                 8
#define PINMUX_CCL_OUT0_PB02I      ((PIN_CCL_OUT0_PB02I << 16) | MUX_CCL_OUT0_PB02I)
#define PORT_CCL_OUT0_PB02I        (1u <<  2)
#define PIN_CCL_OUT0_PB23I                55  /**< \brief CCL signal: OUT0 on PB23 mux I */
#define MUX_CCL_OUT0_PB23I                 8
