zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define PINMUX_CCL_OUT0_PB23I      ((PIN_CCL_OUT0_PB23I << 16) | MUX_CCL_OUT0_PB23I)
#define PORT_CCL_OUT0_PB23I        (1u << 23)
#define PIN_CCL_OUT1_PA11I                11  /**< \brief CCL signal: OUT1 on PA11 mux I */
#define MUX_CCL_OUT1_PA11I                 8
#define PINMUX_CCL_OUT1_PA11I      ((PIN_CCL_OUT1_PA11I << 16) | MUX_CCL_OUT1_PA11I)
#define PORT_CCL_OUT1_PA11I        (1u << 11)
#define PIN_CCL_OUT1_PA31I                31  /**< \brief CCL signal: OUT1 on PA31 mux I */
#define MUX_CCL_OUT1_PA31I                 8
#define PINMUX_CCL_OUT1_PA31I      ((PIN_CCL_OUT1_PA31I << 16) | MUX_CCL_OUT1_PA31I)
#define PORT_CCL_OUT1_PA31I        (1u << 31)
#define PIN_CCL_OUT1_PB11I                43  /**< \brief CCL signal: OUT1 on PB11 mux I */
#define MUX_CCL_OUT1_PB11I                 8
#define PINMUX_CCL_OUT1_PB11I      ((PIN_CCL_OUT1_PB11I << 16) | MUX_CCL_OUT1_PB11I)
#define PORT_CCL_OUT1_PB11I        (1u << 11)
#define PIN_CCL_OUT2_PA25I                25  /**< \brief CCL signal: OUT2 on PA25 mux I */
#define MUX_CCL_OUT2_PA25I                 8
#define PINMUX_CCL_OUT2_PA25I      ((PIN_CCL_OUT2_PA25I << 16) | MUX_CCL_OUT2_PA25I)
#define PORT_CCL_OUT2_PA25I        (1u << 25)
#define PIN_CCL_OUT2_PB09I                41  /**< \brief CCL signal: OUT2 on PB09 mux I */
#define MUX_CCL_OUT2_PB09I                 8
#define PINMUX_CCL_OUT2_PB09I      ((PIN_CCL_OUT2_PB09I << 16) | MUX_CCL_OUT2_PB09I)
#define PORT_CCL_OUT2_PB09I        (1u <<  9)
#define PIN_CCL_OUT3_PB17I                49  /**< \brief CCL signal: OUT3 on PB17 mux I */
#define MUX_CCL_OUT3_PB17I                 8
#define PINMUX_CCL_OUT3_PB17I      ((PIN_CCL_OUT3_PB17I << 16) | MUX_CCL_OUT3_PB17I)
#define PORT_CCL_OUT3_PB17I        (1u << 17)
/* ========== PORT definition for CM0P peripheral ========== */
#define PIN_CM0P_SWCLK_PA30G              30  /**< \brief CM0P signal: SWCLK on PA30 mux G */
#define MUX_CM0P_SWCLK_PA30G               6
#define PINMUX_CM0P_SWCLK_PA30G    ((PIN_CM0P_SWCLK_PA30G << 16) | MUX_CM0P_SWCLK_PA30G)
#define PORT_CM0P_SWCLK_PA30G      (1u << 30)
/* ========== PORT definition for DAC peripheral ========== */
#define PIN_DAC_VOUT0_PA02B                2  /**< \brief DAC signal: VOUT0 on PA02 mux B */
#define MUX_DAC_VOUT0_PA02B                1
#define PINMUX_DAC_VOUT0_PA02B     ((PIN_DAC_VOUT0_PA02B << 16) | MUX_DAC_VOUT0_PA02B)
#define PORT_DAC_VOUT0_PA02B       (1u <<  2)
#define PIN_DAC_VOUT1_PA05B                5  /**< \brief DAC signal: VOUT1 on PA05 mux B */
#define MUX_DAC_VOUT1_PA05B                1
#define PINMUX_DAC_VOUT1_PA05B     ((PIN_DAC_VOUT1_PA05B << 16) | MUX_DAC_VOUT1_PA05B)
#define PORT_DAC_VOUT1_PA05B       (1u <<  5)
#define PIN_DAC_VREFP_PA03B                3  /**< \brief DAC signal: VREFP on PA03 mux B */
#define MUX_DAC_VREFP_PA03B                1
#define PINMUX_DAC_VREFP_PA03B     ((PIN_DAC_VREFP_PA03B << 16) | MUX_DAC_VREFP_PA03B)
#define PORT_DAC_VREFP_PA03B       (1u <<  3)
/* ========== PORT definition for EIC peripheral ========== */
#define PIN_EIC_EXTINT0_PA16A             16  /**< \brief EIC signal: EXTINT0 on PA16 mux A */
#define MUX_EIC_EXTINT0_PA16A              0
#define PINMUX_EIC_EXTINT0_PA16A   ((PIN_EIC_EXTINT0_PA16A << 16) | MUX_EIC_EXTINT0_PA16A)
#define PORT_EIC_EXTINT0_PA16A     (1u << 16)
#define PIN_EIC_EXTINT0_PB00A             32  /**< \brief EIC signal: EXTINT0 on PB00 mux A */
#define MUX_EIC_EXTINT0_PB00A              0
#define PINMUX_EIC_EXTINT0_PB00A   ((PIN_EIC_EXTINT0_PB00A << 16) | MUX_EIC_EXTINT0_PB00A)
#define PORT_EIC_EXTINT0_PB00A     (1u <<  0)
#define PIN_EIC_EXTINT0_PB16A             48  /**< \brief EIC signal: EXTINT0 on PB16 mux A */
#define MUX_EIC_EXTINT0_PB16A              0
#define PINMUX_EIC_EXTINT0_PB16A   ((PIN_EIC_EXTINT0_PB16A << 16) | MUX_EIC_EXTINT0_PB16A)
#define PORT_EIC_EXTINT0_PB16A     (1u << 16)
#define PIN_EIC_EXTINT0_PA00A              0  /**< \brief EIC signal: EXTINT0 on PA00 mux A */
#define MUX_EIC_EXTINT0_PA00A              0
#define PINMUX_EIC_EXTINT0_PA00A   ((PIN_EIC_EXTINT0_PA00A << 16) | MUX_EIC_EXTINT0_PA00A)
#define PORT_EIC_EXTINT0_PA00A     (1u <<  0)
#define PIN_EIC_EXTINT1_PA17A             17  /**< \brief EIC signal: EXTINT1 on PA17 mux A */
#define MUX_EIC_EXTINT1_PA17A              0
#define PINMUX_EIC_EXTINT1_PA17A   ((PIN_EIC_EXTINT1_PA17A << 16) | MUX_EIC_EXTINT1_PA17A)
#define PORT_EIC_EXTINT1_PA17A     (1u << 17)
#define PIN_EIC_EXTINT1_PB01A             33  /**< \brief EIC signal: EXTINT1 on PB01 mux A */
#define MUX_EIC_EXTINT1_PB01A              0
#define PINMUX_EIC_EXTINT1_PB01A   ((PIN_EIC_EXTINT1_PB01A << 16) | MUX_EIC_EXTINT1_PB01A)
#define PORT_EIC_EXTINT1_PB01A     (1u <<  1)
#define PIN_EIC_EXTINT1_PB17A             49  /**< \brief EIC signal: EXTINT1 on PB17 mux A */
#define MUX_EIC_EXTINT1_PB17A              0
#define PINMUX_EIC_EXTINT1_PB17A   ((PIN_EIC_EXTINT1_PB17A << 16) | MUX_EIC_EXTINT1_PB17A)
#define PORT_EIC_EXTINT1_PB17A     (1u << 17)
#define PIN_EIC_EXTINT1_PA01A              1  /**< \brief EIC signal: EXTINT1 on PA01 mux A */
#define MUX_EIC_EXTINT1_PA01A              0
#define PINMUX_EIC_EXTINT1_PA01A   ((PIN_EIC_EXTINT1_PA01A << 16) | MUX_EIC_EXTINT1_PA01A)
#define PORT_EIC_EXTINT1_PA01A     (1u <<  1)
#define PIN_EIC_EXTINT2_PA02A              2  /**< \brief EIC signal: EXTINT2 on PA02 mux A */
#define MUX_EIC_EXTINT2_PA02A              0
#define PINMUX_EIC_EXTINT2_PA02A   ((PIN_EIC_EXTINT2_PA02A << 16) | MUX_EIC_EXTINT2_PA02A)
#define PORT_EIC_EXTINT2_PA02A     (1u <<  2)
#define PIN_EIC_EXTINT2_PA18A             18  /**< \brief EIC signal: EXTINT2 on PA18 mux A */
#define MUX_EIC_EXTINT2_PA18A              0
#define PINMUX_EIC_EXTINT2_PA18A   ((PIN_EIC_EXTINT2_PA18A << 16) | MUX_EIC_EXTINT2_PA18A)
#define PORT_EIC_EXTINT2_PA18A     (1u << 18)
#define PIN_EIC_EXTINT2_PB02A             34  /**< \brief EIC signal: EXTINT2 on PB02 mux A */
#define MUX_EIC_EXTINT2_PB02A              0
#define PINMUX_EIC_EXTINT2_PB02A   ((PIN_EIC_EXTINT2_PB02A << 16) | MUX_EIC_EXTINT2_PB02A)
#define PORT_EIC_EXTINT2_PB02A     (1u <<  2)
#define PIN_EIC_EXTINT3_PA03A              3  /**< \brief EIC signal: EXTINT3 on PA03 mux A */
#define MUX_EIC_EXTINT3_PA03A              0
#define PINMUX_EIC_EXTINT3_PA03A   ((PIN_EIC_EXTINT3_PA03A << 16) | MUX_EIC_EXTINT3_PA03A)
#define PORT_EIC_EXTINT3_PA03A     (1u <<  3)
#define PIN_EIC_EXTINT3_PA19A             19  /**< \brief EIC signal: EXTINT3 on PA19 mux A */
#define MUX_EIC_EXTINT3_PA19A              0
#define PINMUX_EIC_EXTINT3_PA19A   ((PIN_EIC_EXTINT3_PA19A << 16) | MUX_EIC_EXTINT3_PA19A)
#define PORT_EIC_EXTINT3_PA19A     (1u << 19)
#define PIN_EIC_EXTINT3_PB03A             35  /**< \brief EIC signal: EXTINT3 on PB03 mux A */
#define MUX_EIC_EXTINT3_PB03A              0
#define PINMUX_EIC_EXTINT3_PB03A   ((PIN_EIC_EXTINT3_PB03A << 16) | MUX_EIC_EXTINT3_PB03A)
#define PORT_EIC_EXTINT3_PB03A     (1u <<  3)
#define PIN_EIC_EXTINT4_PA04A              4  /**< \brief EIC signal: EXTINT4 on PA04 mux A */
#define MUX_EIC_EXTINT4_PA04A              0
#define PINMUX_EIC_EXTINT4_PA04A   ((PIN_EIC_EXTINT4_PA04A << 16) | MUX_EIC_EXTINT4_PA04A)
#define PORT_EIC_EXTINT4_PA04A     (1u <<  4)
#define PIN_EIC_EXTINT4_PA20A             20  /**< \brief EIC signal: EXTINT4 on PA20 mux A */
#define MUX_EIC_EXTINT4_PA20A              0
#define PINMUX_EIC_EXTINT4_PA20A   ((PIN_EIC_EXTINT4_PA20A << 16) | MUX_EIC_EXTINT4_PA20A)
#define PORT_EIC_EXTINT4_PA20A     (1u << 20)
#define PIN_EIC_EXTINT4_PB04A             36  /**< \brief EIC signal: EXTINT4 on PB04 mux A */
#define MUX_EIC_EXTINT4_PB04A              0
#define PINMUX_EIC_EXTINT4_PB04A   ((PIN_EIC_EXTINT4_PB04A << 16) | MUX_EIC_EXTINT4_PB04A)
#define PORT_EIC_EXTINT4_PB04A     (1u <<  4)
#define PIN_EIC_EXTINT5_PA05A              5  /**< \brief EIC signal: EXTINT5 on PA05 mux A */
#define MUX_EIC_EXTINT5_PA05A              0
#define PINMUX_EIC_EXTINT5_PA05A   ((PIN_EIC_EXTINT5_PA05A << 16) | MUX_EIC_EXTINT5_PA05A)
#define PORT_EIC_EXTINT5_PA05A     (1u <<  5)
#define PIN_EIC_EXTINT5_PA21A             21  /**< \brief EIC signal: EXTINT5 on PA21 mux A */
#define MUX_EIC_EXTINT5_PA21A              0
#define PINMUX_EIC_EXTINT5_PA21A   ((PIN_EIC_EXTINT5_PA21A << 16) | MUX_EIC_EXTINT5_PA21A)
#define PORT_EIC_EXTINT5_PA21A     (1u << 21)
#define PIN_EIC_EXTINT5_PB05A             37  /**< \brief EIC signal: EXTINT5 on PB05 mux A */
#define MUX_EIC_EXTINT5_PB05A              0
#define PINMUX_EIC_EXTINT5_PB05A   ((PIN_EIC_EXTINT5_PB05A << 16) | MUX_EIC_EXTINT5_PB05A)
#define PORT_EIC_EXTINT5_PB05A     (1u <<  5)
#define PIN_EIC_EXTINT6_PA06A              6  /**< \brief EIC signal: EXTINT6 on PA06 mux A */
#define MUX_EIC_EXTINT6_PA06A              0
#define PINMUX_EIC_EXTINT6_PA06A   ((PIN_EIC_EXTINT6_PA06A << 16) | MUX_EIC_EXTINT6_PA06A)
#define PORT_EIC_EXTINT6_PA06A     (1u <<  6)
#define PIN_EIC_EXTINT6_PA22A             22  /**< \brief EIC signal: EXTINT6 on PA22 mux A */
#define MUX_EIC_EXTINT6_PA22A              0
#define PINMUX_EIC_EXTINT6_PA22A   ((PIN_EIC_EXTINT6_PA22A << 16) | MUX_EIC_EXTINT6_PA22A)
#define PORT_EIC_EXTINT6_PA22A     (1u << 22)
#define PIN_EIC_EXTINT6_PB06A             38  /**< \brief EIC signal: EXTINT6 on PB06 mux A */
#define MUX_EIC_EXTINT6_PB06A              0
#define PINMUX_EIC_EXTINT6_PB06A   ((PIN_EIC_EXTINT6_PB06A << 16) | MUX_EIC_EXTINT6_PB06A)
#define PORT_EIC_EXTINT6_PB06A     (1u <<  6)
#define PIN_EIC_EXTINT6_PB22A             54  /**< \brief EIC signal: EXTINT6 on PB22 mux A */
#define MUX_EIC_EXTINT6_PB22A              0
#define PINMUX_EIC_EXTINT6_PB22A   ((PIN_EIC_EXTINT6_PB22A << 16) | MUX_EIC_EXTINT6_PB22A)
#define PORT_EIC_EXTINT6_PB22A     (1u << 22)
#define PIN_EIC_EXTINT7_PA07A              7  /**< \brief EIC signal: EXTINT7 on PA07 mux A */
#define MUX_EIC_EXTINT7_PA07A              0
#define PINMUX_EIC_EXTINT7_PA07A   ((PIN_EIC_EXTINT7_PA07A << 16) | MUX_EIC_EXTINT7_PA07A)
#define PORT_EIC_EXTINT7_PA07A     (1u <<  7)
#define PIN_EIC_EXTINT7_PA23A             23  /**< \brief EIC signal: EXTINT7 on PA23 mux A */
#define MUX_EIC_EXTINT7_PA23A              0
#define PINMUX_EIC_EXTINT7_PA23A   ((PIN_EIC_EXTINT7_PA23A << 16) | MUX_EIC_EXTINT7_PA23A)
#define PORT_EIC_EXTINT7_PA23A     (1u << 23)
#define PIN_EIC_EXTINT7_PB07A             39  /**< \brief EIC signal: EXTINT7 on PB07 mux A */
#define MUX_EIC_EXTINT7_PB07A              0
#define PINMUX_EIC_EXTINT7_PB07A   ((PIN_EIC_EXTINT7_PB07A << 16) | MUX_EIC_EXTINT7_PB07A)
#define PORT_EIC_EXTINT7_PB07A     (1u <<  7)
#define PIN_EIC_EXTINT7_PB23A             55  /**< \brief EIC signal: EXTINT7 on PB23 mux A */
#define MUX_EIC_EXTINT7_PB23A              0
#define PINMUX_EIC_EXTINT7_PB23A   ((PIN_EIC_EXTINT7_PB23A << 16) | MUX_EIC_EXTINT7_PB23A)
#define PORT_EIC_EXTINT7_PB23A     (1u << 23)
#define PIN_EIC_EXTINT8_PB08A             40  /**< \brief EIC signal: EXTINT8 on PB08 mux A */
#define MUX_EIC_EXTINT8_PB08A              0
#define PINMUX_EIC_EXTINT8_PB08A   ((PIN_EIC_EXTINT8_PB08A << 16) | MUX_EIC_EXTINT8_PB08A)
#define PORT_EIC_EXTINT8_PB08A     (1u <<  8)
#define PIN_EIC_EXTINT8_PA28A             28  /**< \brief EIC signal: EXTINT8 on PA28 mux A */
#define MUX_EIC_EXTINT8_PA28A              0
#define PINMUX_EIC_EXTINT8_PA28A   ((PIN_EIC_EXTINT8_PA28A << 16) | MUX_EIC_EXTINT8_PA28A)
#define PORT_EIC_EXTINT8_PA28A     (1u << 28)
#define PIN_EIC_EXTINT9_PA09A              9  /**< \brief EIC signal: EXTINT9 on PA09 mux A */
#define MUX_EIC_EXTINT9_PA09A              0
#define PINMUX_EIC_EXTINT9_PA09A   ((PIN_EIC_EXTINT9_PA09A << 16) | MUX_EIC_EXTINT9_PA09A)
#define PORT_EIC_EXTINT9_PA09A     (1u <<  9)
#define PIN_EIC_EXTINT9_PB09A             41  /**< \brief EIC signal: EXTINT9 on PB09 mux A */
#define MUX_EIC_EXTINT9_PB09A              0
#define PINMUX_EIC_EXTINT9_PB09A   ((PIN_EIC_EXTINT9_PB09A << 16) | MUX_EIC_EXTINT9_PB09A)
#define PORT_EIC_EXTINT9_PB09A     (1u <<  9)
#define PIN_EIC_EXTINT10_PA10A            10  /**< \brief EIC signal: EXTINT10 on PA10 mux A */
#define MUX_EIC_EXTINT10_PA10A             0
#define PINMUX_EIC_EXTINT10_PA10A  ((PIN_EIC_EXTINT10_PA10A << 16) | MUX_EIC_EXTINT10_PA10A)
#define PORT_EIC_EXTINT10_PA10A    (1u << 10)
#define PIN_EIC_EXTINT10_PA30A            30  /**< \brief EIC signal: EXTINT10 on PA30 mux A */
#define MUX_EIC_EXTINT10_PA30A             0
#define PINMUX_EIC_EXTINT10_PA30A  ((PIN_EIC_EXTINT10_PA30A << 16) | MUX_EIC_EXTINT10_PA30A)
#define PORT_EIC_EXTINT10_PA30A    (1u << 30)
#define PIN_EIC_EXTINT10_PB10A            42  /**< \brief EIC signal: EXTINT10 on PB10 mux A */
#define MUX_EIC_EXTINT10_PB10A             0
#define PINMUX_EIC_EXTINT10_PB10A  ((PIN_EIC_EXTINT10_PB10A << 16) | MUX_EIC_EXTINT10_PB10A)
#define PORT_EIC_EXTINT10_PB10A    (1u << 10)
#define PIN_EIC_EXTINT11_PA11A            11  /**< \brief EIC signal: EXTINT11 on PA11 mux A */
#define MUX_EIC_EXTINT11_PA11A             0
#define PINMUX_EIC_EXTINT11_PA11A  ((PIN_EIC_EXTINT11_PA11A << 16) | MUX_EIC_EXTINT11_PA11A)
#define PORT_EIC_EXTINT11_PA11A    (1u << 11)
#define PIN_EIC_EXTINT11_PA31A            31  /**< \brief EIC signal: EXTINT11 on PA31 mux A */
#define MUX_EIC_EXTINT11_PA31A             0
#define PINMUX_EIC_EXTINT11_PA31A  ((PIN_EIC_EXTINT11_PA31A << 16) | MUX_EIC_EXTINT11_PA31A)
#define PORT_EIC_EXTINT11_PA31A    (1u << 31)
#define PIN_EIC_EXTINT11_PB11A            43  /**< \brief EIC signal: EXTINT11 on PB11 mux A */
#define MUX_EIC_EXTINT11_PB11A             0
#define PINMUX_EIC_EXTINT11_PB11A  ((PIN_EIC_EXTINT11_PB11A << 16) | MUX_EIC_EXTINT11_PB11A)
#define PORT_EIC_EXTINT11_PB11A    (1u << 11)
#define PIN_EIC_EXTINT12_PA12A            12  /**< \brief EIC signal: EXTINT12 on PA12 mux A */
#define MUX_EIC_EXTINT12_PA12A             0
#define PINMUX_EIC_EXTINT12_PA12A  ((PIN_EIC_EXTINT12_PA12A << 16) | MUX_EIC_EXTINT12_PA12A)
#define PORT_EIC_EXTINT12_PA12A    (1u << 12)
#define PIN_EIC_EXTINT12_PA24A            24  /**< \brief EIC signal: EXTINT12 on PA24 mux A */
#define MUX_EIC_EXTINT12_PA24A             0
#define PINMUX_EIC_EXTINT12_PA24A  ((PIN_EIC_EXTINT12_PA24A << 16) | MUX_EIC_EXTINT12_PA24A)
#define PORT_EIC_EXTINT12_PA24A    (1u << 24)
#define PIN_EIC_EXTINT12_PB12A            44  /**< \brief EIC signal: EXTINT12 on PB12 mux A */
#define MUX_EIC_EXTINT12_PB12A             0
#define PINMUX_EIC_EXTINT12_PB12A  ((PIN_EIC_EXTINT12_PB12A << 16) | MUX_EIC_EXTINT12_PB12A)
#define PORT_EIC_EXTINT12_PB12A    (1u << 12)
#define PIN_EIC_EXTINT13_PA13A            13  /**< \brief EIC signal: EXTINT13 on PA13 mux A */
#define MUX_EIC_EXTINT13_PA13A             0
#define PINMUX_EIC_EXTINT13_PA13A  ((PIN_EIC_EXTINT13_PA13A << 16) | MUX_EIC_EXTINT13_PA13A)
#define PORT_EIC_EXTINT13_PA13A    (1u << 13)
#define PIN_EIC_EXTINT13_PA25A            25  /**< \brief EIC signal: EXTINT13 on PA25 mux A */
#define MUX_EIC_EXTINT13_PA25A             0
#define PINMUX_EIC_EXTINT13_PA25A  ((PIN_EIC_EXTINT13_PA25A << 16) | MUX_EIC_EXTINT13_PA25A)
#define PORT_EIC_EXTINT13_PA25A    (1u << 25)
#define PIN_EIC_EXTINT13_PB13A            45  /**< \brief EIC signal: EXTINT13 on PB13 mux A */
#define MUX_EIC_EXTINT13_PB13A             0
#define PINMUX_EIC_EXTINT13_PB13A  ((PIN_EIC_EXTINT13_PB13A << 16) | MUX_EIC_EXTINT13_PB13A)
#define PORT_EIC_EXTINT13_PB13A    (1u << 13)
#define PIN_EIC_EXTINT14_PB14A            46  /**< \brief EIC signal: EXTINT14 on PB14 mux A */
#define MUX_EIC_EXTINT14_PB14A             0
#define PINMUX_EIC_EXTINT14_PB14A  ((PIN_EIC_EXTINT14_PB14A << 16) | MUX_EIC_EXTINT14_PB14A)
#define PORT_EIC_EXTINT14_PB14A    (1u << 14)
#define PIN_EIC_EXTINT14_PB30A            62  /**< \brief EIC signal: EXTINT14 on PB30 mux A */
#define MUX_EIC_EXTINT14_PB30A             0
#define PINMUX_EIC_EXTINT14_PB30A  ((PIN_EIC_EXTINT14_PB30A << 16) | MUX_EIC_EXTINT14_PB30A)
#define PORT_EIC_EXTINT14_PB30A    (1u << 30)
#define PIN_EIC_EXTINT14_PA14A            14  /**< \brief EIC signal: EXTINT14 on PA14 mux A */
#define MUX_EIC_EXTINT14_PA14A             0
#define PINMUX_EIC_EXTINT14_PA14A  ((PIN_EIC_EXTINT14_PA14A << 16) | MUX_EIC_EXTINT14_PA14A)
#define PORT_EIC_EXTINT14_PA14A    (1u << 14)
#define PIN_EIC_EXTINT15_PA27A            27  /**< \brief EIC signal: EXTINT15 on PA27 mux A */
#define MUX_EIC_EXTINT15_PA27A             0
#define PINMUX_EIC_EXTINT15_PA27A  ((PIN_EIC_EXTINT15_PA27A << 16) | MUX_EIC_EXTINT15_PA27A)
#define PORT_EIC_EXTINT15_PA27A    (1u << 27)
#define PIN_EIC_EXTINT15_PB15A            47  /**< \brief EIC signal: EXTINT15 on PB15 mux A */
#define MUX_EIC_EXTINT15_PB15A             0
#define PINMUX_EIC_EXTINT15_PB15A  ((PIN_EIC_EXTINT15_PB15A << 16) | MUX_EIC_EXTINT15_PB15A)
#define PORT_EIC_EXTINT15_PB15A    (1u << 15)
#define PIN_EIC_EXTINT15_PB31A            63  /**< \brief EIC signal: EXTINT15 on PB31 mux A */
#define MUX_EIC_EXTINT15_PB31A             0
#define PINMUX_EIC_EXTINT15_PB31A  ((PIN_EIC_EXTINT15_PB31A << 16) | MUX_EIC_EXTINT15_PB31A)
#define PORT_EIC_EXTINT15_PB31A    (1u << 31)
#define PIN_EIC_EXTINT15_PA15A            15  /**< \brief EIC signal: EXTINT15 on PA15 mux A */
#define MUX_EIC_EXTINT15_PA15A             0
#define PINMUX_EIC_EXTINT15_PA15A  ((PIN_EIC_EXTINT15_PA15A << 16) | MUX_EIC_EXTINT15_PA15A)
#define PORT_EIC_EXTINT15_PA15A    (1u << 15)
#define PIN_EIC_NMI_PA08A                  8  /**< \brief EIC signal: NMI on PA08 mux A */
#define MUX_EIC_NMI_PA08A                  0
#define PINMUX_EIC_NMI_PA08A       ((PIN_EIC_NMI_PA08A << 16) | MUX_EIC_NMI_PA08A)
#define PORT_EIC_NMI_PA08A         (1u <<  8)
/* ========== PORT definition for GCLK peripheral ========== */
#define PIN_GCLK_IO0_PB14H                46  /**< \brief GCLK signal: IO0 on PB14 mux H */
#define MUX_GCLK_IO0_PB14H                 7
#define PINMUX_GCLK_IO0_PB14H      ((PIN_GCLK_IO0_PB14H << 16) | MUX_GCLK_IO0_PB14H)
#define PORT_GCLK_IO0_PB14H        (1u << 14)
#define PIN_GCLK_IO0_PB22H                54  /**< \brief GCLK signal: IO0 on PB22 mux H */
#define MUX_GCLK_IO0_PB22H                 7
#define PINMUX_GCLK_IO0_PB22H      ((PIN_GCLK_IO0_PB22H << 16) | MUX_GCLK_IO0_PB22H)
#define PORT_GCLK_IO0_PB22H        (1u << 22)
#define PIN_GCLK_IO0_PA14H                14  /**< \brief GCLK signal: IO0 on PA14 mux H */
#define MUX_GCLK_IO0_PA14H                 7
#define PINMUX_GCLK_IO0_PA14H      ((PIN_GCLK_IO0_PA14H << 16) | MUX_GCLK_IO0_PA14H)
#define PORT_GCLK_IO0_PA14H        (1u << 14)
#define PIN_GCLK_IO0_PA27H                27  /**< \brief GCLK signal: IO0 on PA27 mux H */
#define MUX_GCLK_IO0_PA27H                 7
#define PINMUX_GCLK_IO0_PA27H      ((PIN_GCLK_IO0_PA27H << 16) | MUX_GCLK_IO0_PA27H)
#define PORT_GCLK_IO0_PA27H        (1u << 27)
#define PIN_GCLK_IO0_PA30H                30  /**< \brief GCLK signal: IO0 on PA30 mux H */
#define MUX_GCLK_IO0_PA30H                 7
#define PINMUX_GCLK_IO0_PA30H      ((PIN_GCLK_IO0_PA30H << 16) | MUX_GCLK_IO0_PA30H)
#define PORT_GCLK_IO0_PA30H        (1u << 30)
#define PIN_GCLK_IO0_PA28H                28  /**< \brief GCLK signal: IO0 on PA28 mux H */
#define MUX_GCLK_IO0_PA28H                 7
#define PINMUX_GCLK_IO0_PA28H      ((PIN_GCLK_IO0_PA28H << 16) | MUX_GCLK_IO0_PA28H)
#define PORT_GCLK_IO0_PA28H        (1u << 28)
#define PIN_GCLK_IO1_PB15H                47  /**< \brief GCLK signal: IO1 on PB15 mux H */
#define MUX_GCLK_IO1_PB15H                 7
#define PINMUX_GCLK_IO1_PB15H      ((PIN_GCLK_IO1_PB15H << 16) | MUX_GCLK_IO1_PB15H)
#define PORT_GCLK_IO1_PB15H        (1u << 15)
#define PIN_GCLK_IO1_PB23H                55  /**< \brief GCLK signal: IO1 on PB23 mux H */
#define MUX_GCLK_IO1_PB23H                 7
#define PINMUX_GCLK_IO1_PB23H      ((PIN_GCLK_IO1_PB23H << 16) | MUX_GCLK_IO1_PB23H)
#define PORT_GCLK_IO1_PB23H        (1u << 23)
#define PIN_GCLK_IO1_PA15H                15  /**< \brief GCLK signal: IO1 on PA15 mux H */
#define MUX_GCLK_IO1_PA15H                 7
#define PINMUX_GCLK_IO1_PA15H      ((PIN_GCLK_IO1_PA15H << 16) | MUX_GCLK_IO1_PA15H)
#define PORT_GCLK_IO1_PA15H        (1u << 15)
#define PIN_GCLK_IO1_PC16F                80  /**< \brief GCLK signal: IO1 on PC16 mux F */
#define MUX_GCLK_IO1_PC16F                 5
#define PINMUX_GCLK_IO1_PC16F      ((PIN_GCLK_IO1_PC16F << 16) | MUX_GCLK_IO1_PC16F)
#define PORT_GCLK_IO1_PC16F        (1u << 16)
#define PIN_GCLK_IO2_PB16H                48  /**< \brief GCLK signal: IO2 on PB16 mux H */
#define MUX_GCLK_IO2_PB16H                 7
#define PINMUX_GCLK_IO2_PB16H      ((PIN_GCLK_IO2_PB16H << 16) | MUX_GCLK_IO2_PB16H)
#define PORT_GCLK_IO2_PB16H        (1u << 16)
#define PIN_GCLK_IO2_PA16H                16  /**< \brief GCLK signal: IO2 on PA16 mux H */
#define MUX_GCLK_IO2_PA16H                 7
#define PINMUX_GCLK_IO2_PA16H      ((PIN_GCLK_IO2_PA16H << 16) | MUX_GCLK_IO2_PA16H)
#define PORT_GCLK_IO2_PA16H        (1u << 16)
#define PIN_GCLK_IO3_PA17H                17  /**< \brief GCLK signal: IO3 on PA17 mux H */
#define MUX_GCLK_IO3_PA17H                 7
#define PINMUX_GCLK_IO3_PA17H      ((PIN_GCLK_IO3_PA17H << 16) | MUX_GCLK_IO3_PA17H)
#define PORT_GCLK_IO3_PA17H        (1u << 17)
#define PIN_GCLK_IO3_PB17H                49  /**< \brief GCLK signal: IO3 on PB17 mux H */
#define MUX_GCLK_IO3_PB17H                 7
#define PINMUX_GCLK_IO3_PB17H      ((PIN_GCLK_IO3_PB17H << 16) | MUX_GCLK_IO3_PB17H)
#define PORT_GCLK_IO3_PB17H        (1u << 17)
#define PIN_GCLK_IO4_PA10H                10  /**< \brief GCLK signal: IO4 on PA10 mux H */
#define MUX_GCLK_IO4_PA10H                 7
#define PINMUX_GCLK_IO4_PA10H      ((PIN_GCLK_IO4_PA10H << 16) | MUX_GCLK_IO4_PA10H)
#define PORT_GCLK_IO4_PA10H        (1u << 10)
#define PIN_GCLK_IO4_PA20H                20  /**< \brief GCLK signal: IO4 on PA20 mux H */
#define MUX_GCLK_IO4_PA20H                 7
#define PINMUX_GCLK_IO4_PA20H      ((PIN_GCLK_IO4_PA20H << 16) | MUX_GCLK_IO4_PA20H)
#define PORT_GCLK_IO4_PA20H        (1u << 20)
#define PIN_GCLK_IO4_PB10H                42  /**< \brief GCLK signal: IO4 on PB10 mux H */
#define MUX_GCLK_IO4_PB10H                 7
#define PINMUX_GCLK_IO4_PB10H      ((PIN_GCLK_IO4_PB10H << 16) | MUX_GCLK_IO4_PB10H)
#define PORT_GCLK_IO4_PB10H        (1u << 10)
#define PIN_GCLK_IO5_PA11H                11  /**< \brief GCLK signal: IO5 on PA11 mux H */
#define MUX_GCLK_IO5_PA11H                 7
#define PINMUX_GCLK_IO5_PA11H      ((PIN_GCLK_IO5_PA11H << 16) | MUX_GCLK_IO5_PA11H)
#define PORT_GCLK_IO5_PA11H        (1u << 11)
#define PIN_GCLK_IO5_PA21H                21  /**< \brief GCLK signal: IO5 on PA21 mux H */
#define MUX_GCLK_IO5_PA21H                 7
#define PINMUX_GCLK_IO5_PA21H      ((PIN_GCLK_IO5_PA21H << 16) | MUX_GCLK_IO5_PA21H)
#define PORT_GCLK_IO5_PA21H        (1u << 21)
#define PIN_GCLK_IO5_PB11H                43  /**< \brief GCLK signal: IO5 on PB11 mux H */
#define MUX_GCLK_IO5_PB11H                 7
#define PINMUX_GCLK_IO5_PB11H      ((PIN_GCLK_IO5_PB11H << 16) | MUX_GCLK_IO5_PB11H)
#define PORT_GCLK_IO5_PB11H        (1u << 11)
#define PIN_GCLK_IO6_PA22H                22  /**< \brief GCLK signal: IO6 on PA22 mux H */
#define MUX_GCLK_IO6_PA22H                 7
#define PINMUX_GCLK_IO6_PA22H      ((PIN_GCLK_IO6_PA22H << 16) | MUX_GCLK_IO6_PA22H)
#define PORT_GCLK_IO6_PA22H        (1u << 22)
#define PIN_GCLK_IO6_PB12H                44  /**< \brief GCLK signal: IO6 on PB12 mux H */
#define MUX_GCLK_IO6_PB12H                 7
#define PINMUX_GCLK_IO6_PB12H      ((PIN_GCLK_IO6_PB12H << 16) | MUX_GCLK_IO6_PB12H)
#define PORT_GCLK_IO6_PB12H        (1u << 12)
#define PIN_GCLK_IO7_PA23H                23  /**< \brief GCLK signal: IO7 on PA23 mux H */
#define MUX_GCLK_IO7_PA23H                 7
#define PINMUX_GCLK_IO7_PA23H      ((PIN_GCLK_IO7_PA23H << 16) | MUX_GCLK_IO7_PA23H)
#define PORT_GCLK_IO7_PA23H        (1u << 23)
#define PIN_GCLK_IO7_PB13H                45  /**< \brief GCLK signal: IO7 on PB13 mux H */
#define MUX_GCLK_IO7_PB13H                 7
#define PINMUX_GCLK_IO7_PB13H      ((PIN_GCLK_IO7_PB13H << 16) | MUX_GCLK_IO7_PB13H)
#define PORT_GCLK_IO7_PB13H        (1u << 13)
