zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
/* ========== PORT definition for OPAMP peripheral ========== */
#define PIN_OPAMP_OANEG0_PA02B             2  /**< \brief OPAMP signal: OANEG0 on PA02 mux B */
#define MUX_OPAMP_OANEG0_PA02B             1
#define PINMUX_OPAMP_OANEG0_PA02B  ((PIN_OPAMP_OANEG0_PA02B << 16) | MUX_OPAMP_OANEG0_PA02B)
#define PORT_OPAMP_OANEG0_PA02B    (1u <<  2)
#define PIN_OPAMP_OANEG1_PB05B            37  /**< \brief OPAMP signal: OANEG1 on PB05 mux B */
#define MUX_OPAMP_OANEG1_PB05B             1
#define PINMUX_OPAMP_OANEG1_PB05B  ((PIN_OPAMP_OANEG1_PB05B << 16) | MUX_OPAMP_OANEG1_PB05B)
#define PORT_OPAMP_OANEG1_PB05B    (1u <<  5)
#define PIN_OPAMP_OANEG2_PB08B            40  /**< \brief OPAMP signal: OANEG2 on PB08 mux B */
#define MUX_OPAMP_OANEG2_PB08B             1
#define PINMUX_OPAMP_OANEG2_PB08B  ((PIN_OPAMP_OANEG2_PB08B << 16) | MUX_OPAMP_OANEG2_PB08B)
#define PORT_OPAMP_OANEG2_PB08B    (1u <<  8)
#define PIN_OPAMP_OAOUT0_PA07B             7  /**< \brief OPAMP signal: OAOUT0 on PA07 mux B */
#define MUX_OPAMP_OAOUT0_PA07B             1
#define PINMUX_OPAMP_OAOUT0_PA07B  ((PIN_OPAMP_OAOUT0_PA07B << 16) | MUX_OPAMP_OAOUT0_PA07B)
#define PORT_OPAMP_OAOUT0_PA07B    (1u <<  7)
#define PIN_OPAMP_OAOUT1_PB06B            38  /**< \brief OPAMP signal: OAOUT1 on PB06 mux B */
#define MUX_OPAMP_OAOUT1_PB06B             1
#define PINMUX_OPAMP_OAOUT1_PB06B  ((PIN_OPAMP_OAOUT1_PB06B << 16) | MUX_OPAMP_OAOUT1_PB06B)
#define PORT_OPAMP_OAOUT1_PB06B    (1u <<  6)
#define PIN_OPAMP_OAOUT2_PA04B             4  /**< \brief OPAMP signal: OAOUT2 on PA04 mux B */
#define MUX_OPAMP_OAOUT2_PA04B             1
#define PINMUX_OPAMP_OAOUT2_PA04B  ((PIN_OPAMP_OAOUT2_PA04B << 16) | MUX_OPAMP_OAOUT2_PA04B)
#define PORT_OPAMP_OAOUT2_PA04B    (1u <<  4)
#define PIN_OPAMP_OAPOS0_PA06B             6  /**< \brief OPAMP signal: OAPOS0 on PA06 mux B */
#define MUX_OPAMP_OAPOS0_PA06B             1
#define PINMUX_OPAMP_OAPOS0_PA06B  ((PIN_OPAMP_OAPOS0_PA06B << 16) | MUX_OPAMP_OAPOS0_PA06B)
#define PORT_OPAMP_OAPOS0_PA06B    (1u <<  6)
#define PIN_OPAMP_OAPOS1_PB09B            41  /**< \brief OPAMP signal: OAPOS1 on PB09 mux B */
#define MUX_OPAMP_OAPOS1_PB09B             1
#define PINMUX_OPAMP_OAPOS1_PB09B  ((PIN_OPAMP_OAPOS1_PB09B << 16) | MUX_OPAMP_OAPOS1_PB09B)
#define PORT_OPAMP_OAPOS1_PB09B    (1u <<  9)
#define PIN_OPAMP_OAPOS2_PA05B             5  /**< \brief OPAMP signal: OAPOS2 on PA05 mux B */
#define MUX_OPAMP_OAPOS2_PA05B             1
#define PINMUX_OPAMP_OAPOS2_PA05B  ((PIN_OPAMP_OAPOS2_PA05B << 16) | MUX_OPAMP_OAPOS2_PA05B)
#define PORT_OPAMP_OAPOS2_PA05B    (1u <<  5)
/* ========== PORT definition for PTC peripheral ========== */
#define PIN_PTC_X0_PA08B                   8  /**< \brief PTC signal: X0 on PA08 mux B */
#define MUX_PTC_X0_PA08B                   1
#define PINMUX_PTC_X0_PA08B        ((PIN_PTC_X0_PA08B << 16) | MUX_PTC_X0_PA08B)
#define PORT_PTC_X0_PA08B          (1u <<  8)
#define PIN_PTC_X1_PA09B                   9  /**< \brief PTC signal: X1 on PA09 mux B */
#define MUX_PTC_X1_PA09B                   1
#define PINMUX_PTC_X1_PA09B        ((PIN_PTC_X1_PA09B << 16) | MUX_PTC_X1_PA09B)
#define PORT_PTC_X1_PA09B          (1u <<  9)
#define PIN_PTC_X2_PA10B                  10  /**< \brief PTC signal: X2 on PA10 mux B */
#define MUX_PTC_X2_PA10B                   1
#define PINMUX_PTC_X2_PA10B        ((PIN_PTC_X2_PA10B << 16) | MUX_PTC_X2_PA10B)
#define PORT_PTC_X2_PA10B          (1u << 10)
#define PIN_PTC_X3_PA11B                  11  /**< \brief PTC signal: X3 on PA11 mux B */
#define MUX_PTC_X3_PA11B                   1
#define PINMUX_PTC_X3_PA11B        ((PIN_PTC_X3_PA11B << 16) | MUX_PTC_X3_PA11B)
#define PORT_PTC_X3_PA11B          (1u << 11)
#define PIN_PTC_X4_PA16B                  16  /**< \brief PTC signal: X4 on PA16 mux B */
#define MUX_PTC_X4_PA16B                   1
#define PINMUX_PTC_X4_PA16B        ((PIN_PTC_X4_PA16B << 16) | MUX_PTC_X4_PA16B)
#define PORT_PTC_X4_PA16B          (1u << 16)
#define PIN_PTC_X5_PA17B                  17  /**< \brief PTC signal: X5 on PA17 mux B */
#define MUX_PTC_X5_PA17B                   1
#define PINMUX_PTC_X5_PA17B        ((PIN_PTC_X5_PA17B << 16) | MUX_PTC_X5_PA17B)
#define PORT_PTC_X5_PA17B          (1u << 17)
#define PIN_PTC_X6_PA18B                  18  /**< \brief PTC signal: X6 on PA18 mux B */
#define MUX_PTC_X6_PA18B                   1
#define PINMUX_PTC_X6_PA18B        ((PIN_PTC_X6_PA18B << 16) | MUX_PTC_X6_PA18B)
#define PORT_PTC_X6_PA18B          (1u << 18)
#define PIN_PTC_X7_PA19B                  19  /**< \brief PTC signal: X7 on PA19 mux B */
#define MUX_PTC_X7_PA19B                   1
#define PINMUX_PTC_X7_PA19B        ((PIN_PTC_X7_PA19B << 16) | MUX_PTC_X7_PA19B)
#define PORT_PTC_X7_PA19B          (1u << 19)
#define PIN_PTC_X8_PA20B                  20  /**< \brief PTC signal: X8 on PA20 mux B */
#define MUX_PTC_X8_PA20B                   1
#define PINMUX_PTC_X8_PA20B        ((PIN_PTC_X8_PA20B << 16) | MUX_PTC_X8_PA20B)
#define PORT_PTC_X8_PA20B          (1u << 20)
#define PIN_PTC_X9_PA21B                  21  /**< \brief PTC signal: X9 on PA21 mux B */
#define MUX_PTC_X9_PA21B                   1
#define PINMUX_PTC_X9_PA21B        ((PIN_PTC_X9_PA21B << 16) | MUX_PTC_X9_PA21B)
#define PORT_PTC_X9_PA21B          (1u << 21)
#define PIN_PTC_X10_PA22B                 22  /**< \brief PTC signal: X10 on PA22 mux B */
#define MUX_PTC_X10_PA22B                  1
#define PINMUX_PTC_X10_PA22B       ((PIN_PTC_X10_PA22B << 16) | MUX_PTC_X10_PA22B)
#define PORT_PTC_X10_PA22B         (1u << 22)
#define PIN_PTC_X11_PA23B                 23  /**< \brief PTC signal: X11 on PA23 mux B */
#define MUX_PTC_X11_PA23B                  1
#define PINMUX_PTC_X11_PA23B       ((PIN_PTC_X11_PA23B << 16) | MUX_PTC_X11_PA23B)
#define PORT_PTC_X11_PA23B         (1u << 23)
#define PIN_PTC_X12_PB12B                 44  /**< \brief PTC signal: X12 on PB12 mux B */
#define MUX_PTC_X12_PB12B                  1
#define PINMUX_PTC_X12_PB12B       ((PIN_PTC_X12_PB12B << 16) | MUX_PTC_X12_PB12B)
#define PORT_PTC_X12_PB12B         (1u << 12)
#define PIN_PTC_X13_PB13B                 45  /**< \brief PTC signal: X13 on PB13 mux B */
#define MUX_PTC_X13_PB13B                  1
#define PINMUX_PTC_X13_PB13B       ((PIN_PTC_X13_PB13B << 16) | MUX_PTC_X13_PB13B)
#define PORT_PTC_X13_PB13B         (1u << 13)
#define PIN_PTC_X14_PB14B                 46  /**< \brief PTC signal: X14 on PB14 mux B */
#define MUX_PTC_X14_PB14B                  1
#define PINMUX_PTC_X14_PB14B       ((PIN_PTC_X14_PB14B << 16) | MUX_PTC_X14_PB14B)
#define PORT_PTC_X14_PB14B         (1u << 14)
#define PIN_PTC_X15_PB15B                 47  /**< \brief PTC signal: X15 on PB15 mux B */
#define MUX_PTC_X15_PB15B                  1
#define PINMUX_PTC_X15_PB15B       ((PIN_PTC_X15_PB15B << 16) | MUX_PTC_X15_PB15B)
#define PORT_PTC_X15_PB15B         (1u << 15)
#define PIN_PTC_Y0_PA02B                   2  /**< \brief PTC signal: Y0 on PA02 mux B */
#define MUX_PTC_Y0_PA02B                   1
#define PINMUX_PTC_Y0_PA02B        ((PIN_PTC_Y0_PA02B << 16) | MUX_PTC_Y0_PA02B)
#define PORT_PTC_Y0_PA02B          (1u <<  2)
#define PIN_PTC_Y1_PA03B                   3  /**< \brief PTC signal: Y1 on PA03 mux B */
#define MUX_PTC_Y1_PA03B                   1
#define PINMUX_PTC_Y1_PA03B        ((PIN_PTC_Y1_PA03B << 16) | MUX_PTC_Y1_PA03B)
#define PORT_PTC_Y1_PA03B          (1u <<  3)
#define PIN_PTC_Y2_PA04B                   4  /**< \brief PTC signal: Y2 on PA04 mux B */
#define MUX_PTC_Y2_PA04B                   1
#define PINMUX_PTC_Y2_PA04B        ((PIN_PTC_Y2_PA04B << 16) | MUX_PTC_Y2_PA04B)
#define PORT_PTC_Y2_PA04B          (1u <<  4)
#define PIN_PTC_Y3_PA05B                   5  /**< \brief PTC signal: Y3 on PA05 mux B */
#define MUX_PTC_Y3_PA05B                   1
#define PINMUX_PTC_Y3_PA05B        ((PIN_PTC_Y3_PA05B << 16) | MUX_PTC_Y3_PA05B)
#define PORT_PTC_Y3_PA05B          (1u <<  5)
#define PIN_PTC_Y4_PA06B                   6  /**< \brief PTC signal: Y4 on PA06 mux B */
#define MUX_PTC_Y4_PA06B                   1
#define PINMUX_PTC_Y4_PA06B        ((PIN_PTC_Y4_PA06B << 16) | MUX_PTC_Y4_PA06B)
#define PORT_PTC_Y4_PA06B          (1u <<  6)
#define PIN_PTC_Y5_PA07B                   7  /**< \brief PTC signal: Y5 on PA07 mux B */
#define MUX_PTC_Y5_PA07B                   1
#define PINMUX_PTC_Y5_PA07B        ((PIN_PTC_Y5_PA07B << 16) | MUX_PTC_Y5_PA07B)
#define PORT_PTC_Y5_PA07B          (1u <<  7)
#define PIN_PTC_Y6_PA08B                   8  /**< \brief PTC signal: Y6 on PA08 mux B */
#define MUX_PTC_Y6_PA08B                   1
#define PINMUX_PTC_Y6_PA08B        ((PIN_PTC_Y6_PA08B << 16) | MUX_PTC_Y6_PA08B)
#define PORT_PTC_Y6_PA08B          (1u <<  8)
#define PIN_PTC_Y7_PA09B                   9  /**< \brief PTC signal: Y7 on PA09 mux B */
#define MUX_PTC_Y7_PA09B                   1
#define PINMUX_PTC_Y7_PA09B        ((PIN_PTC_Y7_PA09B << 16) | MUX_PTC_Y7_PA09B)
#define PORT_PTC_Y7_PA09B          (1u <<  9)
#define PIN_PTC_Y8_PA10B                  10  /**< \brief PTC signal: Y8 on PA10 mux B */
#define MUX_PTC_Y8_PA10B                   1
#define PINMUX_PTC_Y8_PA10B        ((PIN_PTC_Y8_PA10B << 16) | MUX_PTC_Y8_PA10B)
#define PORT_PTC_Y8_PA10B          (1u << 10)
#define PIN_PTC_Y9_PA11B                  11  /**< \brief PTC signal: Y9 on PA11 mux B */
#define MUX_PTC_Y9_PA11B                   1
#define PINMUX_PTC_Y9_PA11B        ((PIN_PTC_Y9_PA11B << 16) | MUX_PTC_Y9_PA11B)
#define PORT_PTC_Y9_PA11B          (1u << 11)
#define PIN_PTC_Y10_PB04B                 36  /**< \brief PTC signal: Y10 on PB04 mux B */
#define MUX_PTC_Y10_PB04B                  1
#define PINMUX_PTC_Y10_PB04B       ((PIN_PTC_Y10_PB04B << 16) | MUX_PTC_Y10_PB04B)
#define PORT_PTC_Y10_PB04B         (1u <<  4)
#define PIN_PTC_Y11_PB05B                 37  /**< \brief PTC signal: Y11 on PB05 mux B */
#define MUX_PTC_Y11_PB05B                  1
#define PINMUX_PTC_Y11_PB05B       ((PIN_PTC_Y11_PB05B << 16) | MUX_PTC_Y11_PB05B)
#define PORT_PTC_Y11_PB05B         (1u <<  5)
#define PIN_PTC_Y12_PB06B                 38  /**< \brief PTC signal: Y12 on PB06 mux B */
#define MUX_PTC_Y12_PB06B                  1
#define PINMUX_PTC_Y12_PB06B       ((PIN_PTC_Y12_PB06B << 16) | MUX_PTC_Y12_PB06B)
#define PORT_PTC_Y12_PB06B         (1u <<  6)
#define PIN_PTC_Y13_PB07B                 39  /**< \brief PTC signal: Y13 on PB07 mux B */
#define MUX_PTC_Y13_PB07B                  1
#define PINMUX_PTC_Y13_PB07B       ((PIN_PTC_Y13_PB07B << 16) | MUX_PTC_Y13_PB07B)
#define PORT_PTC_Y13_PB07B         (1u <<  7)
#define PIN_PTC_Y14_PB08B                 40  /**< \brief PTC signal: Y14 on PB08 mux B */
#define MUX_PTC_Y14_PB08B                  1
#define PINMUX_PTC_Y14_PB08B       ((PIN_PTC_Y14_PB08B << 16) | MUX_PTC_Y14_PB08B)
#define PORT_PTC_Y14_PB08B         (1u <<  8)
#define PIN_PTC_Y15_PB09B                 41  /**< \brief PTC signal: Y15 on PB09 mux B */
#define MUX_PTC_Y15_PB09B                  1
#define PINMUX_PTC_Y15_PB09B       ((PIN_PTC_Y15_PB09B << 16) | MUX_PTC_Y15_PB09B)
#define PORT_PTC_Y15_PB09B         (1u <<  9)
/* ========== PORT definition for RFCTRL peripheral ========== */
#define PIN_RFCTRL_FECTRL0_PA08F           8  /**< \brief RFCTRL signal: FECTRL0 on PA08 mux F */
#define MUX_RFCTRL_FECTRL0_PA08F           5
#define PINMUX_RFCTRL_FECTRL0_PA08F ((PIN_RFCTRL_FECTRL0_PA08F << 16) | MUX_RFCTRL_FECTRL0_PA08F)
#define PORT_RFCTRL_FECTRL0_PA08F  (1u <<  8)
#define PIN_RFCTRL_FECTRL1_PA09F           9  /**< \brief RFCTRL signal: FECTRL1 on PA09 mux F */
#define MUX_RFCTRL_FECTRL1_PA09F           5
#define PINMUX_RFCTRL_FECTRL1_PA09F ((PIN_RFCTRL_FECTRL1_PA09F << 16) | MUX_RFCTRL_FECTRL1_PA09F)
#define PORT_RFCTRL_FECTRL1_PA09F  (1u <<  9)
#define PIN_RFCTRL_FECTRL2_PA12F          12  /**< \brief RFCTRL signal: FECTRL2 on PA12 mux F */
#define MUX_RFCTRL_FECTRL2_PA12F           5
#define PINMUX_RFCTRL_FECTRL2_PA12F ((PIN_RFCTRL_FECTRL2_PA12F << 16) | MUX_RFCTRL_FECTRL2_PA12F)
#define PORT_RFCTRL_FECTRL2_PA12F  (1u << 12)
#define PIN_RFCTRL_FECTRL3_PA13F          13  /**< \brief RFCTRL signal: FECTRL3 on PA13 mux F */
#define MUX_RFCTRL_FECTRL3_PA13F           5
#define PINMUX_RFCTRL_FECTRL3_PA13F ((PIN_RFCTRL_FECTRL3_PA13F << 16) | MUX_RFCTRL_FECTRL3_PA13F)
#define PORT_RFCTRL_FECTRL3_PA13F  (1u << 13)
#define PIN_RFCTRL_FECTRL4_PA14F          14  /**< \brief RFCTRL signal: FECTRL4 on PA14 mux F */
#define MUX_RFCTRL_FECTRL4_PA14F           5
#define PINMUX_RFCTRL_FECTRL4_PA14F ((PIN_RFCTRL_FECTRL4_PA14F << 16) | MUX_RFCTRL_FECTRL4_PA14F)
#define PORT_RFCTRL_FECTRL4_PA14F  (1u << 14)
#define PIN_RFCTRL_FECTRL5_PA15F          15  /**< \brief RFCTRL signal: FECTRL5 on PA15 mux F */
#define MUX_RFCTRL_FECTRL5_PA15F           5
#define PINMUX_RFCTRL_FECTRL5_PA15F ((PIN_RFCTRL_FECTRL5_PA15F << 16) | MUX_RFCTRL_FECTRL5_PA15F)
#define PORT_RFCTRL_FECTRL5_PA15F  (1u << 15)
/* ========== PORT definition for RSTC peripheral ========== */
#define PIN_RSTC_EXTWAKE0_PA00A            0  /**< \brief RSTC signal: EXTWAKE0 on PA00 mux A */
#define MUX_RSTC_EXTWAKE0_PA00A            0
#define PINMUX_RSTC_EXTWAKE0_PA00A ((PIN_RSTC_EXTWAKE0_PA00A << 16) | MUX_RSTC_EXTWAKE0_PA00A)
#define PORT_RSTC_EXTWAKE0_PA00A   (1u <<  0)
#define PIN_RSTC_EXTWAKE1_PA01A            1  /**< \brief RSTC signal: EXTWAKE1 on PA01 mux A */
#define MUX_RSTC_EXTWAKE1_PA01A            0
#define PINMUX_RSTC_EXTWAKE1_PA01A ((PIN_RSTC_EXTWAKE1_PA01A << 16) | MUX_RSTC_EXTWAKE1_PA01A)
#define PORT_RSTC_EXTWAKE1_PA01A   (1u <<  1)
#define PIN_RSTC_EXTWAKE2_PA02A            2  /**< \brief RSTC signal: EXTWAKE2 on PA02 mux A */
#define MUX_RSTC_EXTWAKE2_PA02A            0
#define PINMUX_RSTC_EXTWAKE2_PA02A ((PIN_RSTC_EXTWAKE2_PA02A << 16) | MUX_RSTC_EXTWAKE2_PA02A)
#define PORT_RSTC_EXTWAKE2_PA02A   (1u <<  2)
#define PIN_RSTC_EXTWAKE3_PA03A            3  /**< \brief RSTC signal: EXTWAKE3 on PA03 mux A */
#define MUX_RSTC_EXTWAKE3_PA03A            0
#define PINMUX_RSTC_EXTWAKE3_PA03A ((PIN_RSTC_EXTWAKE3_PA03A << 16) | MUX_RSTC_EXTWAKE3_PA03A)
#define PORT_RSTC_EXTWAKE3_PA03A   (1u <<  3)
#define PIN_RSTC_EXTWAKE4_PA04A            4  /**< \brief RSTC signal: EXTWAKE4 on PA04 mux A */
#define MUX_RSTC_EXTWAKE4_PA04A            0
#define PINMUX_RSTC_EXTWAKE4_PA04A ((PIN_RSTC_EXTWAKE4_PA04A << 16) | MUX_RSTC_EXTWAKE4_PA04A)
#define PORT_RSTC_EXTWAKE4_PA04A   (1u <<  4)
#define PIN_RSTC_EXTWAKE5_PA05A            5  /**< \brief RSTC signal: EXTWAKE5 on PA05 mux A */
#define MUX_RSTC_EXTWAKE5_PA05A            0
#define PINMUX_RSTC_EXTWAKE5_PA05A ((PIN_RSTC_EXTWAKE5_PA05A << 16) | MUX_RSTC_EXTWAKE5_PA05A)
#define PORT_RSTC_EXTWAKE5_PA05A   (1u <<  5)
#define PIN_RSTC_EXTWAKE6_PA06A            6  /**< \brief RSTC signal: EXTWAKE6 on PA06 mux A */
#define MUX_RSTC_EXTWAKE6_PA06A            0
#define PINMUX_RSTC_EXTWAKE6_PA06A ((PIN_RSTC_EXTWAKE6_PA06A << 16) | MUX_RSTC_EXTWAKE6_PA06A)
#define PORT_RSTC_EXTWAKE6_PA06A   (1u <<  6)
#define PIN_RSTC_EXTWAKE7_PA07A            7  /**< \brief RSTC signal: EXTWAKE7 on PA07 mux A */
#define MUX_RSTC_EXTWAKE7_PA07A            0
#define PINMUX_RSTC_EXTWAKE7_PA07A ((PIN_RSTC_EXTWAKE7_PA07A << 16) | MUX_RSTC_EXTWAKE7_PA07A)
#define PORT_RSTC_EXTWAKE7_PA07A   (1u <<  7)
#define PIN_RSTC_EXTWAKE8_PA08A            8  /**< \brief RSTC signal: EXTWAKE8 on PA08 mux A */
#define MUX_RSTC_EXTWAKE8_PA08A            0
#define PINMUX_RSTC_EXTWAKE8_PA08A ((PIN_RSTC_EXTWAKE8_PA08A << 16) | MUX_RSTC_EXTWAKE8_PA08A)
#define PORT_RSTC_EXTWAKE8_PA08A   (1u <<  8)
#define PIN_RSTC_EXTWAKE9_PA09A            9  /**< \brief RSTC signal: EXTWAKE9 on PA09 mux A */
#define MUX_RSTC_EXTWAKE9_PA09A            0
#define PINMUX_RSTC_EXTWAKE9_PA09A ((PIN_RSTC_EXTWAKE9_PA09A << 16) | MUX_RSTC_EXTWAKE9_PA09A)
#define PORT_RSTC_EXTWAKE9_PA09A   (1u <<  9)
#define PIN_RSTC_EXTWAKE10_PA10A          10  /**< \brief RSTC signal: EXTWAKE10 on PA10 mux A */
#define MUX_RSTC_EXTWAKE10_PA10A           0
#define PINMUX_RSTC_EXTWAKE10_PA10A ((PIN_RSTC_EXTWAKE10_PA10A << 16) | MUX_RSTC_EXTWAKE10_PA10A)
#define PORT_RSTC_EXTWAKE10_PA10A  (1u << 10)
#define PIN_RSTC_EXTWAKE11_PA11A          11  /**< \brief RSTC signal: EXTWAKE11 on PA11 mux A */
#define MUX_RSTC_EXTWAKE11_PA11A           0
#define PINMUX_RSTC_EXTWAKE11_PA11A ((PIN_RSTC_EXTWAKE11_PA11A << 16) | MUX_RSTC_EXTWAKE11_PA11A)
#define PORT_RSTC_EXTWAKE11_PA11A  (1u << 11)
#define PIN_RSTC_EXTWAKE12_PA12A          12  /**< \brief RSTC signal: EXTWAKE12 on PA12 mux A */
#define MUX_RSTC_EXTWAKE12_PA12A           0
#define PINMUX_RSTC_EXTWAKE12_PA12A ((PIN_RSTC_EXTWAKE12_PA12A << 16) | MUX_RSTC_EXTWAKE12_PA12A)
#define PORT_RSTC_EXTWAKE12_PA12A  (1u << 12)
#define PIN_RSTC_EXTWAKE13_PA13A          13  /**< \brief RSTC signal: EXTWAKE13 on PA13 mux A */
#define MUX_RSTC_EXTWAKE13_PA13A           0
#define PINMUX_RSTC_EXTWAKE13_PA13A ((PIN_RSTC_EXTWAKE13_PA13A << 16) | MUX_RSTC_EXTWAKE13_PA13A)
#define PORT_RSTC_EXTWAKE13_PA13A  (1u << 13)
#define PIN_RSTC_EXTWAKE14_PA14A          14  /**< \brief RSTC signal: EXTWAKE14 on PA14 mux A */
#define MUX_RSTC_EXTWAKE14_PA14A           0
#define PINMUX_RSTC_EXTWAKE14_PA14A ((PIN_RSTC_EXTWAKE14_PA14A << 16) | MUX_RSTC_EXTWAKE14_PA14A)
#define PORT_RSTC_EXTWAKE14_PA14A  (1u << 14)
#define PIN_RSTC_EXTWAKE15_PA15A          15  /**< \brief RSTC signal: EXTWAKE15 on PA15 mux A */
#define MUX_RSTC_EXTWAKE15_PA15A           0
#define PINMUX_RSTC_EXTWAKE15_PA15A ((PIN_RSTC_EXTWAKE15_PA15A << 16) | MUX_RSTC_EXTWAKE15_PA15A)
#define PORT_RSTC_EXTWAKE15_PA15A  (1u << 15)
/* ========== PORT definition for SERCOM0 peripheral ========== */
#define PIN_SERCOM0_PAD0_PA04D             4  /**< \brief SERCOM0 signal: PAD0 on PA04 mux D */
#define MUX_SERCOM0_PAD0_PA04D             3
#define PINMUX_SERCOM0_PAD0_PA04D  ((PIN_SERCOM0_PAD0_PA04D << 16) | MUX_SERCOM0_PAD0_PA04D)
#define PORT_SERCOM0_PAD0_PA04D    (1u <<  4)
#define PIN_SERCOM0_PAD0_PA08C             8  /**< \brief SERCOM0 signal: PAD0 on PA08 mux C */
#define MUX_SERCOM0_PAD0_PA08C             2
#define PINMUX_SERCOM0_PAD0_PA08C  ((PIN_SERCOM0_PAD0_PA08C << 16) | MUX_SERCOM0_PAD0_PA08C)
#define PORT_SERCOM0_PAD0_PA08C    (1u <<  8)
#define PIN_SERCOM0_PAD1_PA05D             5  /**< \brief SERCOM0 signal: PAD1 on PA05 mux D */
#define MUX_SERCOM0_PAD1_PA05D             3
#define PINMUX_SERCOM0_PAD1_PA05D  ((PIN_SERCOM0_PAD1_PA05D << 16) | MUX_SERCOM0_PAD1_PA05D)
#define PORT_SERCOM0_PAD1_PA05D    (1u <<  5)
#define PIN_SERCOM0_PAD1_PA09C             9  /**< \brief SERCOM0 signal: PAD1 on PA09 mux C */
#define MUX_SERCOM0_PAD1_PA09C             2
#define PINMUX_SERCOM0_PAD1_PA09C  ((PIN_SERCOM0_PAD1_PA09C << 16) | MUX_SERCOM0_PAD1_PA09C)
#define PORT_SERCOM0_PAD1_PA09C    (1u <<  9)
#define PIN_SERCOM0_PAD2_PA06D             6  /**< \brief SERCOM0 signal: PAD2 on PA06 mux D */
#define MUX_SERCOM0_PAD2_PA06D             3
#define PINMUX_SERCOM0_PAD2_PA06D  ((PIN_SERCOM0_PAD2_PA06D << 16) | MUX_SERCOM0_PAD2_PA06D)
#define PORT_SERCOM0_PAD2_PA06D    (1u <<  6)
#define PIN_SERCOM0_PAD2_PA10C            10  /**< \brief SERCOM0 signal: PAD2 on PA10 mux C */
#define MUX_SERCOM0_PAD2_PA10C             2
#define PINMUX_SERCOM0_PAD2_PA10C  ((PIN_SERCOM0_PAD2_PA10C << 16) | MUX_SERCOM0_PAD2_PA10C)
#define PORT_SERCOM0_PAD2_PA10C    (1u << 10)
#define PIN_SERCOM0_PAD3_PA07D             7  /**< \brief SERCOM0 signal: PAD3 on PA07 mux D */
#define MUX_SERCOM0_PAD3_PA07D             3
#define PINMUX_SERCOM0_PAD3_PA07D  ((PIN_SERCOM0_PAD3_PA07D << 16) | MUX_SERCOM0_PAD3_PA07D)
#define PORT_SERCOM0_PAD3_PA07D    (1u <<  7)
#define PIN_SERCOM0_PAD3_PA11C            11  /**< \brief SERCOM0 signal: PAD3 on PA11 mux C */
#define MUX_SERCOM0_PAD3_PA11C             2
#define PINMUX_SERCOM0_PAD3_PA11C  ((PIN_SERCOM0_PAD3_PA11C << 16) | MUX_SERCOM0_PAD3_PA11C)
#define PORT_SERCOM0_PAD3_PA11C    (1u << 11)
/* ========== PORT definition for SERCOM1 peripheral ========== */
#define PIN_SERCOM1_PAD0_PA16C            16  /**< \brief SERCOM1 signal: PAD0 on PA16 mux C */
#define MUX_SERCOM1_PAD0_PA16C             2
#define PINMUX_SERCOM1_PAD0_PA16C  ((PIN_SERCOM1_PAD0_PA16C << 16) | MUX_SERCOM1_PAD0_PA16C)
#define PORT_SERCOM1_PAD0_PA16C    (1u << 16)
#define PIN_SERCOM1_PAD0_PA00D             0  /**< \brief SERCOM1 signal: PAD0 on PA00 mux D */
#define MUX_SERCOM1_PAD0_PA00D             3
#define PINMUX_SERCOM1_PAD0_PA00D  ((PIN_SERCOM1_PAD0_PA00D << 16) | MUX_SERCOM1_PAD0_PA00D)
#define PORT_SERCOM1_PAD0_PA00D    (1u <<  0)
#define PIN_SERCOM1_PAD1_PA17C            17  /**< \brief SERCOM1 signal: PAD1 on PA17 mux C */
#define MUX_SERCOM1_PAD1_PA17C             2
#define PINMUX_SERCOM1_PAD1_PA17C  ((PIN_SERCOM1_PAD1_PA17C << 16) | MUX_SERCOM1_PAD1_PA17C)
#define PORT_SERCOM1_PAD1_PA17C    (1u << 17)
#define PIN_SERCOM1_PAD1_PA01D             1  /**< \brief SERCOM1 signal: PAD1 on PA01 mux D */
#define MUX_SERCOM1_PAD1_PA01D             3
#define PINMUX_SERCOM1_PAD1_PA01D  ((PIN_SERCOM1_PAD1_PA01D << 16) | MUX_SERCOM1_PAD1_PA01D)
#define PORT_SERCOM1_PAD1_PA01D    (1u <<  1)
#define PIN_SERCOM1_PAD2_PA30D            30  /**< \brief SERCOM1 signal: PAD2 on PA30 mux D */
#define MUX_SERCOM1_PAD2_PA30D             3
#define PINMUX_SERCOM1_PAD2_PA30D  ((PIN_SERCOM1_PAD2_PA30D << 16) | MUX_SERCOM1_PAD2_PA30D)
#define PORT_SERCOM1_PAD2_PA30D    (1u << 30)
#define PIN_SERCOM1_PAD2_PA18C            18  /**< \brief SERCOM1 signal: PAD2 on PA18 mux C */
#define MUX_SERCOM1_PAD2_PA18C             2
#define PINMUX_SERCOM1_PAD2_PA18C  ((PIN_SERCOM1_PAD2_PA18C << 16) | MUX_SERCOM1_PAD2_PA18C)
#define PORT_SERCOM1_PAD2_PA18C    (1u << 18)
#define PIN_SERCOM1_PAD3_PA31D            31  /**< \brief SERCOM1 signal: PAD3 on PA31 mux D */
#define MUX_SERCOM1_PAD3_PA31D             3
#define PINMUX_SERCOM1_PAD3_PA31D  ((PIN_SERCOM1_PAD3_PA31D << 16) | MUX_SERCOM1_PAD3_PA31D)
#define PORT_SERCOM1_PAD3_PA31D    (1u << 31)
#define PIN_SERCOM1_PAD3_PA19C            19  /**< \brief SERCOM1 signal: PAD3 on PA19 mux C */
#define MUX_SERCOM1_PAD3_PA19C             2
#define PINMUX_SERCOM1_PAD3_PA19C  ((PIN_SERCOM1_PAD3_PA19C << 16) | MUX_SERCOM1_PAD3_PA19C)
#define PORT_SERCOM1_PAD3_PA19C    (1u << 19)
/* ========== PORT definition for SERCOM2 peripheral ========== */
#define PIN_SERCOM2_PAD0_PA08D             8  /**< \brief SERCOM2 signal: PAD0 on PA08 mux D */
#define MUX_SERCOM2_PAD0_PA08D             3
#define PINMUX_SERCOM2_PAD0_PA08D  ((PIN_SERCOM2_PAD0_PA08D << 16) | MUX_SERCOM2_PAD0_PA08D)
#define PORT_SERCOM2_PAD0_PA08D    (1u <<  8)
#define PIN_SERCOM2_PAD0_PA12C            12  /**< \brief SERCOM2 signal: PAD0 on PA12 mux C */
#define MUX_SERCOM2_PAD0_PA12C             2
#define PINMUX_SERCOM2_PAD0_PA12C  ((PIN_SERCOM2_PAD0_PA12C << 16) | MUX_SERCOM2_PAD0_PA12C)
#define PORT_SERCOM2_PAD0_PA12C    (1u << 12)
#define PIN_SERCOM2_PAD1_PA09D             9  /**< \brief SERCOM2 signal: PAD1 on PA09 mux D */
#define MUX_SERCOM2_PAD1_PA09D             3
#define PINMUX_SERCOM2_PAD1_PA09D  ((PIN_SERCOM2_PAD1_PA09D << 16) | MUX_SERCOM2_PAD1_PA09D)
#define PORT_SERCOM2_PAD1_PA09D    (1u <<  9)
#define PIN_SERCOM2_PAD1_PA13C            13  /**< \brief SERCOM2 signal: PAD1 on PA13 mux C */
#define MUX_SERCOM2_PAD1_PA13C             2
#define PINMUX_SERCOM2_PAD1_PA13C  ((PIN_SERCOM2_PAD1_PA13C << 16) | MUX_SERCOM2_PAD1_PA13C)
#define PORT_SERCOM2_PAD1_PA13C    (1u << 13)
#define PIN_SERCOM2_PAD2_PA10D            10  /**< \brief SERCOM2 signal: PAD2 on PA10 mux D */
#define MUX_SERCOM2_PAD2_PA10D             3
#define PINMUX_SERCOM2_PAD2_PA10D  ((PIN_SERCOM2_PAD2_PA10D << 16) | MUX_SERCOM2_PAD2_PA10D)
#define PORT_SERCOM2_PAD2_PA10D    (1u << 10)
#define PIN_SERCOM2_PAD2_PA14C            14  /**< \brief SERCOM2 signal: PAD2 on PA14 mux C */
#define MUX_SERCOM2_PAD2_PA14C             2
#define PINMUX_SERCOM2_PAD2_PA14C  ((PIN_SERCOM2_PAD2_PA14C << 16) | MUX_SERCOM2_PAD2_PA14C)
#define PORT_SERCOM2_PAD2_PA14C    (1u << 14)
#define PIN_SERCOM2_PAD3_PA11D            11  /**< \brief SERCOM2 signal: PAD3 on PA11 mux D */
#define MUX_SERCOM2_PAD3_PA11D             3
