zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define PINMUX_SERCOM2_PAD3_PA11D  ((PIN_SERCOM2_PAD3_PA11D << 16) | MUX_SERCOM2_PAD3_PA11D)
#define PORT_SERCOM2_PAD3_PA11D    (1u << 11)
#define PIN_SERCOM2_PAD3_PA15C            15  /**< \brief SERCOM2 signal: PAD3 on PA15 mux C */
#define MUX_SERCOM2_PAD3_PA15C             2
#define PINMUX_SERCOM2_PAD3_PA15C  ((PIN_SERCOM2_PAD3_PA15C << 16) | MUX_SERCOM2_PAD3_PA15C)
#define PORT_SERCOM2_PAD3_PA15C    (1u << 15)
/* ========== PORT definition for SERCOM3 peripheral ========== */
#define PIN_SERCOM3_PAD0_PA16D            16  /**< \brief SERCOM3 signal: PAD0 on PA16 mux D */
#define MUX_SERCOM3_PAD0_PA16D             3
#define PINMUX_SERCOM3_PAD0_PA16D  ((PIN_SERCOM3_PAD0_PA16D << 16) | MUX_SERCOM3_PAD0_PA16D)
#define PORT_SERCOM3_PAD0_PA16D    (1u << 16)
#define PIN_SERCOM3_PAD0_PA22C            22  /**< \brief SERCOM3 signal: PAD0 on PA22 mux C */
#define MUX_SERCOM3_PAD0_PA22C             2
#define PINMUX_SERCOM3_PAD0_PA22C  ((PIN_SERCOM3_PAD0_PA22C << 16) | MUX_SERCOM3_PAD0_PA22C)
#define PORT_SERCOM3_PAD0_PA22C    (1u << 22)
#define PIN_SERCOM3_PAD0_PA27F            27  /**< \brief SERCOM3 signal: PAD0 on PA27 mux F */
#define MUX_SERCOM3_PAD0_PA27F             5
#define PINMUX_SERCOM3_PAD0_PA27F  ((PIN_SERCOM3_PAD0_PA27F << 16) | MUX_SERCOM3_PAD0_PA27F)
#define PORT_SERCOM3_PAD0_PA27F    (1u << 27)
#define PIN_SERCOM3_PAD1_PA17D            17  /**< \brief SERCOM3 signal: PAD1 on PA17 mux D */
#define MUX_SERCOM3_PAD1_PA17D             3
#define PINMUX_SERCOM3_PAD1_PA17D  ((PIN_SERCOM3_PAD1_PA17D << 16) | MUX_SERCOM3_PAD1_PA17D)
#define PORT_SERCOM3_PAD1_PA17D    (1u << 17)
#define PIN_SERCOM3_PAD1_PA23C            23  /**< \brief SERCOM3 signal: PAD1 on PA23 mux C */
#define MUX_SERCOM3_PAD1_PA23C             2
#define PINMUX_SERCOM3_PAD1_PA23C  ((PIN_SERCOM3_PAD1_PA23C << 16) | MUX_SERCOM3_PAD1_PA23C)
#define PORT_SERCOM3_PAD1_PA23C    (1u << 23)
#define PIN_SERCOM3_PAD1_PA28F            28  /**< \brief SERCOM3 signal: PAD1 on PA28 mux F */
#define MUX_SERCOM3_PAD1_PA28F             5
#define PINMUX_SERCOM3_PAD1_PA28F  ((PIN_SERCOM3_PAD1_PA28F << 16) | MUX_SERCOM3_PAD1_PA28F)
#define PORT_SERCOM3_PAD1_PA28F    (1u << 28)
#define PIN_SERCOM3_PAD2_PA18D            18  /**< \brief SERCOM3 signal: PAD2 on PA18 mux D */
#define MUX_SERCOM3_PAD2_PA18D             3
#define PINMUX_SERCOM3_PAD2_PA18D  ((PIN_SERCOM3_PAD2_PA18D << 16) | MUX_SERCOM3_PAD2_PA18D)
#define PORT_SERCOM3_PAD2_PA18D    (1u << 18)
#define PIN_SERCOM3_PAD2_PA20D            20  /**< \brief SERCOM3 signal: PAD2 on PA20 mux D */
#define MUX_SERCOM3_PAD2_PA20D             3
#define PINMUX_SERCOM3_PAD2_PA20D  ((PIN_SERCOM3_PAD2_PA20D << 16) | MUX_SERCOM3_PAD2_PA20D)
#define PORT_SERCOM3_PAD2_PA20D    (1u << 20)
#define PIN_SERCOM3_PAD2_PA24C            24  /**< \brief SERCOM3 signal: PAD2 on PA24 mux C */
#define MUX_SERCOM3_PAD2_PA24C             2
#define PINMUX_SERCOM3_PAD2_PA24C  ((PIN_SERCOM3_PAD2_PA24C << 16) | MUX_SERCOM3_PAD2_PA24C)
#define PORT_SERCOM3_PAD2_PA24C    (1u << 24)
#define PIN_SERCOM3_PAD3_PA19D            19  /**< \brief SERCOM3 signal: PAD3 on PA19 mux D */
#define MUX_SERCOM3_PAD3_PA19D             3
#define PINMUX_SERCOM3_PAD3_PA19D  ((PIN_SERCOM3_PAD3_PA19D << 16) | MUX_SERCOM3_PAD3_PA19D)
#define PORT_SERCOM3_PAD3_PA19D    (1u << 19)
#define PIN_SERCOM3_PAD3_PA21D            21  /**< \brief SERCOM3 signal: PAD3 on PA21 mux D */
#define MUX_SERCOM3_PAD3_PA21D             3
#define PINMUX_SERCOM3_PAD3_PA21D  ((PIN_SERCOM3_PAD3_PA21D << 16) | MUX_SERCOM3_PAD3_PA21D)
#define PORT_SERCOM3_PAD3_PA21D    (1u << 21)
#define PIN_SERCOM3_PAD3_PA25C            25  /**< \brief SERCOM3 signal: PAD3 on PA25 mux C */
#define MUX_SERCOM3_PAD3_PA25C             2
#define PINMUX_SERCOM3_PAD3_PA25C  ((PIN_SERCOM3_PAD3_PA25C << 16) | MUX_SERCOM3_PAD3_PA25C)
#define PORT_SERCOM3_PAD3_PA25C    (1u << 25)
/* ========== PORT definition for SERCOM4 peripheral ========== */
#define PIN_SERCOM4_PAD0_PA12D            12  /**< \brief SERCOM4 signal: PAD0 on PA12 mux D */
#define MUX_SERCOM4_PAD0_PA12D             3
#define PINMUX_SERCOM4_PAD0_PA12D  ((PIN_SERCOM4_PAD0_PA12D << 16) | MUX_SERCOM4_PAD0_PA12D)
#define PORT_SERCOM4_PAD0_PA12D    (1u << 12)
#define PIN_SERCOM4_PAD0_PB08D            40  /**< \brief SERCOM4 signal: PAD0 on PB08 mux D */
#define MUX_SERCOM4_PAD0_PB08D             3
#define PINMUX_SERCOM4_PAD0_PB08D  ((PIN_SERCOM4_PAD0_PB08D << 16) | MUX_SERCOM4_PAD0_PB08D)
#define PORT_SERCOM4_PAD0_PB08D    (1u <<  8)
#define PIN_SERCOM4_PAD0_PB12C            44  /**< \brief SERCOM4 signal: PAD0 on PB12 mux C */
#define MUX_SERCOM4_PAD0_PB12C             2
#define PINMUX_SERCOM4_PAD0_PB12C  ((PIN_SERCOM4_PAD0_PB12C << 16) | MUX_SERCOM4_PAD0_PB12C)
#define PORT_SERCOM4_PAD0_PB12C    (1u << 12)
#define PIN_SERCOM4_PAD0_PC19F            83  /**< \brief SERCOM4 signal: PAD0 on PC19 mux F */
#define MUX_SERCOM4_PAD0_PC19F             5
#define PINMUX_SERCOM4_PAD0_PC19F  ((PIN_SERCOM4_PAD0_PC19F << 16) | MUX_SERCOM4_PAD0_PC19F)
#define PORT_SERCOM4_PAD0_PC19F    (1u << 19)
#define PIN_SERCOM4_PAD1_PA13D            13  /**< \brief SERCOM4 signal: PAD1 on PA13 mux D */
#define MUX_SERCOM4_PAD1_PA13D             3
#define PINMUX_SERCOM4_PAD1_PA13D  ((PIN_SERCOM4_PAD1_PA13D << 16) | MUX_SERCOM4_PAD1_PA13D)
#define PORT_SERCOM4_PAD1_PA13D    (1u << 13)
#define PIN_SERCOM4_PAD1_PB09D            41  /**< \brief SERCOM4 signal: PAD1 on PB09 mux D */
#define MUX_SERCOM4_PAD1_PB09D             3
#define PINMUX_SERCOM4_PAD1_PB09D  ((PIN_SERCOM4_PAD1_PB09D << 16) | MUX_SERCOM4_PAD1_PB09D)
#define PORT_SERCOM4_PAD1_PB09D    (1u <<  9)
#define PIN_SERCOM4_PAD1_PB13C            45  /**< \brief SERCOM4 signal: PAD1 on PB13 mux C */
#define MUX_SERCOM4_PAD1_PB13C             2
#define PINMUX_SERCOM4_PAD1_PB13C  ((PIN_SERCOM4_PAD1_PB13C << 16) | MUX_SERCOM4_PAD1_PB13C)
#define PORT_SERCOM4_PAD1_PB13C    (1u << 13)
#define PIN_SERCOM4_PAD1_PB31F            63  /**< \brief SERCOM4 signal: PAD1 on PB31 mux F */
#define MUX_SERCOM4_PAD1_PB31F             5
#define PINMUX_SERCOM4_PAD1_PB31F  ((PIN_SERCOM4_PAD1_PB31F << 16) | MUX_SERCOM4_PAD1_PB31F)
#define PORT_SERCOM4_PAD1_PB31F    (1u << 31)
#define PIN_SERCOM4_PAD2_PA14D            14  /**< \brief SERCOM4 signal: PAD2 on PA14 mux D */
#define MUX_SERCOM4_PAD2_PA14D             3
#define PINMUX_SERCOM4_PAD2_PA14D  ((PIN_SERCOM4_PAD2_PA14D << 16) | MUX_SERCOM4_PAD2_PA14D)
#define PORT_SERCOM4_PAD2_PA14D    (1u << 14)
#define PIN_SERCOM4_PAD2_PB10D            42  /**< \brief SERCOM4 signal: PAD2 on PB10 mux D */
#define MUX_SERCOM4_PAD2_PB10D             3
#define PINMUX_SERCOM4_PAD2_PB10D  ((PIN_SERCOM4_PAD2_PB10D << 16) | MUX_SERCOM4_PAD2_PB10D)
#define PORT_SERCOM4_PAD2_PB10D    (1u << 10)
#define PIN_SERCOM4_PAD2_PB14C            46  /**< \brief SERCOM4 signal: PAD2 on PB14 mux C */
#define MUX_SERCOM4_PAD2_PB14C             2
#define PINMUX_SERCOM4_PAD2_PB14C  ((PIN_SERCOM4_PAD2_PB14C << 16) | MUX_SERCOM4_PAD2_PB14C)
#define PORT_SERCOM4_PAD2_PB14C    (1u << 14)
#define PIN_SERCOM4_PAD2_PB30F            62  /**< \brief SERCOM4 signal: PAD2 on PB30 mux F */
#define MUX_SERCOM4_PAD2_PB30F             5
#define PINMUX_SERCOM4_PAD2_PB30F  ((PIN_SERCOM4_PAD2_PB30F << 16) | MUX_SERCOM4_PAD2_PB30F)
#define PORT_SERCOM4_PAD2_PB30F    (1u << 30)
#define PIN_SERCOM4_PAD3_PA15D            15  /**< \brief SERCOM4 signal: PAD3 on PA15 mux D */
#define MUX_SERCOM4_PAD3_PA15D             3
#define PINMUX_SERCOM4_PAD3_PA15D  ((PIN_SERCOM4_PAD3_PA15D << 16) | MUX_SERCOM4_PAD3_PA15D)
#define PORT_SERCOM4_PAD3_PA15D    (1u << 15)
#define PIN_SERCOM4_PAD3_PB11D            43  /**< \brief SERCOM4 signal: PAD3 on PB11 mux D */
#define MUX_SERCOM4_PAD3_PB11D             3
#define PINMUX_SERCOM4_PAD3_PB11D  ((PIN_SERCOM4_PAD3_PB11D << 16) | MUX_SERCOM4_PAD3_PB11D)
#define PORT_SERCOM4_PAD3_PB11D    (1u << 11)
#define PIN_SERCOM4_PAD3_PB15C            47  /**< \brief SERCOM4 signal: PAD3 on PB15 mux C */
#define MUX_SERCOM4_PAD3_PB15C             2
#define PINMUX_SERCOM4_PAD3_PB15C  ((PIN_SERCOM4_PAD3_PB15C << 16) | MUX_SERCOM4_PAD3_PB15C)
#define PORT_SERCOM4_PAD3_PB15C    (1u << 15)
#define PIN_SERCOM4_PAD3_PC18F            82  /**< \brief SERCOM4 signal: PAD3 on PC18 mux F */
#define MUX_SERCOM4_PAD3_PC18F             5
#define PINMUX_SERCOM4_PAD3_PC18F  ((PIN_SERCOM4_PAD3_PC18F << 16) | MUX_SERCOM4_PAD3_PC18F)
#define PORT_SERCOM4_PAD3_PC18F    (1u << 18)
/* ========== PORT definition for SERCOM5 peripheral ========== */
#define PIN_SERCOM5_PAD0_PA22D            22  /**< \brief SERCOM5 signal: PAD0 on PA22 mux D */
#define MUX_SERCOM5_PAD0_PA22D             3
#define PINMUX_SERCOM5_PAD0_PA22D  ((PIN_SERCOM5_PAD0_PA22D << 16) | MUX_SERCOM5_PAD0_PA22D)
#define PORT_SERCOM5_PAD0_PA22D    (1u << 22)
#define PIN_SERCOM5_PAD0_PB02D            34  /**< \brief SERCOM5 signal: PAD0 on PB02 mux D */
#define MUX_SERCOM5_PAD0_PB02D             3
#define PINMUX_SERCOM5_PAD0_PB02D  ((PIN_SERCOM5_PAD0_PB02D << 16) | MUX_SERCOM5_PAD0_PB02D)
#define PORT_SERCOM5_PAD0_PB02D    (1u <<  2)
#define PIN_SERCOM5_PAD0_PB30D            62  /**< \brief SERCOM5 signal: PAD0 on PB30 mux D */
#define MUX_SERCOM5_PAD0_PB30D             3
#define PINMUX_SERCOM5_PAD0_PB30D  ((PIN_SERCOM5_PAD0_PB30D << 16) | MUX_SERCOM5_PAD0_PB30D)
#define PORT_SERCOM5_PAD0_PB30D    (1u << 30)
#define PIN_SERCOM5_PAD0_PB16C            48  /**< \brief SERCOM5 signal: PAD0 on PB16 mux C */
#define MUX_SERCOM5_PAD0_PB16C             2
#define PINMUX_SERCOM5_PAD0_PB16C  ((PIN_SERCOM5_PAD0_PB16C << 16) | MUX_SERCOM5_PAD0_PB16C)
#define PORT_SERCOM5_PAD0_PB16C    (1u << 16)
#define PIN_SERCOM5_PAD1_PA23D            23  /**< \brief SERCOM5 signal: PAD1 on PA23 mux D */
#define MUX_SERCOM5_PAD1_PA23D             3
#define PINMUX_SERCOM5_PAD1_PA23D  ((PIN_SERCOM5_PAD1_PA23D << 16) | MUX_SERCOM5_PAD1_PA23D)
#define PORT_SERCOM5_PAD1_PA23D    (1u << 23)
#define PIN_SERCOM5_PAD1_PB03D            35  /**< \brief SERCOM5 signal: PAD1 on PB03 mux D */
#define MUX_SERCOM5_PAD1_PB03D             3
#define PINMUX_SERCOM5_PAD1_PB03D  ((PIN_SERCOM5_PAD1_PB03D << 16) | MUX_SERCOM5_PAD1_PB03D)
#define PORT_SERCOM5_PAD1_PB03D    (1u <<  3)
#define PIN_SERCOM5_PAD1_PB31D            63  /**< \brief SERCOM5 signal: PAD1 on PB31 mux D */
#define MUX_SERCOM5_PAD1_PB31D             3
#define PINMUX_SERCOM5_PAD1_PB31D  ((PIN_SERCOM5_PAD1_PB31D << 16) | MUX_SERCOM5_PAD1_PB31D)
#define PORT_SERCOM5_PAD1_PB31D    (1u << 31)
#define PIN_SERCOM5_PAD1_PB17C            49  /**< \brief SERCOM5 signal: PAD1 on PB17 mux C */
#define MUX_SERCOM5_PAD1_PB17C             2
#define PINMUX_SERCOM5_PAD1_PB17C  ((PIN_SERCOM5_PAD1_PB17C << 16) | MUX_SERCOM5_PAD1_PB17C)
#define PORT_SERCOM5_PAD1_PB17C    (1u << 17)
#define PIN_SERCOM5_PAD2_PA24D            24  /**< \brief SERCOM5 signal: PAD2 on PA24 mux D */
#define MUX_SERCOM5_PAD2_PA24D             3
#define PINMUX_SERCOM5_PAD2_PA24D  ((PIN_SERCOM5_PAD2_PA24D << 16) | MUX_SERCOM5_PAD2_PA24D)
#define PORT_SERCOM5_PAD2_PA24D    (1u << 24)
#define PIN_SERCOM5_PAD2_PB00D            32  /**< \brief SERCOM5 signal: PAD2 on PB00 mux D */
#define MUX_SERCOM5_PAD2_PB00D             3
#define PINMUX_SERCOM5_PAD2_PB00D  ((PIN_SERCOM5_PAD2_PB00D << 16) | MUX_SERCOM5_PAD2_PB00D)
#define PORT_SERCOM5_PAD2_PB00D    (1u <<  0)
#define PIN_SERCOM5_PAD2_PB22D            54  /**< \brief SERCOM5 signal: PAD2 on PB22 mux D */
#define MUX_SERCOM5_PAD2_PB22D             3
#define PINMUX_SERCOM5_PAD2_PB22D  ((PIN_SERCOM5_PAD2_PB22D << 16) | MUX_SERCOM5_PAD2_PB22D)
#define PORT_SERCOM5_PAD2_PB22D    (1u << 22)
#define PIN_SERCOM5_PAD2_PA20C            20  /**< \brief SERCOM5 signal: PAD2 on PA20 mux C */
#define MUX_SERCOM5_PAD2_PA20C             2
#define PINMUX_SERCOM5_PAD2_PA20C  ((PIN_SERCOM5_PAD2_PA20C << 16) | MUX_SERCOM5_PAD2_PA20C)
#define PORT_SERCOM5_PAD2_PA20C    (1u << 20)
#define PIN_SERCOM5_PAD3_PA25D            25  /**< \brief SERCOM5 signal: PAD3 on PA25 mux D */
#define MUX_SERCOM5_PAD3_PA25D             3
#define PINMUX_SERCOM5_PAD3_PA25D  ((PIN_SERCOM5_PAD3_PA25D << 16) | MUX_SERCOM5_PAD3_PA25D)
#define PORT_SERCOM5_PAD3_PA25D    (1u << 25)
#define PIN_SERCOM5_PAD3_PB01D            33  /**< \brief SERCOM5 signal: PAD3 on PB01 mux D */
#define MUX_SERCOM5_PAD3_PB01D             3
#define PINMUX_SERCOM5_PAD3_PB01D  ((PIN_SERCOM5_PAD3_PB01D << 16) | MUX_SERCOM5_PAD3_PB01D)
#define PORT_SERCOM5_PAD3_PB01D    (1u <<  1)
#define PIN_SERCOM5_PAD3_PB23D            55  /**< \brief SERCOM5 signal: PAD3 on PB23 mux D */
#define MUX_SERCOM5_PAD3_PB23D             3
#define PINMUX_SERCOM5_PAD3_PB23D  ((PIN_SERCOM5_PAD3_PB23D << 16) | MUX_SERCOM5_PAD3_PB23D)
#define PORT_SERCOM5_PAD3_PB23D    (1u << 23)
#define PIN_SERCOM5_PAD3_PA21C            21  /**< \brief SERCOM5 signal: PAD3 on PA21 mux C */
#define MUX_SERCOM5_PAD3_PA21C             2
#define PINMUX_SERCOM5_PAD3_PA21C  ((PIN_SERCOM5_PAD3_PA21C << 16) | MUX_SERCOM5_PAD3_PA21C)
#define PORT_SERCOM5_PAD3_PA21C    (1u << 21)
/* ========== PORT definition for SUPC peripheral ========== */
#define PIN_SUPC_OUT0_PB01H               33  /**< \brief SUPC signal: OUT0 on PB01 mux H */
#define MUX_SUPC_OUT0_PB01H                7
#define PINMUX_SUPC_OUT0_PB01H     ((PIN_SUPC_OUT0_PB01H << 16) | MUX_SUPC_OUT0_PB01H)
#define PORT_SUPC_OUT0_PB01H       (1u <<  1)
#define PIN_SUPC_OUT1_PB02H               34  /**< \brief SUPC signal: OUT1 on PB02 mux H */
#define MUX_SUPC_OUT1_PB02H                7
#define PINMUX_SUPC_OUT1_PB02H     ((PIN_SUPC_OUT1_PB02H << 16) | MUX_SUPC_OUT1_PB02H)
#define PORT_SUPC_OUT1_PB02H       (1u <<  2)
#define PIN_SUPC_PSOK_PB00H               32  /**< \brief SUPC signal: PSOK on PB00 mux H */
#define MUX_SUPC_PSOK_PB00H                7
#define PINMUX_SUPC_PSOK_PB00H     ((PIN_SUPC_PSOK_PB00H << 16) | MUX_SUPC_PSOK_PB00H)
#define PORT_SUPC_PSOK_PB00H       (1u <<  0)
#define PIN_SUPC_VBAT_PB03H               35  /**< \brief SUPC signal: VBAT on PB03 mux H */
#define MUX_SUPC_VBAT_PB03H                7
#define PINMUX_SUPC_VBAT_PB03H     ((PIN_SUPC_VBAT_PB03H << 16) | MUX_SUPC_VBAT_PB03H)
#define PORT_SUPC_VBAT_PB03H       (1u <<  3)
/* ========== PORT definition for TAL peripheral ========== */
#define PIN_TAL_BRK_PA27G                 27  /**< \brief TAL signal: BRK on PA27 mux G */
#define MUX_TAL_BRK_PA27G                  6
#define PINMUX_TAL_BRK_PA27G       ((PIN_TAL_BRK_PA27G << 16) | MUX_TAL_BRK_PA27G)
#define PORT_TAL_BRK_PA27G         (1u << 27)
/* ========== PORT definition for TC0 peripheral ========== */
#define PIN_TC0_WO0_PA22E                 22  /**< \brief TC0 signal: WO0 on PA22 mux E */
#define MUX_TC0_WO0_PA22E                  4
#define PINMUX_TC0_WO0_PA22E       ((PIN_TC0_WO0_PA22E << 16) | MUX_TC0_WO0_PA22E)
#define PORT_TC0_WO0_PA22E         (1u << 22)
#define PIN_TC0_WO0_PB08E                 40  /**< \brief TC0 signal: WO0 on PB08 mux E */
#define MUX_TC0_WO0_PB08E                  4
#define PINMUX_TC0_WO0_PB08E       ((PIN_TC0_WO0_PB08E << 16) | MUX_TC0_WO0_PB08E)
#define PORT_TC0_WO0_PB08E         (1u <<  8)
#define PIN_TC0_WO0_PB12E                 44  /**< \brief TC0 signal: WO0 on PB12 mux E */
#define MUX_TC0_WO0_PB12E                  4
#define PINMUX_TC0_WO0_PB12E       ((PIN_TC0_WO0_PB12E << 16) | MUX_TC0_WO0_PB12E)
#define PORT_TC0_WO0_PB12E         (1u << 12)
#define PIN_TC0_WO1_PA23E                 23  /**< \brief TC0 signal: WO1 on PA23 mux E */
#define MUX_TC0_WO1_PA23E                  4
#define PINMUX_TC0_WO1_PA23E       ((PIN_TC0_WO1_PA23E << 16) | MUX_TC0_WO1_PA23E)
#define PORT_TC0_WO1_PA23E         (1u << 23)
#define PIN_TC0_WO1_PB09E                 41  /**< \brief TC0 signal: WO1 on PB09 mux E */
#define MUX_TC0_WO1_PB09E                  4
#define PINMUX_TC0_WO1_PB09E       ((PIN_TC0_WO1_PB09E << 16) | MUX_TC0_WO1_PB09E)
#define PORT_TC0_WO1_PB09E         (1u <<  9)
#define PIN_TC0_WO1_PB13E                 45  /**< \brief TC0 signal: WO1 on PB13 mux E */
#define MUX_TC0_WO1_PB13E                  4
#define PINMUX_TC0_WO1_PB13E       ((PIN_TC0_WO1_PB13E << 16) | MUX_TC0_WO1_PB13E)
#define PORT_TC0_WO1_PB13E         (1u << 13)
/* ========== PORT definition for TC1 peripheral ========== */
#define PIN_TC1_WO0_PA24E                 24  /**< \brief TC1 signal: WO0 on PA24 mux E */
#define MUX_TC1_WO0_PA24E                  4
#define PINMUX_TC1_WO0_PA24E       ((PIN_TC1_WO0_PA24E << 16) | MUX_TC1_WO0_PA24E)
#define PORT_TC1_WO0_PA24E         (1u << 24)
#define PIN_TC1_WO0_PB10E                 42  /**< \brief TC1 signal: WO0 on PB10 mux E */
#define MUX_TC1_WO0_PB10E                  4
#define PINMUX_TC1_WO0_PB10E       ((PIN_TC1_WO0_PB10E << 16) | MUX_TC1_WO0_PB10E)
#define PORT_TC1_WO0_PB10E         (1u << 10)
#define PIN_TC1_WO0_PB14E                 46  /**< \brief TC1 signal: WO0 on PB14 mux E */
#define MUX_TC1_WO0_PB14E                  4
#define PINMUX_TC1_WO0_PB14E       ((PIN_TC1_WO0_PB14E << 16) | MUX_TC1_WO0_PB14E)
#define PORT_TC1_WO0_PB14E         (1u << 14)
#define PIN_TC1_WO1_PA25E                 25  /**< \brief TC1 signal: WO1 on PA25 mux E */
#define MUX_TC1_WO1_PA25E                  4
#define PINMUX_TC1_WO1_PA25E       ((PIN_TC1_WO1_PA25E << 16) | MUX_TC1_WO1_PA25E)
#define PORT_TC1_WO1_PA25E         (1u << 25)
#define PIN_TC1_WO1_PB11E                 43  /**< \brief TC1 signal: WO1 on PB11 mux E */
#define MUX_TC1_WO1_PB11E                  4
#define PINMUX_TC1_WO1_PB11E       ((PIN_TC1_WO1_PB11E << 16) | MUX_TC1_WO1_PB11E)
#define PORT_TC1_WO1_PB11E         (1u << 11)
#define PIN_TC1_WO1_PB15E                 47  /**< \brief TC1 signal: WO1 on PB15 mux E */
#define MUX_TC1_WO1_PB15E                  4
#define PINMUX_TC1_WO1_PB15E       ((PIN_TC1_WO1_PB15E << 16) | MUX_TC1_WO1_PB15E)
#define PORT_TC1_WO1_PB15E         (1u << 15)
/* ========== PORT definition for TC2 peripheral ========== */
#define PIN_TC2_WO0_PB02E                 34  /**< \brief TC2 signal: WO0 on PB02 mux E */
#define MUX_TC2_WO0_PB02E                  4
#define PINMUX_TC2_WO0_PB02E       ((PIN_TC2_WO0_PB02E << 16) | MUX_TC2_WO0_PB02E)
#define PORT_TC2_WO0_PB02E         (1u <<  2)
#define PIN_TC2_WO0_PB16E                 48  /**< \brief TC2 signal: WO0 on PB16 mux E */
#define MUX_TC2_WO0_PB16E                  4
#define PINMUX_TC2_WO0_PB16E       ((PIN_TC2_WO0_PB16E << 16) | MUX_TC2_WO0_PB16E)
#define PORT_TC2_WO0_PB16E         (1u << 16)
#define PIN_TC2_WO1_PB03E                 35  /**< \brief TC2 signal: WO1 on PB03 mux E */
#define MUX_TC2_WO1_PB03E                  4
#define PINMUX_TC2_WO1_PB03E       ((PIN_TC2_WO1_PB03E << 16) | MUX_TC2_WO1_PB03E)
#define PORT_TC2_WO1_PB03E         (1u <<  3)
#define PIN_TC2_WO1_PB17E                 49  /**< \brief TC2 signal: WO1 on PB17 mux E */
#define MUX_TC2_WO1_PB17E                  4
#define PINMUX_TC2_WO1_PB17E       ((PIN_TC2_WO1_PB17E << 16) | MUX_TC2_WO1_PB17E)
#define PORT_TC2_WO1_PB17E         (1u << 17)
/* ========== PORT definition for TC3 peripheral ========== */
#define PIN_TC3_WO0_PA20E                 20  /**< \brief TC3 signal: WO0 on PA20 mux E */
#define MUX_TC3_WO0_PA20E                  4
#define PINMUX_TC3_WO0_PA20E       ((PIN_TC3_WO0_PA20E << 16) | MUX_TC3_WO0_PA20E)
#define PORT_TC3_WO0_PA20E         (1u << 20)
#define PIN_TC3_WO0_PB00E                 32  /**< \brief TC3 signal: WO0 on PB00 mux E */
#define MUX_TC3_WO0_PB00E                  4
#define PINMUX_TC3_WO0_PB00E       ((PIN_TC3_WO0_PB00E << 16) | MUX_TC3_WO0_PB00E)
#define PORT_TC3_WO0_PB00E         (1u <<  0)
#define PIN_TC3_WO0_PB22E                 54  /**< \brief TC3 signal: WO0 on PB22 mux E */
#define MUX_TC3_WO0_PB22E                  4
#define PINMUX_TC3_WO0_PB22E       ((PIN_TC3_WO0_PB22E << 16) | MUX_TC3_WO0_PB22E)
#define PORT_TC3_WO0_PB22E         (1u << 22)
#define PIN_TC3_WO1_PA21E                 21  /**< \brief TC3 signal: WO1 on PA21 mux E */
#define MUX_TC3_WO1_PA21E                  4
#define PINMUX_TC3_WO1_PA21E       ((PIN_TC3_WO1_PA21E << 16) | MUX_TC3_WO1_PA21E)
#define PORT_TC3_WO1_PA21E         (1u << 21)
#define PIN_TC3_WO1_PB01E                 33  /**< \brief TC3 signal: WO1 on PB01 mux E */
#define MUX_TC3_WO1_PB01E                  4
#define PINMUX_TC3_WO1_PB01E       ((PIN_TC3_WO1_PB01E << 16) | MUX_TC3_WO1_PB01E)
#define PORT_TC3_WO1_PB01E         (1u <<  1)
#define PIN_TC3_WO1_PB23E                 55  /**< \brief TC3 signal: WO1 on PB23 mux E */
#define MUX_TC3_WO1_PB23E                  4
#define PINMUX_TC3_WO1_PB23E       ((PIN_TC3_WO1_PB23E << 16) | MUX_TC3_WO1_PB23E)
#define PORT_TC3_WO1_PB23E         (1u << 23)
/* ========== PORT definition for TC4 peripheral ========== */
#define PIN_TC4_WO0_PA18E                 18  /**< \brief TC4 signal: WO0 on PA18 mux E */
#define MUX_TC4_WO0_PA18E                  4
#define PINMUX_TC4_WO0_PA18E       ((PIN_TC4_WO0_PA18E << 16) | MUX_TC4_WO0_PA18E)
#define PORT_TC4_WO0_PA18E         (1u << 18)
#define PIN_TC4_WO0_PA14E                 14  /**< \brief TC4 signal: WO0 on PA14 mux E */
#define MUX_TC4_WO0_PA14E                  4
#define PINMUX_TC4_WO0_PA14E       ((PIN_TC4_WO0_PA14E << 16) | MUX_TC4_WO0_PA14E)
#define PORT_TC4_WO0_PA14E         (1u << 14)
#define PIN_TC4_WO1_PA19E                 19  /**< \brief TC4 signal: WO1 on PA19 mux E */
#define MUX_TC4_WO1_PA19E                  4
#define PINMUX_TC4_WO1_PA19E       ((PIN_TC4_WO1_PA19E << 16) | MUX_TC4_WO1_PA19E)
#define PORT_TC4_WO1_PA19E         (1u << 19)
#define PIN_TC4_WO1_PA15E                 15  /**< \brief TC4 signal: WO1 on PA15 mux E */
#define MUX_TC4_WO1_PA15E                  4
#define PINMUX_TC4_WO1_PA15E       ((PIN_TC4_WO1_PA15E << 16) | MUX_TC4_WO1_PA15E)
#define PORT_TC4_WO1_PA15E         (1u << 15)
/* ========== PORT definition for TCC0 peripheral ========== */
#define PIN_TCC0_WO0_PA04E                 4  /**< \brief TCC0 signal: WO0 on PA04 mux E */
#define MUX_TCC0_WO0_PA04E                 4
#define PINMUX_TCC0_WO0_PA04E      ((PIN_TCC0_WO0_PA04E << 16) | MUX_TCC0_WO0_PA04E)
#define PORT_TCC0_WO0_PA04E        (1u <<  4)
#define PIN_TCC0_WO0_PA08E                 8  /**< \brief TCC0 signal: WO0 on PA08 mux E */
#define MUX_TCC0_WO0_PA08E                 4
#define PINMUX_TCC0_WO0_PA08E      ((PIN_TCC0_WO0_PA08E << 16) | MUX_TCC0_WO0_PA08E)
#define PORT_TCC0_WO0_PA08E        (1u <<  8)
#define PIN_TCC0_WO0_PB30E                62  /**< \brief TCC0 signal: WO0 on PB30 mux E */
#define MUX_TCC0_WO0_PB30E                 4
#define PINMUX_TCC0_WO0_PB30E      ((PIN_TCC0_WO0_PB30E << 16) | MUX_TCC0_WO0_PB30E)
#define PORT_TCC0_WO0_PB30E        (1u << 30)
#define PIN_TCC0_WO0_PA16F                16  /**< \brief TCC0 signal: WO0 on PA16 mux F */
#define MUX_TCC0_WO0_PA16F                 5
#define PINMUX_TCC0_WO0_PA16F      ((PIN_TCC0_WO0_PA16F << 16) | MUX_TCC0_WO0_PA16F)
#define PORT_TCC0_WO0_PA16F        (1u << 16)
#define PIN_TCC0_WO1_PA05E                 5  /**< \brief TCC0 signal: WO1 on PA05 mux E */
#define MUX_TCC0_WO1_PA05E                 4
#define PINMUX_TCC0_WO1_PA05E      ((PIN_TCC0_WO1_PA05E << 16) | MUX_TCC0_WO1_PA05E)
#define PORT_TCC0_WO1_PA05E        (1u <<  5)
#define PIN_TCC0_WO1_PA09E                 9  /**< \brief TCC0 signal: WO1 on PA09 mux E */
#define MUX_TCC0_WO1_PA09E                 4
#define PINMUX_TCC0_WO1_PA09E      ((PIN_TCC0_WO1_PA09E << 16) | MUX_TCC0_WO1_PA09E)
#define PORT_TCC0_WO1_PA09E        (1u <<  9)
#define PIN_TCC0_WO1_PB31E                63  /**< \brief TCC0 signal: WO1 on PB31 mux E */
#define MUX_TCC0_WO1_PB31E                 4
#define PINMUX_TCC0_WO1_PB31E      ((PIN_TCC0_WO1_PB31E << 16) | MUX_TCC0_WO1_PB31E)
#define PORT_TCC0_WO1_PB31E        (1u << 31)
#define PIN_TCC0_WO1_PA17F                17  /**< \brief TCC0 signal: WO1 on PA17 mux F */
#define MUX_TCC0_WO1_PA17F                 5
#define PINMUX_TCC0_WO1_PA17F      ((PIN_TCC0_WO1_PA17F << 16) | MUX_TCC0_WO1_PA17F)
#define PORT_TCC0_WO1_PA17F        (1u << 17)
#define PIN_TCC0_WO2_PA10F                10  /**< \brief TCC0 signal: WO2 on PA10 mux F */
#define MUX_TCC0_WO2_PA10F                 5
