zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define PINMUX_TCC0_WO2_PA10F      ((PIN_TCC0_WO2_PA10F << 16) | MUX_TCC0_WO2_PA10F)
#define PORT_TCC0_WO2_PA10F        (1u << 10)
#define PIN_TCC0_WO2_PA18F                18  /**< \brief TCC0 signal: WO2 on PA18 mux F */
#define MUX_TCC0_WO2_PA18F                 5
#define PINMUX_TCC0_WO2_PA18F      ((PIN_TCC0_WO2_PA18F << 16) | MUX_TCC0_WO2_PA18F)
#define PORT_TCC0_WO2_PA18F        (1u << 18)
#define PIN_TCC0_WO3_PA11F                11  /**< \brief TCC0 signal: WO3 on PA11 mux F */
#define MUX_TCC0_WO3_PA11F                 5
#define PINMUX_TCC0_WO3_PA11F      ((PIN_TCC0_WO3_PA11F << 16) | MUX_TCC0_WO3_PA11F)
#define PORT_TCC0_WO3_PA11F        (1u << 11)
#define PIN_TCC0_WO3_PA19F                19  /**< \brief TCC0 signal: WO3 on PA19 mux F */
#define MUX_TCC0_WO3_PA19F                 5
#define PINMUX_TCC0_WO3_PA19F      ((PIN_TCC0_WO3_PA19F << 16) | MUX_TCC0_WO3_PA19F)
#define PORT_TCC0_WO3_PA19F        (1u << 19)
#define PIN_TCC0_WO4_PA22F                22  /**< \brief TCC0 signal: WO4 on PA22 mux F */
#define MUX_TCC0_WO4_PA22F                 5
#define PINMUX_TCC0_WO4_PA22F      ((PIN_TCC0_WO4_PA22F << 16) | MUX_TCC0_WO4_PA22F)
#define PORT_TCC0_WO4_PA22F        (1u << 22)
#define PIN_TCC0_WO4_PB10F                42  /**< \brief TCC0 signal: WO4 on PB10 mux F */
#define MUX_TCC0_WO4_PB10F                 5
#define PINMUX_TCC0_WO4_PB10F      ((PIN_TCC0_WO4_PB10F << 16) | MUX_TCC0_WO4_PB10F)
#define PORT_TCC0_WO4_PB10F        (1u << 10)
#define PIN_TCC0_WO4_PB16F                48  /**< \brief TCC0 signal: WO4 on PB16 mux F */
#define MUX_TCC0_WO4_PB16F                 5
#define PINMUX_TCC0_WO4_PB16F      ((PIN_TCC0_WO4_PB16F << 16) | MUX_TCC0_WO4_PB16F)
#define PORT_TCC0_WO4_PB16F        (1u << 16)
#define PIN_TCC0_WO4_PA14F                14  /**< \brief TCC0 signal: WO4 on PA14 mux F */
#define MUX_TCC0_WO4_PA14F                 5
#define PINMUX_TCC0_WO4_PA14F      ((PIN_TCC0_WO4_PA14F << 16) | MUX_TCC0_WO4_PA14F)
#define PORT_TCC0_WO4_PA14F        (1u << 14)
#define PIN_TCC0_WO5_PA15F                15  /**< \brief TCC0 signal: WO5 on PA15 mux F */
#define MUX_TCC0_WO5_PA15F                 5
#define PINMUX_TCC0_WO5_PA15F      ((PIN_TCC0_WO5_PA15F << 16) | MUX_TCC0_WO5_PA15F)
#define PORT_TCC0_WO5_PA15F        (1u << 15)
#define PIN_TCC0_WO5_PA23F                23  /**< \brief TCC0 signal: WO5 on PA23 mux F */
#define MUX_TCC0_WO5_PA23F                 5
#define PINMUX_TCC0_WO5_PA23F      ((PIN_TCC0_WO5_PA23F << 16) | MUX_TCC0_WO5_PA23F)
#define PORT_TCC0_WO5_PA23F        (1u << 23)
#define PIN_TCC0_WO5_PB11F                43  /**< \brief TCC0 signal: WO5 on PB11 mux F */
#define MUX_TCC0_WO5_PB11F                 5
#define PINMUX_TCC0_WO5_PB11F      ((PIN_TCC0_WO5_PB11F << 16) | MUX_TCC0_WO5_PB11F)
#define PORT_TCC0_WO5_PB11F        (1u << 11)
#define PIN_TCC0_WO5_PB17F                49  /**< \brief TCC0 signal: WO5 on PB17 mux F */
#define MUX_TCC0_WO5_PB17F                 5
#define PINMUX_TCC0_WO5_PB17F      ((PIN_TCC0_WO5_PB17F << 16) | MUX_TCC0_WO5_PB17F)
#define PORT_TCC0_WO5_PB17F        (1u << 17)
#define PIN_TCC0_WO6_PA12F                12  /**< \brief TCC0 signal: WO6 on PA12 mux F */
#define MUX_TCC0_WO6_PA12F                 5
#define PINMUX_TCC0_WO6_PA12F      ((PIN_TCC0_WO6_PA12F << 16) | MUX_TCC0_WO6_PA12F)
#define PORT_TCC0_WO6_PA12F        (1u << 12)
#define PIN_TCC0_WO6_PA16F                16  /**< \brief TCC0 signal: WO6 on PA16 mux F */
#define MUX_TCC0_WO6_PA16F                 5
#define PINMUX_TCC0_WO6_PA16F      ((PIN_TCC0_WO6_PA16F << 16) | MUX_TCC0_WO6_PA16F)
#define PORT_TCC0_WO6_PA16F        (1u << 16)
#define PIN_TCC0_WO6_PA20F                20  /**< \brief TCC0 signal: WO6 on PA20 mux F */
#define MUX_TCC0_WO6_PA20F                 5
#define PINMUX_TCC0_WO6_PA20F      ((PIN_TCC0_WO6_PA20F << 16) | MUX_TCC0_WO6_PA20F)
#define PORT_TCC0_WO6_PA20F        (1u << 20)
#define PIN_TCC0_WO6_PB12F                44  /**< \brief TCC0 signal: WO6 on PB12 mux F */
#define MUX_TCC0_WO6_PB12F                 5
#define PINMUX_TCC0_WO6_PB12F      ((PIN_TCC0_WO6_PB12F << 16) | MUX_TCC0_WO6_PB12F)
#define PORT_TCC0_WO6_PB12F        (1u << 12)
#define PIN_TCC0_WO7_PA13F                13  /**< \brief TCC0 signal: WO7 on PA13 mux F */
#define MUX_TCC0_WO7_PA13F                 5
#define PINMUX_TCC0_WO7_PA13F      ((PIN_TCC0_WO7_PA13F << 16) | MUX_TCC0_WO7_PA13F)
#define PORT_TCC0_WO7_PA13F        (1u << 13)
#define PIN_TCC0_WO7_PA17F                17  /**< \brief TCC0 signal: WO7 on PA17 mux F */
#define MUX_TCC0_WO7_PA17F                 5
#define PINMUX_TCC0_WO7_PA17F      ((PIN_TCC0_WO7_PA17F << 16) | MUX_TCC0_WO7_PA17F)
#define PORT_TCC0_WO7_PA17F        (1u << 17)
#define PIN_TCC0_WO7_PA21F                21  /**< \brief TCC0 signal: WO7 on PA21 mux F */
#define MUX_TCC0_WO7_PA21F                 5
#define PINMUX_TCC0_WO7_PA21F      ((PIN_TCC0_WO7_PA21F << 16) | MUX_TCC0_WO7_PA21F)
#define PORT_TCC0_WO7_PA21F        (1u << 21)
#define PIN_TCC0_WO7_PB13F                45  /**< \brief TCC0 signal: WO7 on PB13 mux F */
#define MUX_TCC0_WO7_PB13F                 5
#define PINMUX_TCC0_WO7_PB13F      ((PIN_TCC0_WO7_PB13F << 16) | MUX_TCC0_WO7_PB13F)
#define PORT_TCC0_WO7_PB13F        (1u << 13)
/* ========== PORT definition for TCC1 peripheral ========== */
#define PIN_TCC1_WO0_PA06E                 6  /**< \brief TCC1 signal: WO0 on PA06 mux E */
#define MUX_TCC1_WO0_PA06E                 4
#define PINMUX_TCC1_WO0_PA06E      ((PIN_TCC1_WO0_PA06E << 16) | MUX_TCC1_WO0_PA06E)
#define PORT_TCC1_WO0_PA06E        (1u <<  6)
#define PIN_TCC1_WO0_PA10E                10  /**< \brief TCC1 signal: WO0 on PA10 mux E */
#define MUX_TCC1_WO0_PA10E                 4
#define PINMUX_TCC1_WO0_PA10E      ((PIN_TCC1_WO0_PA10E << 16) | MUX_TCC1_WO0_PA10E)
#define PORT_TCC1_WO0_PA10E        (1u << 10)
#define PIN_TCC1_WO0_PA30E                30  /**< \brief TCC1 signal: WO0 on PA30 mux E */
#define MUX_TCC1_WO0_PA30E                 4
#define PINMUX_TCC1_WO0_PA30E      ((PIN_TCC1_WO0_PA30E << 16) | MUX_TCC1_WO0_PA30E)
#define PORT_TCC1_WO0_PA30E        (1u << 30)
#define PIN_TCC1_WO1_PA07E                 7  /**< \brief TCC1 signal: WO1 on PA07 mux E */
#define MUX_TCC1_WO1_PA07E                 4
#define PINMUX_TCC1_WO1_PA07E      ((PIN_TCC1_WO1_PA07E << 16) | MUX_TCC1_WO1_PA07E)
#define PORT_TCC1_WO1_PA07E        (1u <<  7)
#define PIN_TCC1_WO1_PA11E                11  /**< \brief TCC1 signal: WO1 on PA11 mux E */
#define MUX_TCC1_WO1_PA11E                 4
#define PINMUX_TCC1_WO1_PA11E      ((PIN_TCC1_WO1_PA11E << 16) | MUX_TCC1_WO1_PA11E)
#define PORT_TCC1_WO1_PA11E        (1u << 11)
#define PIN_TCC1_WO1_PA31E                31  /**< \brief TCC1 signal: WO1 on PA31 mux E */
#define MUX_TCC1_WO1_PA31E                 4
#define PINMUX_TCC1_WO1_PA31E      ((PIN_TCC1_WO1_PA31E << 16) | MUX_TCC1_WO1_PA31E)
#define PORT_TCC1_WO1_PA31E        (1u << 31)
#define PIN_TCC1_WO2_PA08F                 8  /**< \brief TCC1 signal: WO2 on PA08 mux F */
#define MUX_TCC1_WO2_PA08F                 5
#define PINMUX_TCC1_WO2_PA08F      ((PIN_TCC1_WO2_PA08F << 16) | MUX_TCC1_WO2_PA08F)
#define PORT_TCC1_WO2_PA08F        (1u <<  8)
#define PIN_TCC1_WO2_PA24F                24  /**< \brief TCC1 signal: WO2 on PA24 mux F */
#define MUX_TCC1_WO2_PA24F                 5
#define PINMUX_TCC1_WO2_PA24F      ((PIN_TCC1_WO2_PA24F << 16) | MUX_TCC1_WO2_PA24F)
#define PORT_TCC1_WO2_PA24F        (1u << 24)
#define PIN_TCC1_WO2_PB30F                62  /**< \brief TCC1 signal: WO2 on PB30 mux F */
#define MUX_TCC1_WO2_PB30F                 5
#define PINMUX_TCC1_WO2_PB30F      ((PIN_TCC1_WO2_PB30F << 16) | MUX_TCC1_WO2_PB30F)
#define PORT_TCC1_WO2_PB30F        (1u << 30)
#define PIN_TCC1_WO3_PA09F                 9  /**< \brief TCC1 signal: WO3 on PA09 mux F */
#define MUX_TCC1_WO3_PA09F                 5
#define PINMUX_TCC1_WO3_PA09F      ((PIN_TCC1_WO3_PA09F << 16) | MUX_TCC1_WO3_PA09F)
#define PORT_TCC1_WO3_PA09F        (1u <<  9)
#define PIN_TCC1_WO3_PA25F                25  /**< \brief TCC1 signal: WO3 on PA25 mux F */
#define MUX_TCC1_WO3_PA25F                 5
#define PINMUX_TCC1_WO3_PA25F      ((PIN_TCC1_WO3_PA25F << 16) | MUX_TCC1_WO3_PA25F)
#define PORT_TCC1_WO3_PA25F        (1u << 25)
#define PIN_TCC1_WO3_PB31F                63  /**< \brief TCC1 signal: WO3 on PB31 mux F */
#define MUX_TCC1_WO3_PB31F                 5
#define PINMUX_TCC1_WO3_PB31F      ((PIN_TCC1_WO3_PB31F << 16) | MUX_TCC1_WO3_PB31F)
#define PORT_TCC1_WO3_PB31F        (1u << 31)
/* ========== PORT definition for TCC2 peripheral ========== */
#define PIN_TCC2_WO0_PA12E                12  /**< \brief TCC2 signal: WO0 on PA12 mux E */
#define MUX_TCC2_WO0_PA12E                 4
#define PINMUX_TCC2_WO0_PA12E      ((PIN_TCC2_WO0_PA12E << 16) | MUX_TCC2_WO0_PA12E)
#define PORT_TCC2_WO0_PA12E        (1u << 12)
#define PIN_TCC2_WO0_PA16E                16  /**< \brief TCC2 signal: WO0 on PA16 mux E */
#define MUX_TCC2_WO0_PA16E                 4
#define PINMUX_TCC2_WO0_PA16E      ((PIN_TCC2_WO0_PA16E << 16) | MUX_TCC2_WO0_PA16E)
#define PORT_TCC2_WO0_PA16E        (1u << 16)
#define PIN_TCC2_WO0_PA00E                 0  /**< \brief TCC2 signal: WO0 on PA00 mux E */
#define MUX_TCC2_WO0_PA00E                 4
#define PINMUX_TCC2_WO0_PA00E      ((PIN_TCC2_WO0_PA00E << 16) | MUX_TCC2_WO0_PA00E)
#define PORT_TCC2_WO0_PA00E        (1u <<  0)
#define PIN_TCC2_WO1_PA13E                13  /**< \brief TCC2 signal: WO1 on PA13 mux E */
#define MUX_TCC2_WO1_PA13E                 4
#define PINMUX_TCC2_WO1_PA13E      ((PIN_TCC2_WO1_PA13E << 16) | MUX_TCC2_WO1_PA13E)
#define PORT_TCC2_WO1_PA13E        (1u << 13)
#define PIN_TCC2_WO1_PA17E                17  /**< \brief TCC2 signal: WO1 on PA17 mux E */
#define MUX_TCC2_WO1_PA17E                 4
#define PINMUX_TCC2_WO1_PA17E      ((PIN_TCC2_WO1_PA17E << 16) | MUX_TCC2_WO1_PA17E)
#define PORT_TCC2_WO1_PA17E        (1u << 17)
#define PIN_TCC2_WO1_PA01E                 1  /**< \brief TCC2 signal: WO1 on PA01 mux E */
#define MUX_TCC2_WO1_PA01E                 4
#define PINMUX_TCC2_WO1_PA01E      ((PIN_TCC2_WO1_PA01E << 16) | MUX_TCC2_WO1_PA01E)
#define PORT_TCC2_WO1_PA01E        (1u <<  1)
/* ========== PORT definition for USB peripheral ========== */
#define PIN_USB_DM_PA24G                  24  /**< \brief USB signal: DM on PA24 mux G */
#define MUX_USB_DM_PA24G                   6
#define PINMUX_USB_DM_PA24G        ((PIN_USB_DM_PA24G << 16) | MUX_USB_DM_PA24G)
#define PORT_USB_DM_PA24G          (1u << 24)
#define PIN_USB_DP_PA25G                  25  /**< \brief USB signal: DP on PA25 mux G */
#define MUX_USB_DP_PA25G                   6
#define PINMUX_USB_DP_PA25G        ((PIN_USB_DP_PA25G << 16) | MUX_USB_DP_PA25G)
#define PORT_USB_DP_PA25G          (1u << 25)
#define PIN_USB_SOF_1KHZ_PA23G            23  /**< \brief USB signal: SOF_1KHZ on PA23 mux G */
#define MUX_USB_SOF_1KHZ_PA23G             6
#define PINMUX_USB_SOF_1KHZ_PA23G  ((PIN_USB_SOF_1KHZ_PA23G << 16) | MUX_USB_SOF_1KHZ_PA23G)
#define PORT_USB_SOF_1KHZ_PA23G    (1u << 23)

/*@}*/

/* ************************************************************************** */
/**  MEMORY MAPPING DEFINITIONS FOR U3005 */
/* ************************************************************************** */

#if defined __SAML21E14A__
  #define DSU_DID_RESETVALUE   0x1081000E
  #define FLASH_SIZE           0x4000 /* 16 kB */
  #define FLASH_PAGE_SIZE      64
  #define FLASH_NB_OF_PAGES    256
  #define FLASH_USER_PAGE_SIZE 64
  #define HMCRAMCHS_SIZE       0x1000 /* 4 kB */
  #define HMCRAMCLP_SIZE       0x400 /* 1 kB */
  #define PICOPRAM_SIZE        0x400 /* 1 kB */
  #define PORT_GROUPS          1
  #define WWR_SIZE             0x200 /* 0.5 kB */

