zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#elif defined __SAML21E15A__
  #define DSU_DID_RESETVALUE   0x1081000D
  #define FLASH_SIZE           0x8000 /* 32 kB */
  #define FLASH_PAGE_SIZE      64
  #define FLASH_NB_OF_PAGES    512
  #define FLASH_USER_PAGE_SIZE 64
  #define HMCRAMCHS_SIZE       0x1000 /* 4 kB */
  #define HMCRAMCLP_SIZE       0x800 /* 2 kB */
  #define PICOPRAM_SIZE        0x400 /* 1 kB */
  #define PORT_GROUPS          1
  #define WWR_SIZE             0x400 /* 1 kB */

#elif defined __SAML21E16A__
  #define DSU_DID_RESETVALUE   0x1081000C
  #define FLASH_SIZE           0x10000 /* 64 kB */
  #define FLASH_PAGE_SIZE      64
  #define FLASH_NB_OF_PAGES    1024
  #define FLASH_USER_PAGE_SIZE 64
  #define HMCRAMCHS_SIZE       0x2000 /* 8 kB */
  #define HMCRAMCLP_SIZE       0x1000 /* 4 kB */
  #define PICOPRAM_SIZE        0x400 /* 1 kB */
  #define PORT_GROUPS          1
  #define WWR_SIZE             0x800 /* 2 kB */

#elif defined __SAML21E17A__
  #define DSU_DID_RESETVALUE   0x1081000B
  #define FLASH_SIZE           0x20000 /* 128 kB */
  #define FLASH_PAGE_SIZE      64
  #define FLASH_NB_OF_PAGES    2048
  #define FLASH_USER_PAGE_SIZE 64
  #define HMCRAMCHS_SIZE       0x4000 /* 16 kB */
  #define HMCRAMCLP_SIZE       0x1800 /* 6 kB */
  #define PICOPRAM_SIZE        0x800 /* 2 kB */
  #define PORT_GROUPS          1
  #define WWR_SIZE             0x1000 /* 4 kB */

#elif defined __SAML21E18A__
  #define DSU_DID_RESETVALUE   0x1081000A
  #define FLASH_SIZE           0x40000 /* 256 kB */
  #define FLASH_PAGE_SIZE      64
  #define FLASH_NB_OF_PAGES    4096
  #define FLASH_USER_PAGE_SIZE 64
  #define HMCRAMCHS_SIZE       0x8000 /* 32 kB */
  #define HMCRAMCLP_SIZE       0x2000 /* 8 kB */
  #define PICOPRAM_SIZE        0x800 /* 2 kB */
  #define PORT_GROUPS          1
  #define WWR_SIZE             0x2000 /* 8 kB */

#elif defined __SAML21G14A__
  #define DSU_DID_RESETVALUE   0x10810009
  #define FLASH_SIZE           0x4000 /* 16 kB */
  #define FLASH_PAGE_SIZE      64
  #define FLASH_NB_OF_PAGES    256
  #define FLASH_USER_PAGE_SIZE 64
  #define HMCRAMCHS_SIZE       0x1000 /* 4 kB */
  #define HMCRAMCLP_SIZE       0x400 /* 1 kB */
  #define PICOPRAM_SIZE        0x400 /* 1 kB */
  #define PORT_GROUPS          2
  #define WWR_SIZE             0x200 /* 0.5 kB */

#elif defined __SAML21G15A__
  #define DSU_DID_RESETVALUE   0x10810008
  #define FLASH_SIZE           0x8000 /* 32 kB */
  #define FLASH_PAGE_SIZE      64
  #define FLASH_NB_OF_PAGES    512
  #define FLASH_USER_PAGE_SIZE 64
  #define HMCRAMCHS_SIZE       0x1000 /* 4 kB */
  #define HMCRAMCLP_SIZE       0x800 /* 2 kB */
  #define PICOPRAM_SIZE        0x400 /* 1 kB */
  #define PORT_GROUPS          2
  #define WWR_SIZE             0x400 /* 1 kB */

#elif defined __SAML21G16A__
  #define DSU_DID_RESETVALUE   0x10810007
  #define FLASH_SIZE           0x10000 /* 64 kB */
  #define FLASH_PAGE_SIZE      64
  #define FLASH_NB_OF_PAGES    1024
  #define FLASH_USER_PAGE_SIZE 64
  #define HMCRAMCHS_SIZE       0x2000 /* 8 kB */
  #define HMCRAMCLP_SIZE       0x1000 /* 4 kB */
  #define PICOPRAM_SIZE        0x400 /* 1 kB */
  #define PORT_GROUPS          2
  #define WWR_SIZE             0x800 /* 2 kB */

#elif defined __SAML21G17A__
  #define DSU_DID_RESETVALUE   0x10810006
  #define FLASH_SIZE           0x20000 /* 128 kB */
  #define FLASH_PAGE_SIZE      64
  #define FLASH_NB_OF_PAGES    2048
  #define FLASH_USER_PAGE_SIZE 64
  #define HMCRAMCHS_SIZE       0x4000 /* 16 kB */
  #define HMCRAMCLP_SIZE       0x1800 /* 6 kB */
  #define PICOPRAM_SIZE        0x800 /* 2 kB */
  #define PORT_GROUPS          2
  #define WWR_SIZE             0x1000 /* 4 kB */

#elif defined __SAML21G18A__
  #define DSU_DID_RESETVALUE   0x10810005
  #define FLASH_SIZE           0x40000 /* 256 kB */
  #define FLASH_PAGE_SIZE      64
  #define FLASH_NB_OF_PAGES    4096
  #define FLASH_USER_PAGE_SIZE 64
  #define HMCRAMCHS_SIZE       0x8000 /* 32 kB */
  #define HMCRAMCLP_SIZE       0x2000 /* 8 kB */
  #define PICOPRAM_SIZE        0x800 /* 2 kB */
  #define PORT_GROUPS          2
  #define WWR_SIZE             0x2000 /* 8 kB */

#elif defined __SAML21J14A__
  #define DSU_DID_RESETVALUE   0x10810004
  #define FLASH_SIZE           0x4000 /* 16 kB */
  #define FLASH_PAGE_SIZE      64
  #define FLASH_NB_OF_PAGES    256
  #define FLASH_USER_PAGE_SIZE 64
  #define HMCRAMCHS_SIZE       0x1000 /* 4 kB */
  #define HMCRAMCLP_SIZE       0x400 /* 1 kB */
  #define PICOPRAM_SIZE        0x400 /* 1 kB */
  #define PORT_GROUPS          2
  #define WWR_SIZE             0x200 /* 0.5 kB */

#elif defined __SAML21J15A__
  #define DSU_DID_RESETVALUE   0x10810003
  #define FLASH_SIZE           0x8000 /* 32 kB */
  #define FLASH_PAGE_SIZE      64
  #define FLASH_NB_OF_PAGES    512
  #define FLASH_USER_PAGE_SIZE 64
  #define HMCRAMCHS_SIZE       0x1000 /* 4 kB */
  #define HMCRAMCLP_SIZE       0x800 /* 2 kB */
  #define PICOPRAM_SIZE        0x400 /* 1 kB */
  #define PORT_GROUPS          2
  #define WWR_SIZE             0x400 /* 1 kB */

#elif defined __SAML21J16A__
  #define DSU_DID_RESETVALUE   0x10810002
  #define FLASH_SIZE           0x10000 /* 64 kB */
  #define FLASH_PAGE_SIZE      64
  #define FLASH_NB_OF_PAGES    1024
  #define FLASH_USER_PAGE_SIZE 64
  #define HMCRAMCHS_SIZE       0x2000 /* 8 kB */
  #define HMCRAMCLP_SIZE       0x1000 /* 4 kB */
  #define PICOPRAM_SIZE        0x400 /* 1 kB */
  #define PORT_GROUPS          2
  #define WWR_SIZE             0x800 /* 2 kB */

#elif defined __SAML21J17A__
  #define DSU_DID_RESETVALUE   0x10810001
  #define FLASH_SIZE           0x20000 /* 128 kB */
  #define FLASH_PAGE_SIZE      64
  #define FLASH_NB_OF_PAGES    2048
  #define FLASH_USER_PAGE_SIZE 64
  #define HMCRAMCHS_SIZE       0x4000 /* 16 kB */
  #define HMCRAMCLP_SIZE       0x1800 /* 6 kB */
  #define PICOPRAM_SIZE        0x800 /* 2 kB */
  #define PORT_GROUPS          2
  #define WWR_SIZE             0x1000 /* 4 kB */

#elif defined __SAML21J18A__
  #define DSU_DID_RESETVALUE   0x10810000
  #define FLASH_SIZE           0x40000 /* 256 kB */
  #define FLASH_PAGE_SIZE      64
  #define FLASH_NB_OF_PAGES    4096
  #define FLASH_USER_PAGE_SIZE 64
  #define HMCRAMCHS_SIZE       0x8000 /* 32 kB */
  #define HMCRAMCLP_SIZE       0x2000 /* 8 kB */
  #define PICOPRAM_SIZE        0x800 /* 2 kB */
  #define PORT_GROUPS          2
  #define WWR_SIZE             0x2000 /* 8 kB */

#elif defined __SAMR21J18A__
  #define DSU_DID_RESETVALUE   0x1081000F
  #define FLASH_SIZE           0x40000 /* 256 kB */
  #define FLASH_PAGE_SIZE      64
  #define FLASH_NB_OF_PAGES    4096
  #define FLASH_USER_PAGE_SIZE 64
  #define HMCRAMCHS_SIZE       0x8000 /* 32 kB */
  #define HMCRAMCLP_SIZE       0x2000 /* 8 kB */
  #define PICOPRAM_SIZE        0x800 /* 2 kB */
  #define PORT_GROUPS          3
  #define WWR_SIZE             0x2000 /* 8 kB */
#else
  #error Library does not support the specified device.
#endif

#define FLASH_ADDR            (0x00000000u) /**< FLASH base address */
#define FLASH_USER_PAGE_ADDR  (0x00800000u) /**< FLASH_USER_PAGE base address */
#define HMCRAMCHS_ADDR        (0x20000000u) /**< HMCRAMCHS base address */
#define HMCRAMCLP_ADDR        (0x30000000u) /**< HMCRAMCLP base address */
#define PICOPRAM_ADDR         (0x50000000u) /**< PICOPRAM base address */

///////////////////////////////////////////////////
// fuses_params.h BEGIN ===============================================
/** @file fuses_params.h
*/
//! @par  THIS FILE IS AUTO GENERATED! DO NOT EDIT!


//! @par  Parameters definition for CAL row
typedef struct {
  uint64_t CALIB_VREFTEMP           : 4; //!< Temperature Calibration of Bandgap
  uint64_t CALIB_VREFPL0            : 8; //!< VREF Calibration of VREG in PL0
  uint64_t CALIB_VREF0              : 8; //!< VREF0 Calibration
  uint64_t BOD33STARTLEVEL          : 6; //!< BOD33 Start Level
  uint64_t BOD12STARTLEVEL          : 6; //!< BOD12 Start Level
  uint64_t OSCULP32K                : 6; //!< OSCULP32K Calibration
  uint64_t OSC16M_CAL4M_TCAL        : 6; //!< OSC16M Temp Calibration (4MHz)
  uint64_t OSC16M_CAL4M_FCAL        : 6; //!< OSC16M Freq Calibration (4MHz)
  uint64_t BUVREG_BKUPCALIB         : 4; //!< BU VREG calibration in backup
  uint64_t BUVREG_NOBKUPCALIB       : 4; //!< BU VREG calibration in mode other than backup
  uint64_t NVMCTRL_MENSTARTUP_DIS   : 1; //!< NVM deep power down mode during PU1 disable fuse
  uint64_t                          : 5;
} FUSEMAP_CAL_type;

