zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define FUSES_CALIB_VREFTEMP_OFFSET           0   //!< [3:0] Temperature Calibration of Bandgap
#define FUSES_CALIB_VREFTEMP_SIZE             4
#define FUSES_CALIB_VREFTEMP_ADDR             0x00800000
#define FUSES_CALIB_VREFTEMP_MASK             0x0000000F

#define FUSES_CALIB_VREFPL0_OFFSET            4   //!< [11:4] VREF Calibration of VREG in PL0
#define FUSES_CALIB_VREFPL0_SIZE              8
#define FUSES_CALIB_VREFPL0_ADDR              0x00800000
#define FUSES_CALIB_VREFPL0_MASK              0x00000FF0

#define FUSES_CALIB_VREF0_OFFSET              12  //!< [19:12] VREF0 Calibration
#define FUSES_CALIB_VREF0_SIZE                8
#define FUSES_CALIB_VREF0_ADDR                0x00800000
#define FUSES_CALIB_VREF0_MASK                0x000FF000

#define FUSES_BOD33STARTLEVEL_OFFSET          20  //!< [25:20] BOD33 Start Level
#define FUSES_BOD33STARTLEVEL_SIZE            6
#define FUSES_BOD33STARTLEVEL_ADDR            0x00800000
#define FUSES_BOD33STARTLEVEL_MASK            0x03F00000

#define FUSES_BOD12STARTLEVEL_OFFSET          26  //!< [31:26] BOD12 Start Level
#define FUSES_BOD12STARTLEVEL_SIZE            6
#define FUSES_BOD12STARTLEVEL_ADDR            0x00800000
#define FUSES_BOD12STARTLEVEL_MASK            0xFC000000

#define FUSES_OSCULP32K_OFFSET                0   //!< [37:32] OSCULP32K Calibration
#define FUSES_OSCULP32K_SIZE                  6
#define FUSES_OSCULP32K_ADDR                  0x00800004
#define FUSES_OSCULP32K_MASK                  0x0000003F

#define FUSES_OSC16M_CAL4M_TCAL_OFFSET        6   //!< [43:38] OSC16M Temp Calibration (4MHz)
#define FUSES_OSC16M_CAL4M_TCAL_SIZE          6
#define FUSES_OSC16M_CAL4M_TCAL_ADDR          0x00800004
#define FUSES_OSC16M_CAL4M_TCAL_MASK          0x00000FC0

#define FUSES_OSC16M_CAL4M_FCAL_OFFSET        12  //!< [49:44] OSC16M Freq Calibration (4MHz)
#define FUSES_OSC16M_CAL4M_FCAL_SIZE          6
#define FUSES_OSC16M_CAL4M_FCAL_ADDR          0x00800004
#define FUSES_OSC16M_CAL4M_FCAL_MASK          0x0003F000

#define FUSES_BUVREG_BKUPCALIB_OFFSET         18  //!< [53:50] BU VREG calibration in backup
#define FUSES_BUVREG_BKUPCALIB_SIZE           4
#define FUSES_BUVREG_BKUPCALIB_ADDR           0x00800004
#define FUSES_BUVREG_BKUPCALIB_MASK           0x003C0000

#define FUSES_BUVREG_NOBKUPCALIB_OFFSET       22  //!< [57:54] BU VREG calibration in mode other than backup
#define FUSES_BUVREG_NOBKUPCALIB_SIZE         4
#define FUSES_BUVREG_NOBKUPCALIB_ADDR         0x00800004
#define FUSES_BUVREG_NOBKUPCALIB_MASK         0x03C00000

#define FUSES_NVMCTRL_MENSTARTUP_DIS_OFFSET   26  //!< [58] NVM deep power down mode during PU1 disable fuse
#define FUSES_NVMCTRL_MENSTARTUP_DIS_SIZE     1
#define FUSES_NVMCTRL_MENSTARTUP_DIS_ADDR     0x00800004
#define FUSES_NVMCTRL_MENSTARTUP_DIS_MASK     0x04000000

//! @par  Parameters definition for LOCKBIT row
typedef struct {
  uint64_t NVMCTRL_LOCKFIELD        : 8; //!< LOCK Region
  uint64_t                          :56;
} FUSEMAP_LOCKBIT_type;

#define FUSES_NVMCTRL_LOCKFIELD_OFFSET        0   //!< [7:0] LOCK Region
#define FUSES_NVMCTRL_LOCKFIELD_SIZE          8
#define FUSES_NVMCTRL_LOCKFIELD_ADDR          0x00802000
#define FUSES_NVMCTRL_LOCKFIELD_MASK          0x000000FF

//! @par  Parameters definition for OTP1 row
typedef struct {
  uint64_t NVMCTRL_NVM_LOCK         : 8; //!< NVM Lock
  uint64_t NVMCTRL_PSZ              : 2; //!< NVM Page Size
  uint64_t                          : 6;
  uint64_t NVMCTRL_NVMP             :13; //!< Number of NVM Pages
  uint64_t                          : 3;
  uint64_t NVMCTRL_WWREEP           : 8; //!< None
  uint64_t                          :24;
} FUSEMAP_OTP1_type;

#define FUSES_NVMCTRL_NVM_LOCK_OFFSET         0   //!< [7:0] NVM Lock
#define FUSES_NVMCTRL_NVM_LOCK_SIZE           8
#define FUSES_NVMCTRL_NVM_LOCK_ADDR           0x00806000
#define FUSES_NVMCTRL_NVM_LOCK_MASK           0x000000FF

#define FUSES_NVMCTRL_PSZ_OFFSET              8   //!< [9:8] NVM Page Size
#define FUSES_NVMCTRL_PSZ_SIZE                2
#define FUSES_NVMCTRL_PSZ_ADDR                0x00806000
#define FUSES_NVMCTRL_PSZ_MASK                0x00000300

#define FUSES_NVMCTRL_NVMP_OFFSET             16  //!< [28:16] Number of NVM Pages
#define FUSES_NVMCTRL_NVMP_SIZE               13
#define FUSES_NVMCTRL_NVMP_ADDR               0x00806000
#define FUSES_NVMCTRL_NVMP_MASK               0x1FFF0000

#define FUSES_NVMCTRL_WWREEP_OFFSET           0   //!< [39:32] None
#define FUSES_NVMCTRL_WWREEP_SIZE             8
#define FUSES_NVMCTRL_WWREEP_ADDR             0x00806004
#define FUSES_NVMCTRL_WWREEP_MASK             0x000000FF

//! @par  Parameters definition for OTP2 row
typedef struct {
  uint64_t DSU_DID_DEVSEL           : 8; //!< Device select
  uint64_t DSU_DID_SERIES           : 3; //!< Device series
  uint64_t DSU_HSRAM_SIZE           : 4; //!< System RAM Size
  uint64_t DSUSTANDBY_PACKAGE_TYPE  : 4; //!< Package Option
  uint64_t DSUSTANDBY_ME_ADC        : 1; //!< ADC is implemented
  uint64_t DSUSTANDBY_ME_AC         : 1; //!< AC is implemented
  uint64_t DSUSTANDBY_ME_DAC        : 1; //!< DAC is implemented
  uint64_t DSUSTANDBY_DAC_DUAL      : 1; //!< None
  uint64_t DSUSTANDBY_ME_SERCOM45   : 1; //!< SERCOM4/5 are implemented
  uint64_t DSUSTANDBY_ME_TC23       : 1; //!< TC2/3 are implemented
  uint64_t DSUSTANDBY_ME_PTC        : 1; //!< PTC is implemented
  uint64_t DSU_ME_USB               : 1; //!< USB is implemented
  uint64_t DSU_USB_DEVONLY_N        : 1; //!< None
  uint64_t DSUSTANDBY_SIP_TYPE      : 2; //!< SIP Type
  uint64_t DSUSTANDBY_ME_OPAMP      : 1; //!< OPAMP is implemented
  uint64_t DSUSTANDBY_ME_AES        : 1; //!< AES is implemented
  uint64_t DSUSTANDBY_ME_TRNG       : 1; //!< TRNG is implemented
  uint64_t DSUSTANDBY_ME_PPP_N      : 1; //!< PPP is implemented
  uint64_t                          : 1;
  uint64_t DSUSTANDBY_ME_RFCTRL     : 1; //!< RFCTRL is implemente
  uint64_t DSUSTANDBY_LPRAM_SIZE    : 2; //!< None
  uint64_t DSUSTANDBY_PD1_RAM_BIAS  : 3; //!< PD1 RAM Bias
  uint64_t DSUSTANDBY_PD1_RAM_RMARGIN: 4; //!< PD1 RAM Read Margin
  uint64_t DSUSTANDBY_PD2_RAM_BIAS  : 3; //!< PD2 RAM Bias
  uint64_t DSU_PD2_RAM_RMARGIN      : 4; //!< PD2 RAM Read Margin
  uint64_t                          :12;
} FUSEMAP_OTP2_type;

