zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define FUSES_DSU_DID_DEVSEL_OFFSET           0   //!< [7:0] Device select
#define FUSES_DSU_DID_DEVSEL_SIZE             8
#define FUSES_DSU_DID_DEVSEL_ADDR             0x00806008
#define FUSES_DSU_DID_DEVSEL_MASK             0x000000FF

#define FUSES_DSU_DID_SERIES_OFFSET           8   //!< [10:8] Device series
#define FUSES_DSU_DID_SERIES_SIZE             3
#define FUSES_DSU_DID_SERIES_ADDR             0x00806008
#define FUSES_DSU_DID_SERIES_MASK             0x00000700

#define FUSES_DSU_HSRAM_SIZE_OFFSET           11  //!< [14:11] System RAM Size
#define FUSES_DSU_HSRAM_SIZE_SIZE             4
#define FUSES_DSU_HSRAM_SIZE_ADDR             0x00806008
#define FUSES_DSU_HSRAM_SIZE_MASK             0x00007800

#define FUSES_DSUSTANDBY_PACKAGE_TYPE_OFFSET  15  //!< [18:15] Package Option
#define FUSES_DSUSTANDBY_PACKAGE_TYPE_SIZE    4
#define FUSES_DSUSTANDBY_PACKAGE_TYPE_ADDR    0x00806008
#define FUSES_DSUSTANDBY_PACKAGE_TYPE_MASK    0x00078000

#define FUSES_DSUSTANDBY_ME_ADC_OFFSET        19  //!< [19] ADC is implemented
#define SYSTEM_DCFG_ME_ADC_POS                19  //!< Duplicated param needed by apb_mapper generator to handle module_enable
#define FUSES_DSUSTANDBY_ME_ADC_SIZE          1
#define FUSES_DSUSTANDBY_ME_ADC_ADDR          0x00806008
#define FUSES_DSUSTANDBY_ME_ADC_MASK          0x00080000

#define FUSES_DSUSTANDBY_ME_AC_OFFSET         20  //!< [20] AC is implemented
#define SYSTEM_DCFG_ME_AC_POS                 20  //!< Duplicated param needed by apb_mapper generator to handle module_enable
#define FUSES_DSUSTANDBY_ME_AC_SIZE           1
#define FUSES_DSUSTANDBY_ME_AC_ADDR           0x00806008
#define FUSES_DSUSTANDBY_ME_AC_MASK           0x00100000

#define FUSES_DSUSTANDBY_ME_DAC_OFFSET        21  //!< [21] DAC is implemented
#define SYSTEM_DCFG_ME_DAC_POS                21  //!< Duplicated param needed by apb_mapper generator to handle module_enable
#define FUSES_DSUSTANDBY_ME_DAC_SIZE          1
#define FUSES_DSUSTANDBY_ME_DAC_ADDR          0x00806008
#define FUSES_DSUSTANDBY_ME_DAC_MASK          0x00200000

#define FUSES_DSUSTANDBY_DAC_DUAL_OFFSET      22  //!< [22] None
#define FUSES_DSUSTANDBY_DAC_DUAL_SIZE        1
#define FUSES_DSUSTANDBY_DAC_DUAL_ADDR        0x00806008
#define FUSES_DSUSTANDBY_DAC_DUAL_MASK        0x00400000

#define FUSES_DSUSTANDBY_ME_SERCOM45_OFFSET   23  //!< [23] SERCOM4/5 are implemented
#define SYSTEM_DCFG_ME_SERCOM45_POS           23  //!< Duplicated param needed by apb_mapper generator to handle module_enable
#define FUSES_DSUSTANDBY_ME_SERCOM45_SIZE     1
#define FUSES_DSUSTANDBY_ME_SERCOM45_ADDR     0x00806008
#define FUSES_DSUSTANDBY_ME_SERCOM45_MASK     0x00800000

#define FUSES_DSUSTANDBY_ME_TC23_OFFSET       24  //!< [24] TC2/3 are implemented
#define SYSTEM_DCFG_ME_TC23_POS               24  //!< Duplicated param needed by apb_mapper generator to handle module_enable
#define FUSES_DSUSTANDBY_ME_TC23_SIZE         1
#define FUSES_DSUSTANDBY_ME_TC23_ADDR         0x00806008
#define FUSES_DSUSTANDBY_ME_TC23_MASK         0x01000000

#define FUSES_DSUSTANDBY_ME_PTC_OFFSET        25  //!< [25] PTC is implemented
#define SYSTEM_DCFG_ME_PTC_POS                25  //!< Duplicated param needed by apb_mapper generator to handle module_enable
#define FUSES_DSUSTANDBY_ME_PTC_SIZE          1
#define FUSES_DSUSTANDBY_ME_PTC_ADDR          0x00806008
#define FUSES_DSUSTANDBY_ME_PTC_MASK          0x02000000

#define FUSES_DSU_ME_USB_OFFSET               26  //!< [26] USB is implemented
#define SYSTEM_DCFG_ME_USB_POS                26  //!< Duplicated param needed by apb_mapper generator to handle module_enable
#define FUSES_DSU_ME_USB_SIZE                 1
#define FUSES_DSU_ME_USB_ADDR                 0x00806008
#define FUSES_DSU_ME_USB_MASK                 0x04000000

#define FUSES_DSU_USB_DEVONLY_N_OFFSET        27  //!< [27] None
#define FUSES_DSU_USB_DEVONLY_N_SIZE          1
#define FUSES_DSU_USB_DEVONLY_N_ADDR          0x00806008
#define FUSES_DSU_USB_DEVONLY_N_MASK          0x08000000

#define FUSES_DSUSTANDBY_SIP_TYPE_OFFSET      28  //!< [29:28] SIP Type
#define FUSES_DSUSTANDBY_SIP_TYPE_SIZE        2
#define FUSES_DSUSTANDBY_SIP_TYPE_ADDR        0x00806008
#define FUSES_DSUSTANDBY_SIP_TYPE_MASK        0x30000000

#define FUSES_DSUSTANDBY_ME_OPAMP_OFFSET      30  //!< [30] OPAMP is implemented
#define SYSTEM_DCFG_ME_OPAMP_POS              30  //!< Duplicated param needed by apb_mapper generator to handle module_enable
#define FUSES_DSUSTANDBY_ME_OPAMP_SIZE        1
#define FUSES_DSUSTANDBY_ME_OPAMP_ADDR        0x00806008
#define FUSES_DSUSTANDBY_ME_OPAMP_MASK        0x40000000

#define FUSES_DSUSTANDBY_ME_AES_OFFSET        31  //!< [31] AES is implemented
#define SYSTEM_DCFG_ME_AES_POS                31  //!< Duplicated param needed by apb_mapper generator to handle module_enable
#define FUSES_DSUSTANDBY_ME_AES_SIZE          1
#define FUSES_DSUSTANDBY_ME_AES_ADDR          0x00806008
#define FUSES_DSUSTANDBY_ME_AES_MASK          0x80000000

#define FUSES_DSUSTANDBY_ME_TRNG_OFFSET       0   //!< [32] TRNG is implemented
#define SYSTEM_DCFG_ME_TRNG_POS               32  //!< Duplicated param needed by apb_mapper generator to handle module_enable
#define FUSES_DSUSTANDBY_ME_TRNG_SIZE         1
#define FUSES_DSUSTANDBY_ME_TRNG_ADDR         0x0080600C
#define FUSES_DSUSTANDBY_ME_TRNG_MASK         0x00000001

#define FUSES_DSUSTANDBY_ME_PPP_N_OFFSET      1   //!< [33] PPP is implemented
#define SYSTEM_DCFG_ME_PPP_N_POS              33  //!< Duplicated param needed by apb_mapper generator to handle module_enable
#define FUSES_DSUSTANDBY_ME_PPP_N_SIZE        1
#define FUSES_DSUSTANDBY_ME_PPP_N_ADDR        0x0080600C
#define FUSES_DSUSTANDBY_ME_PPP_N_MASK        0x00000002

#define FUSES_DSUSTANDBY_ME_RFCTRL_OFFSET     3   //!< [35] RFCTRL is implemente
#define SYSTEM_DCFG_ME_RFCTRL_POS             35  //!< Duplicated param needed by apb_mapper generator to handle module_enable
#define FUSES_DSUSTANDBY_ME_RFCTRL_SIZE       1
#define FUSES_DSUSTANDBY_ME_RFCTRL_ADDR       0x0080600C
#define FUSES_DSUSTANDBY_ME_RFCTRL_MASK       0x00000008

#define FUSES_DSUSTANDBY_LPRAM_SIZE_OFFSET    4   //!< [37:36] None
#define FUSES_DSUSTANDBY_LPRAM_SIZE_SIZE      2
#define FUSES_DSUSTANDBY_LPRAM_SIZE_ADDR      0x0080600C
#define FUSES_DSUSTANDBY_LPRAM_SIZE_MASK      0x00000030

#define FUSES_DSUSTANDBY_PD1_RAM_BIAS_OFFSET  6   //!< [40:38] PD1 RAM Bias
#define FUSES_DSUSTANDBY_PD1_RAM_BIAS_SIZE    3
#define FUSES_DSUSTANDBY_PD1_RAM_BIAS_ADDR    0x0080600C
#define FUSES_DSUSTANDBY_PD1_RAM_BIAS_MASK    0x000001C0

#define FUSES_DSUSTANDBY_PD1_RAM_RMARGIN_OFFSET 9   //!< [44:41] PD1 RAM Read Margin
#define FUSES_DSUSTANDBY_PD1_RAM_RMARGIN_SIZE 4
#define FUSES_DSUSTANDBY_PD1_RAM_RMARGIN_ADDR 0x0080600C
#define FUSES_DSUSTANDBY_PD1_RAM_RMARGIN_MASK 0x00001E00

#define FUSES_DSUSTANDBY_PD2_RAM_BIAS_OFFSET  13  //!< [47:45] PD2 RAM Bias
#define FUSES_DSUSTANDBY_PD2_RAM_BIAS_SIZE    3
#define FUSES_DSUSTANDBY_PD2_RAM_BIAS_ADDR    0x0080600C
#define FUSES_DSUSTANDBY_PD2_RAM_BIAS_MASK    0x0000E000

