zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define FUSES_DSU_PD2_RAM_RMARGIN_OFFSET      16  //!< [51:48] PD2 RAM Read Margin
#define FUSES_DSU_PD2_RAM_RMARGIN_SIZE        4
#define FUSES_DSU_PD2_RAM_RMARGIN_ADDR        0x0080600C
#define FUSES_DSU_PD2_RAM_RMARGIN_MASK        0x000F0000

//! @par  Parameters definition for OTP3 row
typedef struct {
  uint64_t OTP_VREF1                : 8; //!< VREF1 Calibration
  uint64_t OTP_VREFPL1              : 8; //!< VREF Calibration of VREG in PL1
  uint64_t OTP_VREFPL2              : 8; //!< VREF Calibration of VREG in PL2
  uint64_t OTP_VREFPL3              : 8; //!< VREF Calibration of VREG in PL3
  uint64_t                          :32;
} FUSEMAP_OTP3_type;

#define FUSES_OTP_VREF1_OFFSET                0   //!< [7:0] VREF1 Calibration
#define FUSES_OTP_VREF1_SIZE                  8
#define FUSES_OTP_VREF1_ADDR                  0x00806010
#define FUSES_OTP_VREF1_MASK                  0x000000FF

#define FUSES_OTP_VREFPL1_OFFSET              8   //!< [15:8] VREF Calibration of VREG in PL1
#define FUSES_OTP_VREFPL1_SIZE                8
#define FUSES_OTP_VREFPL1_ADDR                0x00806010
#define FUSES_OTP_VREFPL1_MASK                0x0000FF00

#define FUSES_OTP_VREFPL2_OFFSET              16  //!< [23:16] VREF Calibration of VREG in PL2
#define FUSES_OTP_VREFPL2_SIZE                8
#define FUSES_OTP_VREFPL2_ADDR                0x00806010
#define FUSES_OTP_VREFPL2_MASK                0x00FF0000

#define FUSES_OTP_VREFPL3_OFFSET              24  //!< [31:24] VREF Calibration of VREG in PL3
#define FUSES_OTP_VREFPL3_SIZE                8
#define FUSES_OTP_VREFPL3_ADDR                0x00806010
#define FUSES_OTP_VREFPL3_MASK                0xFF000000

//! @par  Parameters definition for OTP4 row
typedef struct {
  uint64_t OSC16M_CAL8M_TCAL        : 6; //!< OSC16M Temp Calibration (8MHz)
  uint64_t OSC16M_CAL8M_FCAL        : 6; //!< OSC16M Freq Calibration (8MHz)
  uint64_t OSC16M_CAL12M_TCAL       : 6; //!< OSC16M Temp Calibration (12MHz)
  uint64_t OSC16M_CAL12M_FCAL       : 6; //!< OSC16M Freq Calibration (12MHz)
  uint64_t OSC16M_CAL16M_TCAL       : 6; //!< OSC16M Temp Calibration (16MHz)
  uint64_t OSC16M_CAL16M_FCAL       : 6; //!< OSC16M Freq Calibration (16MHz)
  uint64_t DFLL48M_TCAL             : 3; //!< DFLL48M Temperature Calibration
  uint64_t                          :25;
} FUSEMAP_OTP4_type;

#define FUSES_OSC16M_CAL8M_TCAL_OFFSET        0   //!< [5:0] OSC16M Temp Calibration (8MHz)
#define FUSES_OSC16M_CAL8M_TCAL_SIZE          6
#define FUSES_OSC16M_CAL8M_TCAL_ADDR          0x00806018
#define FUSES_OSC16M_CAL8M_TCAL_MASK          0x0000003F

#define FUSES_OSC16M_CAL8M_FCAL_OFFSET        6   //!< [11:6] OSC16M Freq Calibration (8MHz)
#define FUSES_OSC16M_CAL8M_FCAL_SIZE          6
#define FUSES_OSC16M_CAL8M_FCAL_ADDR          0x00806018
#define FUSES_OSC16M_CAL8M_FCAL_MASK          0x00000FC0

#define FUSES_OSC16M_CAL12M_TCAL_OFFSET       12  //!< [17:12] OSC16M Temp Calibration (12MHz)
#define FUSES_OSC16M_CAL12M_TCAL_SIZE         6
#define FUSES_OSC16M_CAL12M_TCAL_ADDR         0x00806018
#define FUSES_OSC16M_CAL12M_TCAL_MASK         0x0003F000

#define FUSES_OSC16M_CAL12M_FCAL_OFFSET       18  //!< [23:18] OSC16M Freq Calibration (12MHz)
#define FUSES_OSC16M_CAL12M_FCAL_SIZE         6
#define FUSES_OSC16M_CAL12M_FCAL_ADDR         0x00806018
#define FUSES_OSC16M_CAL12M_FCAL_MASK         0x00FC0000

#define FUSES_OSC16M_CAL16M_TCAL_OFFSET       24  //!< [29:24] OSC16M Temp Calibration (16MHz)
#define FUSES_OSC16M_CAL16M_TCAL_SIZE         6
#define FUSES_OSC16M_CAL16M_TCAL_ADDR         0x00806018
#define FUSES_OSC16M_CAL16M_TCAL_MASK         0x3F000000

#define FUSES_OSC16M_CAL16M_FCAL_OFFSET       30  //!< [35:30] OSC16M Freq Calibration (16MHz)
#define FUSES_OSC16M_CAL16M_FCAL_SIZE         6
#define FUSES_OSC16M_CAL16M_FCAL_ADDR         0x00806018
#define FUSES_OSC16M_CAL16M_FCAL_MASK         0x0000000FC0000000

#define FUSES_OSC16M_CAL16M_FCAL_0_OFFSET     30  //!< [31:30] OSC16M Freq Calibration (16MHz)
#define FUSES_OSC16M_CAL16M_FCAL_0_SIZE       2
#define FUSES_OSC16M_CAL16M_FCAL_0_ADDR       0x00806018
#define FUSES_OSC16M_CAL16M_FCAL_0_MASK       0xC0000000

#define FUSES_OSC16M_CAL16M_FCAL_1_OFFSET     0   //!< [35:32] OSC16M Freq Calibration (16MHz)
#define FUSES_OSC16M_CAL16M_FCAL_1_SIZE       4
#define FUSES_OSC16M_CAL16M_FCAL_1_ADDR       0x0080601C
#define FUSES_OSC16M_CAL16M_FCAL_1_MASK       0x0000000F

#define FUSES_DFLL48M_TCAL_OFFSET             4   //!< [38:36] DFLL48M Temperature Calibration
#define FUSES_DFLL48M_TCAL_SIZE               3
#define FUSES_DFLL48M_TCAL_ADDR               0x0080601C
#define FUSES_DFLL48M_TCAL_MASK               0x00000070

//! @par  Parameters definition for OTP5 row
typedef struct {
  uint64_t ADC_BIASREFBUF           : 3; //!< ADC Bias Reference Buffer Scaling
  uint64_t ADC_BIASCOMP             : 3; //!< ADC Comparator Scaling
  uint64_t OSC32K                   : 7; //!< OSC32K Calibration
  uint64_t USB_TRANSN               : 5; //!< USB pad Transn calibration
  uint64_t USB_TRANSP               : 5; //!< USB pad Transp calibration
  uint64_t USB_TRIM                 : 3; //!< USB pad Trim calibration
  uint64_t                          :38;
} FUSEMAP_OTP5_type;

#define FUSES_ADC_BIASREFBUF_OFFSET           0   //!< [2:0] ADC Bias Reference Buffer Scaling
#define FUSES_ADC_BIASREFBUF_SIZE             3
#define FUSES_ADC_BIASREFBUF_ADDR             0x00806020
#define FUSES_ADC_BIASREFBUF_MASK             0x00000007

#define FUSES_ADC_BIASCOMP_OFFSET             3   //!< [5:3] ADC Comparator Scaling
#define FUSES_ADC_BIASCOMP_SIZE               3
#define FUSES_ADC_BIASCOMP_ADDR               0x00806020
#define FUSES_ADC_BIASCOMP_MASK               0x00000038

#define FUSES_OSC32K_OFFSET                   6   //!< [12:6] OSC32K Calibration
#define FUSES_OSC32K_SIZE                     7
#define FUSES_OSC32K_ADDR                     0x00806020
#define FUSES_OSC32K_MASK                     0x00001FC0

#define FUSES_USB_TRANSN_OFFSET               13  //!< [17:13] USB pad Transn calibration
#define FUSES_USB_TRANSN_SIZE                 5
#define FUSES_USB_TRANSN_ADDR                 0x00806020
#define FUSES_USB_TRANSN_MASK                 0x0003E000

#define FUSES_USB_TRANSP_OFFSET               18  //!< [22:18] USB pad Transp calibration
#define FUSES_USB_TRANSP_SIZE                 5
#define FUSES_USB_TRANSP_ADDR                 0x00806020
#define FUSES_USB_TRANSP_MASK                 0x007C0000

#define FUSES_USB_TRIM_OFFSET                 23  //!< [25:23] USB pad Trim calibration
#define FUSES_USB_TRIM_SIZE                   3
#define FUSES_USB_TRIM_ADDR                   0x00806020
#define FUSES_USB_TRIM_MASK                   0x03800000

