zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
//! @par  Parameters definition for TEMP_LOG row
typedef struct {
  uint64_t ROOM_TEMP_VAL_INT        : 8; //!< Integer part of room temperature in oC
  uint64_t ROOM_TEMP_VAL_DEC        : 4; //!< Decimal part of room temperature
  uint64_t HOT_TEMP_VAL_INT         : 8; //!< Integer part of hot temperature in oC
  uint64_t HOT_TEMP_VAL_DEC         : 4; //!< Decimal part of hot temperature
  uint64_t ROOM_INT1V_VAL           : 8; //!< 2's complement of the internal 1V reference drift at room temperature (versus a 1.0 centered value)
  uint64_t HOT_INT1V_VAL            : 8; //!< 2's complement of the internal 1V reference drift at hot temperature (versus a 1.0 centered value)
  uint64_t ROOM_ADC_VAL             :12; //!< 12-bit ADC conversion at room temperature
  uint64_t HOT_ADC_VAL              :12; //!< 12-bit ADC conversion at hot temperature
} FUSEMAP_TEMP_LOG_type;

#define FUSES_ROOM_TEMP_VAL_INT_OFFSET        0   //!< [7:0] Integer part of room temperature in oC
#define FUSES_ROOM_TEMP_VAL_INT_SIZE          8
#define FUSES_ROOM_TEMP_VAL_INT_ADDR          0x00806030
#define FUSES_ROOM_TEMP_VAL_INT_MASK          0x000000FF

#define FUSES_ROOM_TEMP_VAL_DEC_OFFSET        8   //!< [11:8] Decimal part of room temperature
#define FUSES_ROOM_TEMP_VAL_DEC_SIZE          4
#define FUSES_ROOM_TEMP_VAL_DEC_ADDR          0x00806030
#define FUSES_ROOM_TEMP_VAL_DEC_MASK          0x00000F00

#define FUSES_HOT_TEMP_VAL_INT_OFFSET         12  //!< [19:12] Integer part of hot temperature in oC
#define FUSES_HOT_TEMP_VAL_INT_SIZE           8
#define FUSES_HOT_TEMP_VAL_INT_ADDR           0x00806030
#define FUSES_HOT_TEMP_VAL_INT_MASK           0x000FF000

#define FUSES_HOT_TEMP_VAL_DEC_OFFSET         20  //!< [23:20] Decimal part of hot temperature
#define FUSES_HOT_TEMP_VAL_DEC_SIZE           4
#define FUSES_HOT_TEMP_VAL_DEC_ADDR           0x00806030
#define FUSES_HOT_TEMP_VAL_DEC_MASK           0x00F00000

#define FUSES_ROOM_INT1V_VAL_OFFSET           24  //!< [31:24] 2's complement of the internal 1V reference drift at room temperature (versus a 1.0 centered value)
#define FUSES_ROOM_INT1V_VAL_SIZE             8
#define FUSES_ROOM_INT1V_VAL_ADDR             0x00806030
#define FUSES_ROOM_INT1V_VAL_MASK             0xFF000000

#define FUSES_HOT_INT1V_VAL_OFFSET            0   //!< [39:32] 2's complement of the internal 1V reference drift at hot temperature (versus a 1.0 centered value)
#define FUSES_HOT_INT1V_VAL_SIZE              8
#define FUSES_HOT_INT1V_VAL_ADDR              0x00806034
#define FUSES_HOT_INT1V_VAL_MASK              0x000000FF

#define FUSES_ROOM_ADC_VAL_OFFSET             8   //!< [51:40] 12-bit ADC conversion at room temperature
#define FUSES_ROOM_ADC_VAL_SIZE               12
#define FUSES_ROOM_ADC_VAL_ADDR               0x00806034
#define FUSES_ROOM_ADC_VAL_MASK               0x000FFF00

#define FUSES_HOT_ADC_VAL_OFFSET              20  //!< [63:52] 12-bit ADC conversion at hot temperature
#define FUSES_HOT_ADC_VAL_SIZE                12
#define FUSES_HOT_ADC_VAL_ADDR                0x00806034
#define FUSES_HOT_ADC_VAL_MASK                0xFFF00000

//! @par  Parameters definition for USER row
typedef struct {
  uint64_t NVMCTRL_BOOTPROT         : 3; //!< Bootloader Size
  uint64_t                          : 1;
  uint64_t NVMCTRL_EEPROM_SIZE      : 3; //!< EEPROM Size
  uint64_t                          : 1;
  uint64_t BOD33USERLEVEL           : 6; //!< BOD33 User Level
  uint64_t BOD33_DIS                : 1; //!< BOD33 Disable
  uint64_t BOD33_ACTION             : 2; //!< BOD33 Action
  uint64_t BOD12USERLEVEL           : 6; //!< BOD12 User Level
  uint64_t BOD12_DIS                : 1; //!< BOD12 Disable
  uint64_t BOD12_ACTION             : 2; //!< BOD12 Action
  uint64_t WDT_ENABLE               : 1; //!< WDT Enable
  uint64_t WDT_ALWAYSON             : 1; //!< WDT Always On
  uint64_t WDT_PER                  : 4; //!< WDT Period
  uint64_t WDT_WINDOW               : 4; //!< WDT Window
  uint64_t WDT_EWOFFSET             : 4; //!< WDT Early Warning Offset
  uint64_t WDT_WEN                  : 1; //!< WDT Window Mode Enable
  uint64_t BOD33_HYST               : 1; //!< BOD33 Hysteresis
  uint64_t BOD12_HYST               : 1; //!< BOD12 Hysteresis
  uint64_t                          : 5;
  uint64_t NVMCTRL_REGION_LOCKS     :16; //!< NVM Region Locks
} FUSEMAP_USER_type;

#define FUSES_NVMCTRL_BOOTPROT_OFFSET         0   //!< [2:0] Bootloader Size
#define FUSES_NVMCTRL_BOOTPROT_SIZE           3
#define FUSES_NVMCTRL_BOOTPROT_ADDR           0x00804000
#define FUSES_NVMCTRL_BOOTPROT_MASK           0x00000007

#define FUSES_NVMCTRL_EEPROM_SIZE_OFFSET      4   //!< [6:4] EEPROM Size
#define FUSES_NVMCTRL_EEPROM_SIZE_SIZE        3
#define FUSES_NVMCTRL_EEPROM_SIZE_ADDR        0x00804000
#define FUSES_NVMCTRL_EEPROM_SIZE_MASK        0x00000070

#define FUSES_BOD33USERLEVEL_OFFSET           8   //!< [13:8] BOD33 User Level
#define FUSES_BOD33USERLEVEL_SIZE             6
//#define FUSES_BOD33USERLEVEL_ADDR             0x00804000
#define FUSES_BOD33USERLEVEL_MASK             0x00003F00

#define FUSES_BOD33_DIS_OFFSET                14  //!< [14] BOD33 Disable
#define FUSES_BOD33_DIS_SIZE                  1
//#define FUSES_BOD33_DIS_ADDR                  0x00804000
#define FUSES_BOD33_DIS_MASK                  0x00004000

#define FUSES_BOD33_ACTION_OFFSET             15  //!< [16:15] BOD33 Action
#define FUSES_BOD33_ACTION_SIZE               2
//#define FUSES_BOD33_ACTION_ADDR               0x00804000
#define FUSES_BOD33_ACTION_MASK               0x00018000

#define FUSES_BOD12USERLEVEL_OFFSET           17  //!< [22:17] BOD12 User Level
#define FUSES_BOD12USERLEVEL_SIZE             6
#define FUSES_BOD12USERLEVEL_ADDR             0x00804000
#define FUSES_BOD12USERLEVEL_MASK             0x007E0000

#define FUSES_BOD12_DIS_OFFSET                23  //!< [23] BOD12 Disable
#define FUSES_BOD12_DIS_SIZE                  1
#define FUSES_BOD12_DIS_ADDR                  0x00804000
#define FUSES_BOD12_DIS_MASK                  0x00800000

#define FUSES_BOD12_ACTION_OFFSET             24  //!< [25:24] BOD12 Action
#define FUSES_BOD12_ACTION_SIZE               2
#define FUSES_BOD12_ACTION_ADDR               0x00804000
#define FUSES_BOD12_ACTION_MASK               0x03000000

#define FUSES_WDT_ENABLE_OFFSET               26  //!< [26] WDT Enable
#define FUSES_WDT_ENABLE_SIZE                 1
#define FUSES_WDT_ENABLE_ADDR                 0x00804000
#define FUSES_WDT_ENABLE_MASK                 0x04000000

#define FUSES_WDT_ALWAYSON_OFFSET             27  //!< [27] WDT Always On
#define FUSES_WDT_ALWAYSON_SIZE               1
#define FUSES_WDT_ALWAYSON_ADDR               0x00804000
#define FUSES_WDT_ALWAYSON_MASK               0x08000000

#define FUSES_WDT_PER_OFFSET                  28  //!< [31:28] WDT Period
#define FUSES_WDT_PER_SIZE                    4
#define FUSES_WDT_PER_ADDR                    0x00804000
#define FUSES_WDT_PER_MASK                    0xF0000000

