zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
#define FUSES_WDT_WINDOW_OFFSET               0   //!< [35:32] WDT Window
#define FUSES_WDT_WINDOW_SIZE                 4
#define FUSES_WDT_WINDOW_ADDR                 0x00804004
#define FUSES_WDT_WINDOW_MASK                 0x0000000F

#define FUSES_WDT_EWOFFSET_OFFSET             4   //!< [39:36] WDT Early Warning Offset
#define FUSES_WDT_EWOFFSET_SIZE               4
#define FUSES_WDT_EWOFFSET_ADDR               0x00804004
#define FUSES_WDT_EWOFFSET_MASK               0x000000F0

#define FUSES_WDT_WEN_OFFSET                  8   //!< [40] WDT Window Mode Enable
#define FUSES_WDT_WEN_SIZE                    1
#define FUSES_WDT_WEN_ADDR                    0x00804004
#define FUSES_WDT_WEN_MASK                    0x00000100

#define FUSES_BOD33_HYST_OFFSET               9   //!< [41] BOD33 Hysteresis
#define FUSES_BOD33_HYST_SIZE                 1
//#define FUSES_BOD33_HYST_ADDR                 0x00804004
#define FUSES_BOD33_HYST_MASK                 0x00000200

#define FUSES_BOD12_HYST_OFFSET               10  //!< [42] BOD12 Hysteresis
#define FUSES_BOD12_HYST_SIZE                 1
//#define FUSES_BOD12_HYST_ADDR                 0x00804004
#define FUSES_BOD12_HYST_MASK                 0x00000400

#define FUSES_NVMCTRL_REGION_LOCKS_OFFSET     16  //!< [63:48] NVM Region Locks
#define FUSES_NVMCTRL_REGION_LOCKS_SIZE       16
#define FUSES_NVMCTRL_REGION_LOCKS_ADDR       0x00804004
#define FUSES_NVMCTRL_REGION_LOCKS_MASK       0xFFFF0000
// fuses_params.h END ===============================================

static void load_calibrations(void)
{
    uint32_t * cal_row   = (uint32_t *)(NVMCTRL_CAL_ADDR);
    uint32_t * user_row  = (uint32_t *)(NVMCTRL_USER_ADDR);
    //uint32_t * otp1_row  = (uint32_t *)(NVMCTRL_OTP1_ADDR);
    uint32_t * otp2_row  = (uint32_t *)(NVMCTRL_OTP2_ADDR);
    uint32_t * otp3_row  = (uint32_t *)(NVMCTRL_OTP3_ADDR);
    uint32_t * otp4_row  = (uint32_t *)(NVMCTRL_OTP4_ADDR);

    uint32_t cal0;
    uint32_t cal1;
    uint32_t user_row0;
    uint32_t user_row1;
    //uint32_t otp1_0;
    //uint32_t otp1_1;
    uint32_t otp2_0;
    uint32_t otp2_1;
    uint32_t otp3_0;
    //uint32_t otp3_1;
    uint32_t otp4_0;
    uint32_t otp4_1;


    // Load CB in registers
    // -----------------------------
    // CB row
    // -----------------------------
    // read the CB row
    cal0 = cal_row[0];
    cal1 = cal_row[1];

    // CAL0
    SUPC->VREFCAL.bit.TEMP = ((FUSES_CALIB_VREFTEMP_MASK & cal0) >> FUSES_CALIB_VREFTEMP_OFFSET);     // VREFTEMP
    SUPC->MVREGCAL.bit.PL0 = (FUSES_CALIB_VREFPL0_MASK & cal0) >> FUSES_CALIB_VREFPL0_OFFSET;     // VREFPL0
    SUPC->VREFCAL.bit.VREF0 = (FUSES_CALIB_VREF0_MASK & cal0) >> FUSES_CALIB_VREF0_OFFSET;   // VREF0
    // Here, no BOD start level as this sequence is skipped when fresh from fab
    /*   SUPC->BOD33.bit.LEVEL = (FUSES_BOD33STARTLEVEL_MASK & cal0) >> FUSES_BOD33STARTLEVEL_OFFSET;       // BOD33 LEVEL */
    /*   SUPC->BOD12.bit.LEVEL = (FUSES_BOD12STARTLEVEL_MASK & cal0) >> FUSES_BOD12STARTLEVEL_OFFSET;       // BOD12 LEVEL */

    //CAL1
    OSC32KCTRL->OSCULP32K.bit.CALIB = (FUSES_OSCULP32K_MASK & cal1) >> FUSES_OSCULP32K_OFFSET; // OSCULP32K Calib
    OSCCTRL->CAL4M.bit.TCAL = (FUSES_OSC16M_CAL4M_TCAL_MASK & cal1) >> FUSES_OSC16M_CAL4M_TCAL_OFFSET;
    OSCCTRL->CAL4M.bit.FCAL = (FUSES_OSC16M_CAL4M_FCAL_MASK & cal1) >> FUSES_OSC16M_CAL4M_FCAL_OFFSET;
    /* FIXME: Adjust FCAL (0x0 ~ 0x3F) according to specific board:
     * - 0x29 for XPRO board SN: 0200000038
     */
    OSCCTRL->CAL4M.bit.FCAL = 0x29;
    SUPC->BUVREGCAL.bit.BKUP = (FUSES_BUVREG_BKUPCALIB_MASK & cal1) >> FUSES_BUVREG_BKUPCALIB_OFFSET;
    SUPC->BUVREGCAL.bit.NOTINBKUP = (FUSES_BUVREG_NOBKUPCALIB_MASK & cal1) >> FUSES_BUVREG_NOBKUPCALIB_OFFSET;

    // -----------------------------
    // AUX-0  User row
    // -----------------------------
    user_row0 = user_row[0];
    user_row1 = user_row[1];

    // Here, test mode enable for NVMCTRL is set to change the BOOTPROT and EEPROM
    NVMCTRL->TMCTRL.reg = NVMCTRL_TMCTRL_TKEY(0xD5) | NVMCTRL_TMCTRL_TMEN;
    NVMCTRL->TUSER.bit.BOOTPROT = (FUSES_NVMCTRL_BOOTPROT_MASK & user_row0) >> FUSES_NVMCTRL_BOOTPROT_OFFSET;
    NVMCTRL->TUSER.bit.EEPROM = (FUSES_NVMCTRL_EEPROM_SIZE_MASK & user_row0) >> FUSES_NVMCTRL_EEPROM_SIZE_OFFSET;
    // Disable test mode
    NVMCTRL->TMCTRL.reg = NVMCTRL_TMCTRL_TKEY(0xD5);

    // HERE, there is no way to configure by SW the BOD33 register when fresh from fab
    // Reason: this register is writtable only if fuse update has been executed before
    /*   // BOD is disabled before configuring it */
    /*   SUPC->BOD33.bit.ENABLE = 0; */
    /*   while (!SUPC->STATUS.bit.B33SRDY); */
    /*   SUPC->BOD33.bit.LEVEL = (FUSES_BOD33USERLEVEL_MASK & user_row0) >> FUSES_BOD33USERLEVEL_OFFSET; */
    /*   SUPC_BOD33_Type BOD33; */
    /*   // disable the BOD33 */
    /*   SUPC->BOD33.bit.ENABLE = 0; */
    /*   while (!SUPC->STATUS.bit.B33SRDY); */
    /*   // configure BOD33 */
    /*   BOD33 = SUPC->BOD33; */
    /*   BOD33.bit.HYST   = (FUSES_BOD33_HYST_MASK & user_row1) >> FUSES_BOD33_HYST_OFFSET; */
    /*   BOD33.bit.ACTION = (FUSES_BOD33_ACTION_MASK & user_row0) >> FUSES_BOD33_ACTION_OFFSET; */
    /*   SUPC->BOD33 = BOD33; */
    /*   SUPC->BOD33.bit.ENABLE = !((FUSES_BOD33_DIS_MASK & user_row0) >> FUSES_BOD33_DIS_OFFSET); */
    /*   while (!SUPC->STATUS.bit.B33SRDY); */

    // BOD is disabled before configuring it
    SUPC->BOD12.bit.ENABLE = 0;
    while (!SUPC->STATUS.bit.B12SRDY);
    SUPC->BOD12.bit.LEVEL = (FUSES_BOD12USERLEVEL_MASK & user_row0) >> FUSES_BOD12USERLEVEL_OFFSET;
    SUPC_BOD12_Type BOD12;
    // disable the BOD12
    SUPC->BOD12.bit.ENABLE = 0;
    while (!SUPC->STATUS.bit.B12SRDY);
    // configure BOD12
    BOD12 = SUPC->BOD12;
    BOD12.bit.HYST   = (FUSES_BOD12_HYST_MASK & user_row1) >> FUSES_BOD12_HYST_OFFSET;
    BOD12.bit.ACTION = (FUSES_BOD12_ACTION_MASK & user_row0) >> FUSES_BOD12_ACTION_OFFSET;
    SUPC->BOD12 = BOD12;
    SUPC->BOD12.bit.ENABLE = !((FUSES_BOD12_DIS_MASK & user_row0) >> FUSES_BOD12_DIS_OFFSET);
    while (!SUPC->STATUS.bit.B12SRDY);


    WDT->CTRLA.bit.ALWAYSON = (FUSES_WDT_ALWAYSON_MASK & user_row0) >> FUSES_WDT_ALWAYSON_OFFSET;
    while (WDT->SYNCBUSY.bit.ALWAYSON == 1);

    WDT->CTRLA.bit.ENABLE = (FUSES_WDT_ENABLE_MASK & user_row0) >> FUSES_WDT_ENABLE_OFFSET;
    while (WDT->SYNCBUSY.bit.ENABLE == 1);


    WDT_CONFIG_Type wdtconfig;
    WDT_EWCTRL_Type wdtewctrl;
    wdtconfig.bit.PER = (FUSES_WDT_PER_MASK & user_row0) >> FUSES_WDT_PER_OFFSET;
    wdtconfig.bit.WINDOW = (FUSES_WDT_WINDOW_MASK & user_row1) >> FUSES_WDT_WINDOW_OFFSET;
    wdtewctrl.bit.EWOFFSET = (FUSES_WDT_EWOFFSET_MASK & user_row1) >> FUSES_WDT_EWOFFSET_OFFSET;
    if ( WDT->CTRLA.bit.ALWAYSON == 1 || WDT->CTRLA.bit.ENABLE == 0 ) {
    WDT->CTRLA.bit.WEN = (FUSES_WDT_WEN_MASK & user_row1) >> FUSES_WDT_WEN_OFFSET;
    while (WDT->SYNCBUSY.bit.WEN == 1);
    }
    if ( WDT->CTRLA.bit.ALWAYSON == 0 && WDT->CTRLA.bit.ENABLE == 0 ) {
    WDT->CONFIG = wdtconfig;
    WDT->EWCTRL = wdtewctrl;
    }

    /*   tmp = NVMCTRL->LOCK.bit.LOCK; */
    /*   NVMCTRL->LOCK.bit.LOCK = (FUSES_NVMCTRL_REGION_LOCKS_MASK & user_row1) >> FUSES_NVMCTRL_REGION_LOCKS_OFFSET; */
    /*   if (NVMCTRL->LOCK.bit.LOCK != (FUSES_NVMCTRL_REGION_LOCKS_MASK & user_row1) >> FUSES_NVMCTRL_REGION_LOCKS_OFFSET) { */
    /*     printk("debug36\n"); */
    /*   } */
    /*   if (NVMCTRL->LOCK.bit.LOCK == tmp) { */
    /*     printk("debug37\n"); */
    /*   } */


