zhengwang721/ASF/sam0/utils/cmsis/saml21/include/saml21_internal.h
    // -----------------------------
    // AUX-1  OTP1
    // -----------------------------
    // Here, a MUX should be implemented to emulate the fuse udpate
    // given the fact that if the flash is erased (all one), "all-to-one" value is not downloaded into the flash
    // instead, the reset value (of the shadow register) is set

    //otp1_0 = otp1_row[0];
    //otp1_1 = otp1_row[1];


    /*   // Here, test mode enable for NVMCTRL is set to change the BOOTPROT and EEPROM */
    /*   NVMCTRL->TMCTRL.reg = NVMCTRL_TMCTRL_TKEY(0xD5) | NVMCTRL_TMCTRL_TMEN; */
    /*   tmp = NVMCTRL->PARAM.bit.PSZ;*/
    //   Security word: already with the good value
    /*   NVMCTRL->LOCK.bit.LOCK = (FUSES_NVMCTRL_NVM_LOCK_MASK & user_row1) >> FUSES_NVMCTRL_NVM_LOCK_OFFSET; */
    /*   NVMCTRL->PARAM.bit.PSZ = (FUSES_NVMCTRL_PSZ_MASK & otp1_0) >> FUSES_NVMCTRL_PSZ_OFFSET; // !!! 2 bits instead of 3 ?// */
    /*   if (NVMCTRL->PARAM.bit.PSZ != (FUSES_NVMCTRL_PSZ_MASK & otp1_0) >> FUSES_NVMCTRL_PSZ_OFFSET) { */
    /*     printk("debug42\n"); */
    /*   } */
    /*   if (NVMCTRL->PARAM.bit.PSZ == tmp) { */
    /*     printk("debug43\n"); */
    /*   } */

    /*   tmp = NVMCTRL->PARAM.bit.NVMP; */
    /*   NVMCTRL->PARAM.bit.NVMP = (FUSES_NVMCTRL_NVMP_MASK & otp1_0) >> FUSES_NVMCTRL_NVMP_OFFSET; */
    /*   if (NVMCTRL->PARAM.bit.NVMP != (FUSES_NVMCTRL_NVMP_MASK & otp1_0) >> FUSES_NVMCTRL_NVMP_OFFSET) { */
    /*     printk("debug44\n"); */
    /*   } */
    /*   if (NVMCTRL->PARAM.bit.NVMP == tmp) { */
    /*     printk("debug45\n"); */
    /*   } */

    /*   tmp = NVMCTRL->PARAM.bit.WWREEP; */
    /*   NVMCTRL->PARAM.bit.WWREEP = (FUSES_NVMCTRL_WWREEP_MASK & otp1_1) >> FUSES_NVMCTRL_WWREEP_OFFSET; */
    /*   if (NVMCTRL->PARAM.bit.WWREEP != (FUSES_NVMCTRL_WWREEP_MASK & otp1_1) >> FUSES_NVMCTRL_WWREEP_OFFSET) { */
    /*     printk("debug46\n"); */
    /*   } */
    /*   if (NVMCTRL->PARAM.bit.WWREEP == tmp) { */
    /*     printk("debug47\n"); */
    /*   } */
    /*   // Disable test mode */
    /*   NVMCTRL->TMCTRL.reg = NVMCTRL_TMCTRL_TKEY(0xD5); */

    // -----------------------------
    // AUX-1  OTP2 : Device Configuration
    // -----------------------------
    otp2_0 = otp2_row[0];
    otp2_1 = otp2_row[1];

    DSU->DCFG[0].reg = otp2_0;
    DSU->DCFG[0].reg = otp2_0;
    DSUSTANDBY->DCFG[0].reg = otp2_0;
    DSUSTANDBY->DCFG[1].reg = otp2_1;

    // -----------------------------
    // AUX-1  OTP3 :
    // -----------------------------
    otp3_0 = otp3_row[0];
    //otp3_1 = otp3_row[1];
    SUPC->VREFCAL.bit.VREF1 = (FUSES_OTP_VREF1_MASK & otp3_0) >> FUSES_OTP_VREF1_OFFSET;
    SUPC->MVREGCAL.bit.PL1 = (FUSES_OTP_VREFPL1_MASK & otp3_0) >> FUSES_OTP_VREFPL1_OFFSET;
    SUPC->MVREGCAL.bit.PL2 = (FUSES_OTP_VREFPL2_MASK & otp3_0) >> FUSES_OTP_VREFPL2_OFFSET;
    SUPC->MVREGCAL.bit.PL3 = (FUSES_OTP_VREFPL3_MASK & otp3_0) >> FUSES_OTP_VREFPL3_OFFSET;

    // -----------------------------
    // AUX-1  OTP4 :
    // -----------------------------
    otp4_0 = otp4_row[0];
    otp4_1 = otp4_row[1];
    OSCCTRL->CAL8M.bit.TCAL = (FUSES_OSC16M_CAL8M_TCAL_MASK & otp4_0) >> FUSES_OSC16M_CAL8M_TCAL_OFFSET;
    OSCCTRL->CAL8M.bit.FCAL = (FUSES_OSC16M_CAL8M_FCAL_MASK & otp4_0) >> FUSES_OSC16M_CAL8M_FCAL_OFFSET;
    OSCCTRL->CAL12M.bit.TCAL = (FUSES_OSC16M_CAL12M_TCAL_MASK & otp4_0) >> FUSES_OSC16M_CAL12M_TCAL_OFFSET;
    OSCCTRL->CAL12M.bit.FCAL = (FUSES_OSC16M_CAL12M_FCAL_MASK & otp4_0) >> FUSES_OSC16M_CAL12M_FCAL_OFFSET;
    OSCCTRL->CAL16M.bit.TCAL = (FUSES_OSC16M_CAL16M_TCAL_MASK & otp4_0) >> FUSES_OSC16M_CAL16M_TCAL_OFFSET;
    OSCCTRL->CAL16M.bit.FCAL = ((FUSES_OSC16M_CAL16M_FCAL_0_MASK & otp4_0) >> FUSES_OSC16M_CAL16M_FCAL_0_OFFSET) |
    (((FUSES_OSC16M_CAL16M_FCAL_1_MASK & otp4_1) >> FUSES_OSC16M_CAL16M_FCAL_1_OFFSET) << FUSES_OSC16M_CAL16M_FCAL_0_SIZE);

    OSCCTRL->DFLLTEST.bit.TCAL = (FUSES_DFLL48M_TCAL_MASK & otp4_0) >> FUSES_DFLL48M_TCAL_OFFSET;
}

#define DEFAULT_DCFG0_STD           0xFFFF5900
#define DEFAULT_DCFG1_STD           0x000F5EF1
#define MAGIC_CALIBRATIONS_WRITTEN  0x0000A5A5

//Default workaround for fresh part without calibrations :
// Consist in writing shadow register or testmode register with calibration
// values found in the calibration pages of the nvm.
static void software_fuse_update(void)
{
    uint32_t u32CalPresentWord;
    //if ((REG_DSU_DID & 0xFFFFFF00) != 0x10870000) {           return;
        //}
        // DID matches SAML21 DieA(0) RevA(0)
        MCLK->APBEMASK.reg = 5; //Disable PPP, Enable PAC & HMATRIXLP

    //Set protection off for DSUSTANDBY & DSU
        PAC->WRCTRL.reg = PAC_WRCTRL_KEY(PAC_WRCTRL_KEY_CLR_Val)|PAC_WRCTRL_PERID(ID_DSUSTANDBY);
        while((PAC->STATUSE.reg&PAC_STATUSA_DSUSTANDBY) > 0);
        PAC->WRCTRL.reg = PAC_WRCTRL_KEY(PAC_WRCTRL_KEY_CLR_Val)|PAC_WRCTRL_PERID(ID_DSU);
        while((PAC->STATUSB.reg&PAC_STATUSB_DSU) > 0);

    //Enable testmode to access shadow registers,
    // this is only possible when the debugger is connected
    DSUSTANDBY->TESTMODE.reg |= 0x1;
    if(!((DSU->TESTMODE.reg & 0x1) || (DSUSTANDBY->TESTMODE.reg & 0x1)))
    {
        while(1)// Error dsu_test_enable not set
        {
        }
    }

    //Load default configuration for the device, will be changed later
    DSU->DCFG[0].reg = DEFAULT_DCFG0_STD;
    DSU->DCFG[1].reg = DEFAULT_DCFG1_STD;
    DSUSTANDBY->DCFG[0].reg = DEFAULT_DCFG0_STD;
    DSUSTANDBY->DCFG[1].reg = DEFAULT_DCFG1_STD;

    //Disable WDT
    WDT->CTRLA.bit.ALWAYSON = 0 >> FUSES_WDT_ALWAYSON_OFFSET;
    while (WDT->SYNCBUSY.bit.ALWAYSON == 1);
    WDT->CTRLA.bit.ENABLE = 0 >> FUSES_WDT_ENABLE_OFFSET;
    while (WDT->SYNCBUSY.bit.ENABLE == 1);

    //Check if the part has received the factory calibration, if yes, apply them
    u32CalPresentWord=*((volatile uint32_t*)NVMCTRL_AUX3_ADDRESS);
    if(u32CalPresentWord==MAGIC_CALIBRATIONS_WRITTEN)
    {
        load_calibrations();
    }

    //Disable testmode
    DSUSTANDBY->TESTMODE.reg = 0;
}


#endif /* SAML21_INTERNAL_H */
